#==============================================================================
# ■ RPG::Kungfu
#------------------------------------------------------------------------------
# 　定义Kungfu模块属性
#   类型type：1-内功，2-拳脚，3-剑法，4-刀法，5-杖法，6-鞭法，7-棍法，8-法术，
#             9-轻功，10-招架，11-知识
#   绝招skill：绝招ID数组
#   攻击描述atk_word：[[等级,描述,命中类型,AP?,DP?,PP?,伤害?,威力?]...]
#   防守描述def_word：[描述...]
#==============================================================================

module RPG
  class Kungfu
    #--------------------------------------------------------------------------
    # ● 定义实例变量
    #--------------------------------------------------------------------------
    attr_accessor :id                       # 序号
    attr_accessor :name                     # 名称
    attr_accessor :type                     # 类型
    attr_accessor :skill                    # 绝招
    attr_accessor :atk_word                 # 攻击描述
    attr_accessor :def_word                 # 防守描述
    #--------------------------------------------------------------------------
    # ● 初始化对像
    #--------------------------------------------------------------------------
    def initialize
      super
      @id = 0
      @name = ""
      @type = 0
      @skill = []
      @atk_word = []
      @def_word = []
    end
  end
end