class Game_Map
  #--------------------------------------------------------------------------
  # ● 获取指定位置的事件 ID，没有事件返回nil
  #     x          : X 坐标
  #     y          : Y 坐标
  #--------------------------------------------------------------------------
  def check_event(x, y)
    for event in $game_map.events.values
      if event.x == x and event.y == y
        return event.id
      end
    end
    return nil
  end
end
#--------------------------------------------------------------------------
  # ● 生成新的数据库
  #--------------------------------------------------------------------------
  def new_data
    # 功夫数据
    $data_kungfus = [nil]
    kungfu={1=>[1,"基本内功",0,0,0,0],2=>[2,"基本拳脚",0,0,0,0],
            3=>[3,"基本剑术",0,0,0,0],4=>[4,"基本刀法",0,0,0,0],
            5=>[5,"基本杖法",0,0,0,0],6=>[6,"基本鞭法",0,0,0,0],
            7=>[7,"基本棍法",0,0,0,0],8=>[8,"基本法术",0,0,0,0],
            9=>[9,"基本轻功",0,0,0,0],10=>[10,"基本招架",0,0,0,0],
            11=>[11,"读书识字",0,0,0,0],12=>[2,"八卦游身掌",1,0,0,0],
            13=>[2,"八阵八卦掌",2,0,0,0],14=>[4,"八卦刀",3,4,0,0],
            15=>[9,"游龙身法",0,0,0,0],16=>[1,"混元一气功",0,0,0,0],
            17=>[2,"一剪梅花手",0,0,0,0],18=>[4,"柳叶刀法",5,0,0,0],
            19=>[6,"花团鞭法",6,0,0,0],20=>[9,"飞蝶身法",0,0,0,0],
            21=>[1,"三花聚顶",7,0,0,0],22=>[11,"驻颜术",0,0,0,0],
            23=>[2,"太祖长拳",0,0,0,0],24=>[5,"乱披风杖法",8,0,0,0],
            25=>[9,"鹤翔身法",0,0,0,0],26=>[1,"普天同济",9,10,0,0],
            27=>[11,"红莲教义",0,0,0,0],28=>[2,"无法拳",0,0,0,0],
            29=>[4,"川枫一刀流",11,12,0,0],30=>[9,"无影遁形",0,0,0,0],
            31=>[1,"扶桑忍术",13,14,0,0],32=>[2,"太极拳",15,16,17,18],
            33=>[3,"太极剑",19,20,21,0],34=>[4,"玄虚刀法",0,0,0,0],
            35=>[9,"万流归一",0,0,0,0],36=>[1,"太极神功",0,0,0,0],
            37=>[2,"雪影擒拿手",22,0,0,0],38=>[3,"入门十三式",0,0,0,0],
            39=>[3,"雪山剑法",23,0,0,0],40=>[9,"踏雪无痕",0,0,0,0],
            41=>[1,"雪山内功",24,0,0,0],42=>[2,"赤尻连拳",0,0,0,0],
            43=>[2,"猛虎拳",25,0,0,0],44=>[2,"鹰爪功",26,27,0,0],
            45=>[4,"鳄灵刀",0,0,0,0],46=>[9,"五禽戏",0,0,0,0],
            47=>[1,"龙象般若功",28,0,0,0],48=>[11,"灵通心诀",0,0,0,0],
            49=>[2,"天师掌法",0,0,0,0],50=>[9,"灵符身法",0,0,0,0],
            51=>[1,"谷衣心法",0,0,0,0],52=>[8,"五雷咒",29,30,31,32],
            53=>[8,"万鸦咒",33,34,35,36],54=>[8,"玄冰咒",37,38,39,40],
            55=>[11,"天师正道",0,0,0,0],56=>[11,"吸血大法",0,0,0,0],
            57=>[2,"阴阳诀",0,0,0,0],58=>[3,"三环套月",0,0,0,0],
            59=>[4,"旋风三连斩",0,0,0,0]}
              # 八卦游身掌
    atk_word={12=>[[0,"user一招「背心钉」转到target的身后一掌猛向target背心灵台穴拍去",4,5,0,0,0,80],
                   [0,"user一招「游空探爪」，飞起身形自半空中变掌为爪锁向targetposition",4,0,0,0,0,60],
                   [0,"user大喝一声，身形下伏，一招「劈雷坠地」捶向target双腿",4,0,0,0,0,40],
                   [0,"user运气于掌，一瞬间掌心变得血红，一式「掌心雷」推向target",0,15,10,10,0,100],
                   [0,"user阴手翻起阳手跟进，一招「没遮拦」结结实实的捶向targetposition",4,0,0,0,0,70],
                   [0,"user上步抢身，招中套招，一招「劈挂连环」连环攻向target",4,10,0,0,0,50]],
              # 八阵八卦掌
              13=>[[0,"user走天阵跨乾位，使一招「天道无常」，抖臂发劲一掌攻向target",4,5,0,0,0,80],
                   [19,"user转地阵居坤位，一招「地震三岗」直取target",4,0,0,0,0,90],
                   [29,"user上风阵取巽位，一招「风起云涌」掌势变幻击向target",4,0,0,0,0,100],
                   [39,"user过云阵居震位，一式「云海茫茫」双掌交错击向targetposition",0,5,0,0,0,110],
                   [49,"user脚下方位变幻，一招「飞龙居坎」左掌斜引右掌穿出，拍向targetposition",4,0,0,0,0,120],
                   [59,"user脚踏八卦方位，一招「鸟翔归离」却步抽身双掌一前一后相继击向target",4,10,0,0,0,100],
                   [69,"user步法虽疾但八卦方位丝毫不乱，一招「蜿盘退艮」守中带攻右掌划向targetposition",4,5,0,0,0,150],
                   [79,"user身法越转越快，一瞬间踏遍天地风云四门，「四正四奇」连攻八掌",4,5,0,0,0,180],
                   [89,"user默念口诀，由归寐转无妄，自同人趋大有，一招「四开四阖」连出十六掌",4,10,0,0,0,220]],
              # 八卦刀
              14=>[[0,"user一招「回身劈山刀」左足踏上一步，蓦地里横刀转身，呼的一声，向targetposition削去",1,0,0,0,40,0],
                   [19,"user踏前数步「上步劈山」，刀带劲风由上而下劈向target",1,0,0,0,50,0],
                   [29,"user双手抱刀，急退两步翻身跃起，一招「童子拜佛」力劈target",1,5,0,0,60,0],
                   [39,"user一招「朝阳刀」直劈targetposition，刀身带动劲风直刮得target耳边生疼",1,0,0,0,75,0],
                   [49,"user一招「削耳撩腮」舞个刀花，target上盘要害尽被笼罩",1,5,0,0,80,0],
                   [59,"user急踏两步，一招「上步撩刀」由下而上撩向target小腹",1,10,0,0,90,0],
                   [69,"user刀交左手「仙人指路」直刺target，同时右手骈指点向targetposition",2,0,0,0,50,50],
                   [79,"user一招「夜叉探海」竟以刀做剑，中宫直进刺向target",2,0,0,0,120,0]],
              # 一剪梅花手
              17=>[[0,"user使一招「轻解罗裳」，对准target的position轻飘飘的扫去",3,0,0,0,0,80],
                   [0,"user扬起右手，一招「独上兰舟」便往target的position拍去",3,0,0,0,0,60],
                   [0,"user左手虚晃，右手「月满西楼」，往target的position击出",3,0,0,0,0,0],
                   [0,"user左手微分，右手一长使出一招「雁字回时」，抓向target的position",5,0,0,0,0,100],
                   [0,"user倏地一个转身，双手一挑「一种相思」直掼targetposition",3,0,0,0,0,90],
                   [0,"user左手虚晃，右掌飘飘，一招「两处闲愁」击向targetposition",0,0,0,0,0,150],
                   [0,"user右手在targetposition划过，随后一招「才下眉头」左手又向同一方位抓到",5,0,0,0,0,60],
                   [0,"user左手虚晃，右手握成拳，一招「却上心头」，击向target的前胸",0,0,0,0,0,120]],
              # 柳叶刀法
              18=>[[0,"user使一招「春风拂人醉」，手中weapon轻飘飘地向target的position斩去",1,0,0,0,20,0],
                   [20,"user轻舒玉手，weapon随着一招「远山伴人痴」由下而上撩往target的position",1,0,0,0,40,0],
                   [40,"user身形微转，一招「飞花逐人香」weapon刀光不定，刺向target的position",2,5,0,0,40,0],
                   [50,"user使一招「柳叶随人笑」，迅速无伦地劈向target的position",1,0,0,0,50,0],
                   [60,"user手中weapon颤动，一招「倩影惹人怜」，往target的position斜斜砍出",1,0,0,0,60,0],
                   [70,"user提刀轻举，一招「芦雪碎人影」劈向targetposition",1,0,0,0,65,0],
                   [80,"user移步侧身，使一招「彩蝶灼人衣」刀光闪闪斩向target的position",1,0,0,0,70,0]],
              # 花团鞭法
              19=>[[0,"user使一招「山花烂漫」，手中weapon划个圈子罩向target",3,0,0,0,40,0],
                   [20,"user展眸轻笑，一式「春花解语」，轻飘飘地向target的position连击数鞭",3,0,0,0,50,0],
                   [40,"user使一招「万紫嫣红」，鞭影错落鞭势杂踏，鞭梢刺向target的position",2,0,0,0,60,0],
                   [50,"user举鞭过顶手持鞭梢，一式「花落流红」，手中weapon卷向target",3,5,0,0,60,0],
                   [60,"user使一招「飞花逐蝶」，前鞭未收次鞭又至，一瞬间连抽十几鞭",3,0,0,0,70,0],
                   [70,"user使一招「花调无声」，weapon不带一点风声抽向target，快得不可思议",3,10,0,0,90,0],
                   [80,"user手中weapon抖得笔直，一招「花径通幽」直刺向target，鞭到中途突然转向斜刺",2,0,0,0,100,0]],
              # 太祖长拳
              23=>[[0,"user双臂直上直下连续三击，正合「击鼓三通」之拳理",3,5,0,0,0,80],
                   [0,"user一招「帝斩白蛇」，右拳变掌向targetposition横扫过去",3,0,0,0,0,60],
                   [0,"user一招「冲锋陷阵」，两拳虎口相对，猛力撞向target",3,0,0,0,0,40],
                   [0,"user坐马沉腰，沉肩发力，一招「暮鼓晨钟」，拳劲大得异乎寻常",5,15,10,10,0,100],
                   [0,"user使一招「黄袍加身」，双拳一立，垫步拧腰打向target",3,0,0,0,0,70],
                   [0,"user左拳虚晃，右拳一招「黑虎偷心」直掏target胸口",0,10,0,0,0,50]],
              # 乱披风杖法
              24=>[[0,"user一招「披风带雨」，手中weapon搂头盖顶砸向target",3,0,0,0,40,40],
                   [19,"user使一招「细风斜雨」，舞动weapon斜肩带背击向targetposition",3,0,0,0,40,80],
                   [29,"user手中weapon一挺，一招「八面来风」连出八杖，杖杖不离targetposition",3,0,0,0,60,60],
                   [39,"user招式大开大阖，一式「泼墨写意」连消带打砸向target",3,0,0,0,80,40],
                   [49,"user一招「乱石嶙峋」，手中weapon波波折折地攻向target",3,0,0,0,80,60],
                   [59,"user手握杖尾，weapon自背后扳出，一招「断砸山」带动劲风挥向target",3,5,-10,0,120,20],
                   [69,"user手中weapon一抖，竟单凭腕力点出「画龙点睛」，杖尾刺向targetposition",2,10,0,0,80,0],
                   [79,"user一招「弯弓射雕」，手中weapon脱手飞出，如箭矢般飞击target",3,5,0,-15,130,0]],
              # 无法拳
              28=>[[0,"user一招「无法无天」，左手虚晃，右拳直击target前胸",3,0,0,0,0,40],
                   [0,"user右拳一立，左拳一招「无法无章」竟不按常理反向挥出",3,0,0,0,0,40],
                   [0,"user一招「无依无据」双拳连环击向targetposition",3,0,0,0,0,30],
                   [0,"user哈哈大笑，笑声中一招「无法无规」双拳分击target右脑与右臀，实是怪异",3,0,0,0,0,20],
                   [0,"user一招「无章可寻」，左拳后发先至，右拳先发后至，齐向target袭来",3,0,0,0,0,60]],
              # 川枫一刀流
              29=>[[0,"user双手握刀，吐气扬声，一招「合气斩」集中全身力气斩向target",1,0,0,0,40,40],
                   [20,"user一招「风烈斩」，刀刃闪烁带起一股旋风，直劈target，竟势不可挡",1,-5,0,0,50,50],
                   [30,"user忽地高高跃起，一招「落燕斩」从空中头下脚上的向target力劈",1,0,0,0,50,60],
                   [50,"user一招「二角罗斩」，以刀划地，疾冲向target，两人身形交错间一道刀光斜刺飞出",1,-10,0,0,65,0],
                   [60,"user刀光闪动，竟不看target的武功来路，一式「弧光斩」在身前划一道光弧，竟后发先至",1,-5,0,0,80,0],
                   [70,"user手中weapon忽然脱手飞掷，竟然是一招「烈风手里剑」，当作暗器掷了过来",2,5,0,0,50,0],
                   [80,"user引刀向后，忽地翻为阳手，一招「樱华斩」带起漫天花雨由下而上斩向target",1,0,0,0,90,0],
                   [90,"user举刀过顶，大喝一声一招「裂地斩」却砍在地上，target正诧异间一道刀气沿地而至",1,-5,0,0,100,0]],
              # 太极拳
              32=>[[0,"user接着一招「揽雀尾」，双手划了个半圈，左阴右阳，按向target的前胸",4,0,5,5,0,20],
                   [10,"user变招「提手上势」，两臂慢慢提起至胸前，左臂半环，右臂直伸，插向target的左眼",2,0,5,5,0,30],
                   [20,"user单脚独立，左手虚按，右手使一招「白鹤亮翅」，变拳成爪向target的position插去",2,0,5,5,0,30],
                   [40,"user右臂半环，左手内旋，一招「手挥琶琶」，十指虚张，缓缓挥向target的左臂",4,0,10,10,0,40],
                   [40,"user右腿伸直，左手虚划，接著右臂外旋搬出一记「进步搬拦锤」击向target的左脚",4,0,5,5,0,40],
                   [60,"user右脚虚立，左手画圈后抚，一招「高探马」，右手圆转向前，朝target面门挥去",4,0,10,10,0,50],
                   [60,"当下user一招「斜飞势」，将target力量引偏，双拳内划，合阴阳两股劲力推向target",4,0,15,15,0,50],
                   [70,"user左手变掌横于胸前，右手握拳由肘下穿出，一招「肘底看锤」，锤向target的裆部",4,0,5,5,0,60],
                   [80,"user左脚前踏半步，右手虚张使一招「海底针」，五指由下向上戳向target的裆部",4,0,10,10,0,60],
                   [90,"user进步虚踏，双手握拳划弧挥出，使一式「玉女穿梭」，顺着target手臂直上，打向target",4,0,0,0,0,70],
                   [100,"user使出一招「云手」，左手高，右手低，一个圆圈已将target全身套住，太极柔劲随即发出",4,0,10,10,0,80],
                   [110,"user立半马步，坐腿、松胯、旋腰、扣膝，力发于腰，一招「马步靠」，靠向target的前胸",4,0,0,0,0,130],
                   [120,"user双手伸开，上身划出一个大圆弧，一招「转身摆莲」，将target笼罩在重重太极圈中",4,0,5,5,0,180],
                   [130,"user脚踏七星方位，左虚右实，双拳交叉成十字，一招「进步七星」，向target的右手推去",4,0,5,5,0,220],
                   [140,"user施出「转身搬拦捶」，上体右转，右拳由下向上经左臂内侧搬向target的前胸",4,0,10,10,0,250],
                   [150,"user来个「野马分鬃」，转向target身后，右前左后，两臂平伸在target身上发劲一靠",4,0,5,5,0,280],
                   [160,"user左右手臂外旋变掌，两手交叉，继而左右分开，成半招「如封似闭」推向target前胸",4,0,15,15,0,350],
                   [170,"user上体微右转，屈膝坐胯，出招「十字手」，两臂微内旋，分别向target体两侧划弧发掌",4,0,10,10,0,380]],
              # 太极剑
              33=>[[0,"user右脚向前一步，左膝提起，weapon向前上方划出一招「宿鸟投林」，刺向target的position",2,-5,0,0,20,0],
                   [9,"只见user一反身，手中weapon向前划了一个大弧，使一招「流星赶月」，回劈target的position",1,-10,5,0,20,0],
                   [19,"user提起左腿，转身垫步，右脚跟进，一招「黄峰入洞」，weapon中宫直进，刺向target的position",2,-5,5,5,20,0],
                   [29,"user跟进一招「燕子抄水」，weapon自上而下划出一个大弧，平平地向target的position挥去",1,0,0,10,30,0],
                   [39,"user摆一个左虚步，手中weapon顺势划出一个整圆，一式「小魁星」撩向target的position",1,0,25,10,30,0],
                   [49,"user左脚前进一步，右手weapon一招「顺水推舟」，剑势绵绵，向前刺向target的position",2,0,10,10,30,20],
                   [59,"user右脚后撤一步，一转身，右手weapon向后反击，一招「大鹏展翅」，抹向target的position",2,0,0,15,40,0],
                   [79,"user双脚并步，身体立起，双手持weapon，一招「白猿献果」，向前平平刺向target的position",2,0,-5,0,50,0],
                   [89,"user向前连跳两步，一招「野马跳涧」，weapon向前平刺两剑，点向target的穴道",2,5,-10,-10,60,0],
                   [99,"user右脚向前垫步，一招「海底捞月」，weapon由上向后划一个大弧，向前撩向target的下盘",1,5,0,0,50,0],
                   [109,"user左脚踏实，右脚虚点，一招「仙人指路」，右手weapon带着一团剑花，逼向target的position",2,0,0,0,60,30],
                   [119,"user微一凝神，一招「探海式」，右脚独立，左膝提起，weapon向前抡劈target",1,0,0,5,70,50],
                   [129,"user一招「右拦扫」，一招「左拦扫」，剑锋平指，一气呵成横扫target",1,0,5,5,70,80],
                   [139,"user心神不乱，顺手拔出腰间weapon，一招太极剑法「圆转如意」，斜斜划圈刺向target",2,0,15,0,85,40],
                   [149,"user向前跨上一步，左手剑诀，右手weapon使出一式「指南针」，剑尖直刺target的前胸",2,5,-5,-5,95,50],
                   [159,"user一招「射雁式」，左脚跃步落地，weapon回抽，不缓不急，反手勾向target的position",2,0,-5,-5,115,0],
                   [169,"user一招「却步抽剑」，左脚跃步落地，引target进前，接着weapon回抽，反手轻点targetposition",2,10,-5,-5,115,20],
                   [179,"user右腿半屈般蹲，一招「如封似闭」，捏了个剑诀，剑尖虚指，转身撩向target的position",2,0,0,15,95,50],
                   [189,"user一招「燕子掠波」，weapon自上而下划出一个大弧，平平地向target挥去",2,5,10,0,125,80],
                   [199,"user回身拧腰，右手虚抱，一招「拨云瞻日」，weapon中宫直进，中正平和地刺向target",2,15,-15,-15,155,100]],
              # 玄虚刀法
              34=>[[0,"user刀锋斜引，身体跃起丈许，一招「劈风展翅」，手中的weapon向target横劈过去",1,0,0,0,30,0],
                   [0,"user一招「风拂山岗」，手中weapon向target的下盘划去，招未使老，忽又直挑其position",1,0,0,0,40,0],
                   [0,"user斜跨两步，抢到target左侧，一招「抽刀断水」，自左向右平平横扫target的position",1,5,0,0,30,0],
                   [0,"user一招「拨云见日」，向target虚砍一刀，刀刃忽又转向target的position砍去",1,0,0,0,45,0],
                   [0,"user身随刀进，青光闪跃，一招「苍鹰望月」，半途刀锋兜了个半圆，斜劈target的右肩",1,5,0,0,50,0],
                   [0,"user陡然身形飞起，一招「满天飞雪」，舞出万道刀光，向target的position掠去",1,10,0,0,40,0]],
              # 雪影擒拿手
              37=>[[0,"user一招「长者折梅」，双掌簸张，夹着一阵寒气直取targetposition",3,0,0,0,0,110],
                   [19,"user一招「拨云见日」，左掌划个圈子，右手变掌成爪，倏地从圈中击出",3,0,0,0,0,120],
                   [39,"user使一招「漫天飞雪」，双掌上下飞舞，夹杂着冰雪之势直取target咽喉",3,5,0,0,0,150],
                   [60,"user逆运雪山心法，脸露笑容，一招「冰谷初阳」从不可思议的角度抓向target",1,10,0,0,0,150],
                   [70,"user一招「飞雪如虹」，忽地转到target身后，直取target背心灵台穴",3,5,0,0,0,180],
                   [85,"user左手成鹰爪右手成鹤啄，忽地右手翻为虎爪左手变为龙形，正是那招「风翻云变」",3,5,-5,0,0,180],
                   [95,"user展动身形使出「雪落无声」，高高跃起，轻飘飘地一掌击向target",3,0,0,0,0,200],
                   [110,"user双掌变得雪白，一招「冰封地彻」攻向target，一时间target上盘七处要穴堪忧",3,10,-5,-5,0,250]],
              # 入门十三式
              38=>[[0,"user双手握剑，一招「朝天式」奋力刺向target的上盘",2,0,0,0,20,0],
                   [0,"user使一招「望月式」，撤剑拧身，翻身直刺target的中盘",2,0,0,0,20,0],
                   [0,"user大喝一声，一招「切藕式」，竟以剑作刀，猛力斜劈而下",1,0,0,0,25,0],
                   [0,"user剑尖斜指，舞个剑花，忽地一招「抢地式」，反挑target的下盘",1,0,0,0,20,0]],
              # 雪山剑法
              39=>[[0,"user腰身微躬，weapon斜指，乃是七十二路雪山剑法的起手式「老梅迎客」",2,0,0,0,30,0],
                   [30,"user剑尖倏地翻上，斜斜刺向targetposition，正是雪山剑法中的一招「老枝横斜」",2,2,0,0,40,0],
                   [40,"user忽地发足急奔，直冲到target面前，电光火石间一招「明驼骏足」猛地刺出",2,5,0,0,45,0],
                   [60,"user剑光闪动，一招「云横西岭」，一片剑幕斜斜罩向target",1,3,0,0,50,0],
                   [70,"user横剑胸前，忽地一招「明月羌笛」，剑带笛音，直刺targetposition",2,5,0,0,50,0],
                   [80,"user一招「暗香疏影」，剑式错落，剑刃若有若无的斜削过来",1,7,0,0,60,0],
                   [95,"user抢上三步，一式「雪泥鸿爪」挺剑刺出，谁料中途突然变招，带转剑锋，斜削敌喉",2,7,0,0,60,0],
                   [90,"user一招「月色昏黄」，使得若有若无，朦朦胧胧，当真是得了雪山剑法的神髓",2,5,0,0,80,0],
                   [110,"user横劈斜刺，一瞬间不知刺出多少剑，这招「风沙莽莽」真有天地变色之势",2,8,0,0,80,0],
                   [130,"user一招「梅雪争春」，剑尖剑锋齐用，剑尖是雪点，剑锋乃梅枝，向target错落攻来",2,10,0,0,90,0]],
              # 赤尻连拳
              42=>[[0,"user一招「白猿献果」，双拳并举，猛击向target的position",3,0,0,0,0,40],
                   [0,"user屈膝团背，一招「叶底偷桃」，自下而上直取target的胯下",5,5,5,5,0,40],
                   [0,"user使一招「灵猿出洞」，合身扑向target，随即一拳捣向target的position",3,0,0,0,0,50],
                   [0,"user沉肩垂肘，一招「火中取栗」双臂交错向target急攻数拳",3,0,10,10,0,40],
                   [0,"user一招「朝三暮四」，左拳虚击三招，右拳翻出向target猛击四拳",3,0,0,0,0,90],
                   [0,"user一招「朝三暮四」，右拳虚击四招，左拳翻出向target猛击三拳",3,10,0,0,0,60]],
              # 猛虎拳
              43=>[[0,"user一式「虎膝击」，左膝刚至右膝又到，竟欲将target击飞",3,5,-5,-5,0,100],
                   [19,"user急退几步，忽地一招「恶虎翻身」，返身两拳击向target的position",3,5,0,0,0,120],
                   [39,"user一招「猛虎硬上山」，一拳击向target，气势汹涌，莫可抵御",4,8,-5,-5,0,120],
                   [49,"user双拳交错，一招「猛虎剪手」奋力击出，直欲将target剪为两段",1,8,-5,-5,0,150],
                   [69,"user一招「黄金之踵落」，高高跃起，一腿疾踢向target的position，破空之声大作",3,5,-10,-10,0,180],
                   [79,"user使一招「恶虎拦路」，封住target全部退路，紧跟着一拳当胸打到",3,10,-5,-5,0,200],
                   [89,"user虎吼一声，使一招「猛虎上升拳」，肩肘腕胯膝竟无一处不可伤敌",3,10,-10,-10,0,240],
                   [99,"user暗运真气，使一招「龙虎破」，携一股灼热内力向target猛击而来",4,2,-5,-5,0,240],
                   [109,"user一式「死亡旋风」，将一股强劲内力形成漩涡，呼啸向target击去",4,5,-5,-5,0,260],
                   [119,"user使一招「猛虎摆尾」，转身踢腿，一腿接一腿向target下盘猛攻八招",3,10,-10,-10,0,280],
                   [129,"user呼喝一声，一招「虎烈杀」拳肘齐施，如狂风暴雨般向target连攻十六拳",3,15,-12,-12,0,320]],
              # 鹰爪功
              44=>[[0,"user使一招「苍鹰探爪」，双爪交错连环抓向target的position",5,5,0,0,0,50],
                   [19,"user一式「雄鹰望月」，弓步拧身反手一爪抓向target的position",5,5,0,0,0,60],
                   [39,"user伏地滑行，一式「拨云瞻日」，上手袭向膻中大穴，下手反抓target的裆部",5,0,0,0,0,80],
                   [49,"user腾空而起，半空中一个筋斗，一式「凶鹰逐兔」猛抓target的position",5,5,0,0,0,90],
                   [59,"user单腿直立，双臂平伸，一式「雄鹰展翅」，双爪一前一后抓向target",5,8,0,0,0,100],
                   [69,"user双爪交错上举，使一式「迎风振翼」，分别袭向target左右腋空门",3,8,0,0,0,120],
                   [79,"user使一招「鹰击长空」，身形陡然而起，双爪凌空抓向target",5,5,0,0,0,130],
                   [89,"user一招「错骨擒拿」，手臂暴涨一尺，右爪翻出已经搭上target的position",5,10,0,0,0,150],
                   [99,"user一招「鹰扬万里」，翻爪成掌，一股雄混无比的气流直袭target的position",4,15,0,0,0,200]],
              # 鳄灵刀
              45=>[[0,"user一招「泥潭雾沼」，刀势变幻直取target的position",1,0,0,0,40,0],
                   [0,"user手中weapon横扫，一招「灵鳄摆尾」砍向targetposition",1,0,0,0,50,0],
                   [0,"user手中weapon晃动，一式「云龙三现」向target连砍三刀",1,5,0,0,60,0],
                   [0,"user使一招「懒鳄翻身」，手中weapon一翻，刀口向上向target直刺过去",1,5,0,0,40,0],
                   [0,"user一招「锯齿裂」，搂头盖顶将手中weapon向target直劈下来",1,5,0,0,50,0],
                   [0,"user大喝一声，手中weapon脱手飞掷而出，正是一招「江龙在天」",1,10,0,0,80,0]],
              # 天师掌法
              49=>[[0,"user一招「天师捉鬼」，合身扑上向target就是一掌",3,0,0,0,0,40],
                   [0,"user使一招「钟馗嫁妹」，顺势一掌击向target的position",3,0,0,0,0,30],
                   [0,"user双掌一分，一招「法眼阴阳」左右齐袭target",3,0,0,0,0,40],
                   [0,"user左掌一招，一式「回头是岸」右掌反钩target的position",5,0,0,0,0,30],
                   [0,"user双掌摇动，使一招「天堂无路」，连攻target上盘",3,0,0,0,0,20],
                   [0,"user抽身撤步，使一招「地狱有门」，出腿踢向target下盘",0,0,0,0,0,50]],
              # 基本拳脚
              2=>[[0,"user挥拳攻击target的position",3,0,0,0,0,0],
                  [0,"user往target的position一抓",0,0,0,0,0,0],
                  [0,"user往target的position狠狠地踢了一脚",3,0,0,0,0,0],
                  [0,"user提起拳头往target的position捶去",3,0,0,0,0,0],
                  [0,"user对准target的position用力挥出一拳",3,0,0,0,0,0]],
              # 基本剑术
              3=>[[0,"user挥动weapon，斩向target的position",1,0,0,0,0,0],
                  [0,"user用weapon往target的position砍去",0,0,0,0,0,0],
                  [0,"user用weapon往target的position刺去",2,0,0,0,0,0]],
              # 基本刀法
              4=>[[0,"user挥动weapon，斩向target的position",1,0,0,0,0,0],
                  [0,"user用weapon往target的position砍去",0,0,0,0,0,0],
                  [0,"user挥舞weapon，对准target的position一阵乱砍",0,0,0,0,0,0]],
              # 基本杖法
              5=>[[0,"user挥舞weapon，往target的position用力一击",0,0,0,0,0,0],
                  [0,"user高高举起weapon，往target的position当头砸下",0,0,0,0,0,0],
                  [0,"user手握weapon，眼露凶光，猛地对准target的position挥了过去",0,0,0,0,0,0]],
              # 基本鞭法
              6=>[[0,"user将weapon一扬，往target的position抽去",0,0,0,0,0,0]],
              # 基本棍法
              7=>[[0,"user的weapon朝著target的position劈将过去",0,0,0,0,0,0],
                  [0,"user的weapon往target的position狠狠地一捅",0,0,0,0,0,0],
                  [0,"user用weapon往target的position直戳过去",0,0,0,0,0,0]],
              # 阴阳诀
              57=>[[0,"user招式阴阳变化，忽地右拳翻出，左拳沉腰，发出太极刚劲，一式「搬拦锤」直向target捶去",4,0,-10,-10,0,550],
                   [0,"user招式阴阳变化，忽地左拳翻出，右拳沉腰，发出太极刚劲，一式「指掌锤」直向target捶去",4,0,-10,-10,0,550]],
              # 三环套月
              58=>[[0,"user使出「三环套月」，左手抚剑把，右手托剑，剑尖闪动，一个圆弧向target轻轻挑出",2,5,0,0,150,0],
                   [0,"然后user移进一步，右手左招，左手右招，一剑接着挥出，不着一点停顿的痕迹",2,0,0,0,180,0],
                   [0,"紧接着user手中剑又一次挥出，急点targetposition，这三剑剑势相联，剑气相叠，剑意相同",2,-5,0,0,220,0]],
              # 旋风三连斩
              59=>[[0,"user大喝一声「牙！」，疾冲而至，一刀平平地斩向target胸前",1,0,0,0,60,40],
                   [0,"两人身形一合乍分，user又喝道「角！」，间不容发之际劈出一刀",1,0,0,0,80,50],
                   [0,"user运气暴喝「磷！」又是一刀从target身后斜劈而至，实乃不可思议",1,0,0,0,90,60]]}
              # 基本轻功
    def_word={9=>["但是和userposition偏了几寸","但是被user机灵地躲开了",
                  "但是user身子一侧，闪了开去","但是被user及时避开",
                  "但是user已有准备，不慌不忙的躲开"],
              # 游龙身法
              15=>["user暗运真气，一招「龙飞凤舞」远远避了开去",
                   "user一招「游龙戏凤」，身影晃动早闪过一旁",
                   "user一式「龙翔在天」，急跃而起，在空中一个转折落在丈外",
                   "user脚步错落，暗踏梅花桩，一招「龙游掠波」闪了开去",
                   "user身形连晃使一招「云龙三现」，连续三个空心斛斗跳了开去"],
              # 飞蝶身法
              20=>["user一招「乱花迷人眼」，身形微动，早已闪在一旁",
                   "user衣裾轻摆，一招「蝶舞绕粱归」避开这一招",
                   "user以手支颐，长叹一声「春深芳草尽」闪了开去",
                   "user使一招「山野花自红」，轻轻飘出丈外",
                   "user纤腰轻扭，一式「蝶逐花香语」，target的凌厉攻势尽皆落空",
                   "user衣袖轻扬一招「花痕思愁飞」，袖中飞出绚丽花瓣，一闪而过"],
              # 鹤翔身法
              25=>["user展动身法，一招「鹤舞白沙」闪了开去",
                   "user一招「鹤舞九天」冲天而起，跃出丈外",
                   "user使一招「梅妻鹤子」，脚下倒踩梅花桩一下绕到target身后",
                   "user斜身一让，一招「乳鹤归巢」斜飞数丈，脚一点地又飘了回来",
                   "user一招「鹤影参云」，斜飞而起，半空中一个倒卷帘轻轻落下",
                   "user一招「鹤隐南山」急向后退，直退出丈外，忽又如大鸟般疾扑而回"],
              # 无影遁形
              30=>["user一招「无影无踪」倏地闪在一旁",
                   "user身形急转，一招「暗无天日」绕到target背后",
                   "user一招「移形换位」，不见迈步却避到七尺之外",
                   "user高蹿低伏，一式「半隐半现」一下子不见了身影",
                   "user一跺脚，一招「天魔出世」，一阵烟幕后随即不知去向",
                   "user一招「无声无息」，一扭身与周围景色融成一体，target竟不知如何是好"],
              # 万流归一
              35=>["只见user一招「白鹤冲天」，身体向上笔直地纵起丈余，躲过了target这一招",
                   "user一个「鹞子翻身」，向后纵出数丈之远，避开了target的凌厉攻势",
                   "user使出「大鹏展翅」，向一旁飘然纵出，轻轻着地",
                   "user一招「溪流归海」，一个抢步跨出数尺，避开target这招",
                   "user使一招「叶落归根」，上半身急向后仰，于间不容发之际闪了开去"],
              # 踏雪无痕
              40=>["user一招「夕阳残雪」轻轻巧巧地避了开去",
                   "只见user身影一晃，一式「开阳薄雾」早已避在七尺之外",
                   "user使出「信步闲庭」，轻轻松松地闪过",
                   "user左足一点，一招「万里雪飘」腾空而起，避了开去",
                   "可是user使一招「踏雪无痕」，身子轻轻飘了开去",
                   "user身影微动，已经借一招「雪影无踪」轻轻闪过"],
              # 五禽戏
              46=>["user一招「鹿鸣于野」，脚步轻盈于漫不经心间闪过",
                   "user一招「猿戏山林」，身形纵跃间target的攻击全部落空",
                   "user脚步沉重却不显滞涩，一招「熊游野谷」早避了开去",
                   "user一式「虎啸群山」声震四野，target一呆之下竟不知如何攻击",
                   "user双臂一振拔身而起，一招「鸟翔荒岭」早跃出丈外"],
              # 灵符身法
              50=>["user一招「风雷激兑」，腾空而起从容避开",
                   "user脚步迅速，一招「地火明夷」斜次里闪开",
                   "user一招「阴阳宝鉴」，身法变幻闪在一旁",
                   "user暗运三味真火，一招「灵鸦钻焰」借火光跃开数丈",
                   "user潜用元神，一招「弱水玄冰」远远避开"]}
    for i in 1..59
      $data_kungfus[i]=RPG::Kungfu.new
      $data_kungfus[i].id=i
      $data_kungfus[i].type=kungfu[i][0]
      $data_kungfus[i].name=kungfu[i][1]
      $data_kungfus[i].skill=[kungfu[i][2],kungfu[i][3],kungfu[i][4],kungfu[i][5]]
      $data_kungfus[i].atk_word=atk_word[i]
      $data_kungfus[i].def_word=def_word[i]
    end
    # 绝招
    # ID=>[名称,类型,目标,生命消耗,内力消耗,法力消耗,[使用要求],[使用描述],[成功描述],[平局描述],[失败描述],[收招描述],[绝招冲突],[法术参数]]
    # 类型：0--BUFF/DEBUFF，1--控制，2--伤害，3--其他(包含多种结果)
    # 目标：0--自己，1--敌人
    # 使用要求[类型,数值]，类型>0--使用该ID武功，且有效等级超过数值
    # 类型=0膂力，-1敏捷，-2悟性，-3根骨
    # 类型=-4内力，-5内力上限，-6生命，-7生命上限，-8法力，-9法力上限
    sp_skill={1=>["化掌为刀",0,0,0,200,0,[[16,105],[12,105],[-5,200],[-4,200]],["user呼喝一声，将混元一气功逼到双掌，掌心闪出奇异的光芒，掌缘锋利竟如钢刀一般！"],[],[],[],["user缓缓收回内力，掌法也恢复平常。"],[2],[]],
              2=>["化掌为刀",0,0,0,400,0,[[16,120],[13,120],[-5,400],[-4,400]],["user呼喝一声，将混元一气功逼到双掌，掌心闪出奇异的光芒，掌缘锋利竟如钢刀一般！"],[],[],[],["user缓缓收回内力，掌法也恢复平常。"],[1],[]],
              3=>["八卦刀影掌",2,1,0,150,0,[[16,90],[14,105],[12,30],[-5,150],[-4,150]],["user使出八卦门刀影掌绝学，一时间刀光闪闪，掌风呼啸，刀光掌影直向target扑来！"],[],[],[],[],[1,2,4],[]],
              4=>["八阵刀影掌",2,1,0,450,0,[[16,90],[14,90],[13,45],[-5,450],[-4,450]],["user使出八卦门刀影掌绝学，一时间刀光闪闪，掌风呼啸，刀光掌影直向target扑来！"],[],[],[],[],[1,2,3],[]],
              5=>["柳浪闻莺",2,1,0,200,0,[[21,120],[17,60],[18,90],[-5,200],[-4,200]],["user使出柳浪闻莺绝技，向target同时击出两掌一刀，一时间刀浪如柳，掌风如莺！"],[],[],[],[],[7],[]],
              6=>["落英缤纷",3,1,0,400,0,[[21,120],[19,120],[-5,400],[-4,400]],["user手中weapon轻舞，划出一个又一个圈子，target跟著鞭圈一绕，登时眼花缭乱！"],["target手中兵刃被鞭圈带动连转几圈，再也把持不定，一下子脱手飞出！","target眼见漫天鞭影当头罩下，躲无可躲，架无可架，一下子卷入鞭圈之中！"],[],["target身手敏捷，见机急快，连忙随着鞭势运力抽出，锵的一声逃过兵刃被夺之厄！","target眼见不好，紧急中一个就地十八滚，滚出数丈之外，却也大感狼狈！"],[],[],[]],
              7=>["三花",0,0,0,350,0,[[21,90],[-5,350],[-4,350]],["user凝神运功，周身泛出一片七彩绚烂之色，似乎披了一见五彩霓裳，身法骤然变快！"],[],[],[],["user三花心法用毕，身法也恢复正常。"],[],[]],
              8=>["流星飞掷",2,1,0,550,0,[[-1,33],[26,120],[24,120],[-5,550],[-4,550]],["user运足内力长啸一声，将手中weapon向target猛掷过来，去势急劲，当真快若闪电！"],["target吓得目瞪口呆，竟忘了闪避，这一杖在targetposition对穿而过，鲜血溅得满地！"],[],["没想到target身法奇快，一个燕子三抄水凌空跃出数丈，weapon竟未碰到分毫！"],[],[],[]],
              9=>["雷动九天",0,0,0,150,0,[[26,90],[-5,150],[-4,150]],["user默念红莲教义，周身噼啪做响，真气流转间，好像手上的力道加强了！"],[],[],[],[],[],[]],
              10=>["红莲出世",0,0,0,350,0,[[26,120],[-5,350],[-4,350]],["user合眼默诵红莲教义：去残除恶，唯我光明！忽地睁开双眼，似乎增加了战斗力！"],[],[],[],[],[],[]],
              11=>["旋风三连斩",2,1,0,350,0,[[31,120],[29,90],[-5,350],[-4,350]],["user刀指苍穹蓄势发力，忽地使出旋风三连斩绝技，身形如风连续劈出三刀！"],[],[],[],[],[12],[]],
              12=>["迎风一刀斩",2,1,0,550,0,[[31,120],[29,120],[-5,550],[-4,550]],["user反手握刀纵声长啸，霎时间天地为之变色，这一刀之势虽然平平，却威力惊人！"],[],[],[],[],[],[]],
              13=>["忍术烟幕",0,1,0,300,0,[[31,90],[-5,300],[-4,300]],["user双手连挥，一掌击在地上，腾的一声爆起一阵烟幕，target眼前顿时一片昏暗！"],[],[],["没想到target内力深厚，当即猛推一掌，震散了烟雾！"],["target识破了user的烟幕诡计，攻守自如多了。"],[],[]],
              14=>["忍法影分身",0,0,0,550,0,[[31,120],[-5,550],[-4,550]],["user双手合掌身形急转，一声低喝中，身影一分为二，target一时竟分辩不出真假！"],[],[],[],["user忍法影分身运行完毕，制造出来的幻影也跟着消失。"],[],[]],
              15=>["震字诀",2,1,0,200,0,[[36,90],[32,90],[-5,200],[-4,200]],["突然user双手左右连划，一个圆圈已将target套住，太极拳的震字诀随即使出！"],["太极之意连绵不断，一个圆圈未完，第二个圆圈已生，喀喇一响，target一处骨头已被绞断！"],["target急忙招架，只听啪的一声，target和user内力相拼相碰，各自退了几步。"],["没想到两股内力一接，target的内力远胜於user，user不由踉跄倒退！","target内力深厚识得厉害，马上一阵急攻，user登时手忙脚乱，再也来不及出招！"],[],[],[]],
              16=>["挤字诀",2,1,0,350,0,[[36,105],[32,105],[-5,350],[-4,350]],["user右脚实，左脚虚，运起 [挤] 字诀，粘连粘随，右掌翻出已搭住target左手！"],["跟著user横劲发出，target给这么一挤，招式中的劲力打了个空，心中空荡荡的十分难受！"],["target见此情景，一声惊噫，连忙收回自己的劲力，闪身避让！"],["没想到target内力浑厚无比，user这一挤非但分毫无功，自己反而被牵得跌出几步！"],[],[],[]],
              17=>["乱环诀",1,1,0,300,0,[[36,150],[32,150],[-5,300],[-4,300]],["user将一个个太极圆圈发出，以四两之微力，拨动target的千斤巨力 ！"],["结果target身不由己，被推进了user的乱环阵内！"],[],["可是target急中生智奋力一挣，竟然脱出了 [乱环诀] 的包围！"],[],[],[]],
              18=>["阴阳诀",3,1,0,500,0,[[36,180],[32,180],[-5,500],[-4,500]],[" [太极阴阳少人修，吞吐开合问刚柔] ，这阴阳决使用时刚柔并济，委时变幻莫测！","user招式一变翻为阴手，一股绵绵劲力直向target全身罩去！"],["target於user阴阳变化莫测之际，哪里还能招架，身子被太极柔劲推得跌跌撞撞！"],[],["target大吃一惊之际，急运内力全力相抗，狼狈万状地从太极柔劲中脱得身来！"],[],[],[]],
              19=>["缠字诀",1,1,0,250,0,[[36,90],[33,90],[-5,250],[-4,250]],["user每一招均是以弧形刺出，弧形收回，绵绵不绝，逐步向target收紧！"],["太极剑意散发出的细丝越积越多，似是积成了一团团丝棉，将target紧紧裹了起来！"],[],["target大叫一声不好，一个细胸巧翻云远远跃出丈外。"],[],[20],[]],
              20=>["连字诀",0,0,0,350,0,[[36,120],[33,120],[-5,350],[-4,350]],["user手中剑不断划圈，剑光圈一个未消另一个再生，这光圈剑阵一出，真是守御滴水不漏！"],[],[],[],["user剑式一缓，剑上的大小光圈随即不见。"],[],[]],
              21=>["三环套月",2,1,0,400,0,[[36,180],[33,180],[-5,400],[-4,400]],["user剑尖斜指，使出太极剑绝学三环套月，连环三招直向target攻来！"],[],[],[],[],[20],[]],
              22=>["神倒鬼跌",1,1,0,350,0,[[37,120],[-5,350],[-4,350]],["user使出绝技神倒鬼跌三连环，一揪一抓一拌接连三招，据说神仙也要摔个跟头！"],["结果target眼花缭乱，扑通一声被摔个昏天黑地，想要翻身站起，可又怎缓得出手来！"],[],["可是target内力深厚，急运内力格挡，这神鬼莫测的连环三招竟全部落空！"],[],[],[]],
              23=>["雪花六出",2,1,0,350,0,[[41,90],[39,90],[-5,250],[-4,250]],["user长啸一声，使出雪山神技雪花六出，依照雪花六角之型，一瞬间向target刺出数剑！"],[],[],[],[],[],[]],
              24=>["冰心诀",0,0,0,150,0,[[41,75],[-5,150],[-4,150]],["user深吸一口气，全身真气流转，周身竟隐隐发出一片如冰雪般的晶莹之色！"],[],[],[],["user冰心决运行完毕，笼罩在身周的护体真气逐渐散去。"],[],[]],
              25=>["恶虎啸",1,1,50,150,0,[[47,120],[43,120],[-5,150],[-4,200],[-6,100]],["user昂首挺立，「啊呜」一声发出如恶虎一般的啸声，声音凄历，夺人心魄！"],["这啸声中蕴有深厚内力，target一下子被震得耳鼓生疼，头晕脑涨"],[],["可是target内力深厚，根本就不理user什么鬼叫鬼叫的"],[],[],[]],
              26=>["飞鹰召唤",0,2,0,300,0,[[47,120],[44,120],[-5,300],[-4,300]],["user嘬唇长啸，唿哨声中半空里一声长鸣，一只金眼铁爪苍鹰盘旋而至。"],["一只铁抓苍鹰从天空直扑而下,在user身上抓了一道血淋淋的伤口"],[],["一只铁抓苍鹰在天空中盘旋着……"],[],[],[]],
              27=>["变鹰术",0,0,0,50,0,[[46,100],[47,100],[44,100],[-5,50],[-4,100]],["user略一提气，运起龙象般若功，手作飞鹰状。只见user足不沾地，鹰抓功越舞越快，逐渐幻做一只振翅翱翔的雄鹰"],[],[],[],["user渐感气力不支，不得不放慢脚步，恢复人形"],[28],[]],
              28=>["变熊术",0,0,0,300,0,[[47,120],[-5,300],[-4,300]],["user暗运龙象般若功不二法门，周身云雾缭绕，低喝声中竟然化身为熊！"],[],[],[],["user的龙象般若功运行一周天完毕，将内力收回丹田,变回人形"],[27],[]],
              29=>["闪光弹",2,1,50,0,0,[],["user念动真言，掌中祭起一团烁烁金光，向target劈面掷去"],[],["但是金光被target以法力反激，反向user射去！"],["结果嗤！地一声，target闻到了一股焦味，还好只烧掉了几根头发。"],[],[],[30,30,100,100,1,1,1,1,8,30]],
              30=>["雷火弹",2,1,50,0,0,[],["user掐指念咒，电光缭绕雷声大作，一团雷火直袭target"],[],["但是雷火被target以法力反激，反向user射去"],["结果嗤！地一声target闻到了一股焦味。还好只烧掉了几根头发。"],[],[],[50,75,120,120,1,1,1,1,0,30]],
              31=>["掌心雷",2,1,50,0,0,[[51,120]],["user披发念咒，周身电光闪烁，手掌猛向target张开，一个劈雳直击过去"],[],["但是劈雳被target以法力反激，反向user射去"],["结果嗤！地一声target闻到了一股焦味。还好只烧掉了几根头发。"],[],[],[200,120,140,140,1,1,1,0,0,10]],
              32=>["连珠雷",2,1,50,0,0,[],[],[],[],[],[],[],[300,150,30,30,29]],
              33=>["火焰弹",2,1,50,0,0,[],["user用手一指,唰地一声,一个火球向target飞去"],[],["但是火球被target以法力一引，反而砸到了user的顶门"],["但是target在千钧一发之际躲了开来"],[],[],[50,45,100,100,2,2,2,1,12,25]],
              34=>["烈焰球",2,1,50,0,0,[],["user身形一转,周围一片火海,烈焰熊熊,半空中一个巨大的火球砸向target"],[],["但是火球被target以法力一引，反而砸到了user的顶门"],["但是target在千钧一发之际躲了开来"],[],[],[120,90,120,120,2,2,2,1,5,30]],
              35=>["三昧火",2,1,0,0,300,[[51,150],[53,150],[-9,700],[-8,350]],["user双掌摩擦念动真言，喝声「疾」！双掌一分，一股丈余长烈焰直向target扑面而来！！"],["target被烈焰包围，随着「嗤嗤」一阵焦臭，target的物品也被烧了个干净！！"],[],["target识得厉害，大叫一声「不好」，一个懒驴打滚滚出数丈，狼狈万状地避开。"],[],[],[0,0,120]],
              36=>["火风暴",2,1,50,0,0,[],[],[],[],[],[],[],[450,195,34,34,34]],
              37=>["寒冰弹",2,1,50,0,0,[],["user口中念咒,祭起一个冰球打向target"],[],["但是冰球被target以法力一引，反而砸到了user的顶门"],["可是target经验老到，连消带打化解了这凌厉一击"],[],[],[30,45,150,140,3,3,3,1,10,25]],
              38=>["雾棱镖",2,1,50,0,0,[],["user口中念咒,周围忽然雾茫茫一片,一支冰镖悄无声息地飞向target"],[],["但是冰镖被target以法力一引，反而飞到了user的顶门"],["可是target经验老到，连消带打化解了这凌厉一击"],[],[],[80,90,150,140,3,3,3,1,15,30]],
              39=>["暴风雪",1,1,10,0,500,[[54,135],[-9,500],[-8,500],[-6,10]],["user在手中划了个咒，望天一指，只见顿时天上雪舞风刮,大大小小的雪片冰雹向target飘了过去"],["结果target手足被冻的僵硬，动弹不得"],[],["target回手一挥，漫天飞雪顿时淡去了"],[],[],[]],
              40=>["冰凌剑",2,1,50,0,0,[],[],[],[],[],[],[],[350,180,38,38,38]]}
    for i in 1..40
      $data_skills[i].name = sp_skill[i][0]
      $data_skills[i].type = sp_skill[i][1]
      $data_skills[i].target = sp_skill[i][2]
      $data_skills[i].hp_cost = sp_skill[i][3]
      $data_skills[i].fp_cost = sp_skill[i][4]
      $data_skills[i].mp_cost = sp_skill[i][5]
      $data_skills[i].require = sp_skill[i][6]
      $data_skills[i].use_text = sp_skill[i][7]
      $data_skills[i].success_text = sp_skill[i][8]
      $data_skills[i].equal_text = sp_skill[i][9]
      $data_skills[i].fail_text = sp_skill[i][10]
      $data_skills[i].end_text = sp_skill[i][11]
      $data_skills[i].crash_skill = sp_skill[i][12]
      $data_skills[i].magic_data = sp_skill[i][13]
    end
    $data_system.falv_factor=[0,1,10,13,16,20,22,24,26,28,30,31,33,35,37,38,39,41,43,46,47,48,49,51,53,55]
    $data_system.sword_hurt="user感觉到身体一点点衰弱下去。"
    $data_system.fire_hurt="啪地一团火焰在user脚下燃起，将user拢在中央。"
    $data_system.thunder_hurt="target头晕眼花，攻势不由一缓。"
    # 系统文本
    $data_system.levels=["不堪一击","毫不足虑","不足挂齿","初学乍练",
              "勉勉强强","初窥门径","初出茅庐","略知一二","普普通通",
              "平平常常","平淡无奇","粗通皮毛","半生不熟","登堂入室",
              "略有小成","已有小成","鹤立鸡群","驾轻就熟","青出於蓝",
              "融会贯通","心领神会","炉火纯青","了然於胸","略有大成",
              "已有大成","豁然贯通","非比寻常","出类拔萃","罕有敌手",
              "技冠群雄","神乎其技","出神入化","傲视群雄","登峰造极",
              "无与伦比","所向披靡","一代宗师","精深奥妙","神功盖世",
              "举世无双","惊世骇俗","撼天动地","震古铄今","超凡入圣",
              "威镇寰宇","空前绝后","天人合一","深藏不露","深不可测",
              "返璞归真"]
    $data_system.attack_lv=["极轻","很轻","不轻","不重","很重","极重"]
    $data_system.school=["江湖小虾","八卦门","花间派","红莲教","尹贺谷",
              "太极门","雪山剑派","兽王派","茅山派","逍遥派"]
    $data_system.marry_text=[["你还是光棍一条","你老婆是name"],
                             ["你还待字闺中","你老公是name"],
                             ["你还待字闺中","你老公是name"]]
    $data_system.young_face="一脸稚气"
    $data_system.boy_face=["风流俊雅，仪表堂堂","气宇轩昂，骨骼清奇",
      "相貌英俊，双目有神","五官端正，身材匀称","相貌平平，还过得去",
      "小鼻小眼，一脸麻子","牛眼马嘴，面目狰狞","一塌糊涂，不是人样"].reverse
    $data_system.girl_face=["美奂绝伦，人间仙子","沉鱼落雁，闭月羞花",
       "婷婷玉立，美貌如花","身材娇好，尚有姿色","相貌平平，还过得去",
       "看上去…，马马虎虎","眼小嘴大，相貌丑陋","貌赛无盐，惨不忍睹"].reverse
    $data_system.hit_place=["头部","颈部","胸口","后心","左肩","右肩",
              "左臂","右臂","左手","右手","腰间","小腹","左腿","右腿",
              "左脚","右脚"]
    $data_system.sword_name1=["锯齿","开光","破甲","狼牙","罗刹",
                              "修罗","菩提","金光","雾光","地火",
                              "烈风","巨索","青冥","白虹","青虹",
                              "霓虹","金蛇","紫霞","碧水","观日",
                              "飞影","太风","太渊","松鹤","凤翔",
                              "龙翔","华凤","黄龙","玉龙","天龙",
                              "莫邪","七星","鱼肠","龙泉","三才",
                              "五圣","乱神","霸王","天后","帝王",
                              "昆仑","练狱","浩然","屠龙","依天",
                              "日月","风云","天地","乾坤","无极",
                              "轩辕","膚豾"] # 膚豾为溢出BUG
    $data_system.sword_name2=[["一品","怪力","绿波","蔓陀","鹤顶"],
                              ["绿野","灵泉","天芝","玉露","蟠桃"],
                              ["混沌","狻猊","熊罴","麒麟","天盾"],
                              ["雷电","紫电","飓电","飞火","绝世"]]
    $data_system.sword_name3=[["泻力","合宇","人宇","地宇","天宇"],
                              ["沉水","合渊","人渊","地渊","天渊"],
                              ["晦明","合灵","人灵","地灵","天灵"],
                              ["暗光","合玄","人玄","地玄","天玄"],
                              ["笑颦","弱水","戏候","樱华","天仙"]]
    $data_system.no_damage="结果没有造成任何伤害"
    $data_system.hit_word=[["结果只对target勉强造成轻微的伤害",
                 "结果对target造成轻微的伤害",
                 "结果对target造成一处伤害",
                 "结果对target造成颇为严重的伤害",
                 "结果对target造成相当严重的伤害",
                 "结果对target造成十分严重的伤害",
                 "结果对target造成极其严重的伤害",
                 "结果对target造成非常可怕的严重伤害"],
                ["结果只轻轻地划破target的皮肉",
                 "结果target被划出一道细长的血痕",
                 "结果target被割出一道伤口",
                 "结果target被划出一道血淋淋的伤口",
                 "结果target被划出一道又长又深的伤口",
                 "结果target被划出一道又长又深的伤口",
                 "结果target被砍出一道深及见骨的可怕伤口",
                 "结果target被砍出一道深及见骨的可怕伤口"],
                ["结果只轻轻地刺破target皮肉",
                 "结果在target身上刺出一个创口",
                 "结果target被刺入了寸许",
                 "结果刺得target退了几步",
                 "结果刺出一个血肉模糊的伤口",
                 "结果刺出一个血肉模糊的伤口",
                 "结果target被刺了个透明窟窿，鲜血飞溅",
                 "结果target被刺了个透明窟窿，鲜血飞溅"],
                ["结果只是轻轻地碰到target",
                 "结果在target的伤处造成一处瘀青",
                 "结果一击命中，target被打肿了一块老高",
                 "结果一击命中，target痛苦地闷哼了一声",
                 "结果「砰」的一声，target退了两步",
                 "结果target连退了好几步，差一点摔倒",
                 "结果重重的击中，target吐出一口鲜血",
                 "结果一声巨响，target像捆稻草般飞了出去"],
                ["结果target退了半步，毫发无损",
                 "结果给target造成一处瘀伤",
                 "结果一击命中，target痛得弯下腰",
                 "结果target闷哼了一声，显然受了点内伤",
                 "结果target脸色一下变得惨白，连退了好几步",
                 "结果target摇摇晃晃，一跤摔倒在地",
                 "结果「轰」的一声，target口中鲜血狂喷而出",
                 "结果target一声惨叫，像滩软泥般塌了下去"],
                ["结果只是抓破target的一点皮",
                 "结果把target抓出一条淡淡的血痕",
                 "结果抓下了target一小块皮肉",
                 "结果一爪命中，target被抓出了五条血沟",
                 "结果target皮开肉破，鲜血流了下来",
                 "结果target被抓出了五个血洞，鲜血急喷",
                 "结果target被连皮带肉抓下一大块，露出了骨头",
                 "结果「喀嚓」一声，target的骨头被抓得粉碎"]]
    $data_system.fa_damage=[["结果target只是被震得一抖",
                             "结果target被震得全身一颤",
                             "结果target被雷电炸了个满脸花",
                             "结果target被雷电震得脚步踉跄，连退几步",
                             "结果雷鸣电闪中target眉发全焦，被炸得浑身发黑",
                             "结果雷电交加中target双眼翻白，哼也没哼瘫软在地"],
                            ["结果target只是被火星烫了一下",
                             "结果target被烧起了一个小水泡",
                             "结果target被烧掉一大片皮，连声呼痛",
                             "结果target被烧得浑身冒烟，狼狈不堪",
                             "结果target全身着火，不住在地上翻滚号呼",
                             "结果target身陷火窟，长声惨呼中传来阵阵刺鼻焦臭"],
                            ["结果target只是打了个喷嚏",
                             "结果target被冻得连打冷颤",
                             "结果target被冻得脸色发青，嘴唇发紫",
                             "结果target被冻气所伤，周身结了一层白霜",
                             "结果寒气弥漫中，target全身竟被冻出了一层薄冰",
                             "结果target竟被冻成了一尊晶莹剔透的冰雕"]]
    $data_system.out_hurt=["（target看起来充满活力，一点也不累）",
                  "（target似乎有些疲惫，但是十分有活力）", 
                  "（target看起来可能有些累了）",
                  "（target动作似乎开始有点不太灵光）",
                  "（target气喘嘘嘘，看起来状况并不太好）",
                  "（target十分疲惫，看来需要好好休息了）",
                  "（target已经头重脚轻，正在勉力支撑）",
                  "（target看起来已经力不从心了）",
                  "（target摇头晃脑，眼看就要倒在地上）",
                  "（target摇头晃脑，眼看就要倒在地上）",
                  "（target已经陷入半昏迷状态）"]
    $data_system.in_hurt=["（target看起来气血充盈，并没有受伤）",
                  "（target似乎受了点轻伤，不过看不出来）",
                  "（target看起来可能受了点轻伤）",
                  "（target受了几处伤，不过似乎并不碍事）",
                  "（target受伤不轻，看起来状况并不太好）",
                  "（target动作开始散乱，看来受的伤不轻）",
                  "（target已经伤痕累累，正在勉力支撑）",
                  "（target受伤相当重，只怕有生命危险）",
                  "（target伤重之下已经难以支撑）",
                  "（target受伤过重，已经命在旦夕了）",
                  "（target受伤过重，随时都可能断气）"]
    $data_system.hand_def=["但是被user格开了","结果被user挡开了"]
    $data_system.weapon_def=["只听见「锵」一声，被user格开了",
                             "结果「当」地一声被user挡开了",
                             "但是被user用手中兵刃架开",
                             "但是user身子一侧，用手中兵刃格开"]
    $data_system.sp_def="user没料到这一击却打空，原来打中的只是个影子"
    $data_system.menu_type=[["交谈","查看","战斗"],["交谈","查看","战斗","交易"],["交谈","查看","战斗","拜师"],["交谈","查看","战斗","请教"]]
    $data_system.game_choice=["跳舞毯","投铅球","放弃"]
    $data_system.boss3_choice=["回去","少废话，这次你会死的很难看的"]
    $data_system.net_battle_choice=["创建对战","加入对战"]
    $data_system.confirm_choice=["确定","放弃"]
    $data_system.main_menu = ["查看","物品","技能","功能"]
    $data_system.look_menu = ["状态","描述","属性","婚姻"]
    $data_system.item_menu = ["食物","药物","武器","装备","其他","丢弃"]
    $data_system.skill_menu = ["拳脚","兵刃","轻功","内功","招架","法术","知识"]
    $data_system.sys_menu = ["内力","法力","练功","存档","结束"]
    $data_system.fp_menu = ["打坐","加力","吸气","疗伤"]
    $data_system.mp_menu = ["冥思","法点"]
    $data_system.battle_menu = ["普通攻击","绝招攻击","使用内力","使用物品","调整招式","逃跑"]
    $data_system.battle_fp = ["加力","吸气"]
    $data_system.sword_menu = ["剑","刀","杖","鞭"]
    $data_system.cheat_main = ["查看","技能"]
    $data_system.cheat_status = ["金钱","经验","潜能","内力","法力","名声","杀手","捕快","屠杀","性别","容貌","福缘","年龄","时间","跳舞","投篮",]
    $data_system.cheat_skill = ["拳脚","兵刃","轻功","内功","招架","法术","知识","遗忘"]
    $data_system.fly_menu=["平安镇","商家堡","玉女峰","五指山","冰火岛","武当山","大雪山","长白山","茅山"]
    # 轻功目的地，地图ID，X,Y,朝向
    $data_system.fly_position=[[3,8,6,2],[29,9,13,8],[23,15,28,8],[24,8,11,8],[37,9,9,8],[26,12,10,8],[42,10,13,8],[53,12,6,8],[51,1,6,6]]
    $data_system.chara_set = ["请选择您的人物：","姓名：","密码：","确认"]
    $data_system.input_pas = ["密码：------","确认"]
    $data_system.weapon_title = "请输入自制武器名称："
    $data_system.set_weapon_name=["名称：------","确认"]
    $data_system.have_pas = "密码：******"
    $data_system.long_pas = "密码过长！请重新设置。"
    $data_system.name_error = "输入错误，请重新输入。"
    $data_system.no_pas = "密码：------"
    $data_system.error_pas = "密码错误！"
    $data_system.cheat_code = "yobdc"
    $data_system.error_save = "无效存档！"
    $data_system.attr_name = ["膂力","敏捷","悟性","根骨"]
    $data_system.npc_status_text=["name看起来约age0多岁","武艺看起来lv","出手似乎attack","带着：item","des1","des2","des3","des4","des5"]
    $data_system.player_status=[["食物：food/max_f","饮水：water/max_w","生命：hp/max_h(percent%)","内力：fp/max_f(+f_plus)","法力：mp/max_m(+m_plus)","经验：exp","潜能：pot"],
                  ["[school]name","你是一位age岁的gender性","你face","武艺看起来lv","出手似乎attack"],
                  ["金钱：gold","膂力：[str/base_s]","敏捷：[agi/base_a]","悟性：[int/base_i]","根骨：[bon/base_b]","命中：[hit]","闪避：[eva]","攻击：[atk]","防御：[defence]"],
                  ["marry"]]
    $data_system.end_status=["时间：all_time","杀NPC数：kill_npc","追杀数：all_kill","名声：morals","等级评定：end_lv"]
    $data_system.password_bgm=RPG::AudioFile.new("密码.mp3")
    $data_system.boss_bgm=[RPG::AudioFile.new("战斗2.mp3"),RPG::AudioFile.new("战斗3.mp3"),RPG::AudioFile.new("战斗4.mp3")]
    $data_system.normal_bgm=[RPG::AudioFile.new("战斗1-1.mp3"),RPG::AudioFile.new("战斗1-2.mp3"),RPG::AudioFile.new("战斗1-3.mp3")]
    $data_system.net_bgm=RPG::AudioFile.new("战斗5.mp3")
    $data_system.begin_bgm=RPG::AudioFile.new("开场.mp3")
    $data_system.end_bgm=RPG::AudioFile.new("结局.mp3")
    $data_system.dance_bgm=RPG::AudioFile.new("跳舞.mp3")
    $data_system.throw_ball_bgm=RPG::AudioFile.new("投篮.mp3")
    $data_system.create_bgm=RPG::AudioFile.new("创建人物.mp3")
    $data_system.move_se=RPG::AudioFile.new("Move.ogg",100,100)
    #id=>[类型,名称,[食物],[饮水],[生命],[生命上限],[内力],[内力上限],[法力],
    #     [法力上限],丢弃,出售,叠加,书籍,[技能列表],经验]
    items={1=>[0,"烤鸡腿",[0,160],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],
               true,true,true,false,[],10],
           2=>[0,"包子",[0,120],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],
               true,true,true,false,[],10],
           3=>[0,"酥油茶",[0,180],[0,200],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],
               true,true,true,false,[],10],
           4=>[0,"翡翠豆腐",[0,160],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],
               true,true,true,false,[],10],
           5=>[0,"猪肉",[0,240],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],
               true,true,true,false,[],10],
           6=>[0,"糖葫芦",[0,60],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],
               true,true,true,false,[],10],
           7=>[0,"白玉豆腐",[0,80],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],
               true,true,true,false,[],10],
           8=>[1,"金创药",[0,0],[0,0],[0,0],[1,25],[0,0],[0,0],[0,0],[0,0],
               true,true,true,false,[],10],
           9=>[1,"生肌膏",[0,0],[0,0],[0,0],[1,50],[0,0],[0,0],[0,0],[0,0],
               true,true,true,false,[],10],
           10=>[1,"海外仙丹",[0,0],[0,0],[0,0],[0,0],[0,5],[0,5],[0,5],[0,5],
               true,true,true,false,[],140000],
           11=>[2,"拳经",[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],
               true,true,true,true,[[2,250],[43,200]],50000],
           12=>[2,"焦黄纸页",[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],
               true,true,true,true,[[10,250],[9,250]],30000],
           13=>[2,"惊天刀谱",[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],
               true,true,true,true,[[4,250],[29,200]],60000],
           14=>[2,"手抄本",[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],
               true,true,true,true,[[1,250],[21,250]],70000],
           15=>[2,"毛笔",[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],
               true,true,true,false,[],100],
           16=>[2,"女儿红",[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],
               true,true,true,false,[],-1],
           17=>[0,"鲤鱼",[0,250],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],
               true,true,true,false,[],200],
           18=>[2,"鱼篓",[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],
               true,true,true,false,[],10],
           19=>[2,"三角石板",[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],
               false,false,true,false,[],-1],
           20=>[2,"菜花宝典",[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],
               true,true,true,true,[[22,250],[56,100]],-1],
           21=>[2,"青龙坛地图",[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],
               true,true,true,false,[],-1],
           22=>[2,"地罡坛地图",[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],
               true,true,true,false,[],-1],
           23=>[2,"朱雀坛地图",[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],
               true,true,true,false,[],-1],
           24=>[2,"山岚坛地图",[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],
               true,true,true,false,[],-1],
           25=>[2,"玄武坛地图",[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],
               true,true,true,false,[],-1],
           26=>[2,"紫煞坛地图",[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],
               true,true,true,false,[],-1],
           27=>[2,"天徽坛地图",[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],
               true,true,true,false,[],-1],
           28=>[2,"白虎坛地图",[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],
               true,true,true,false,[],-1],
           29=>[2,"石料",[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],
               true,true,true,false,[],-1],
           30=>[1,"王蛇胆",[0,0],[0,0],[0,0],[0,0],[0,1],[0,1],[0,1],[0,1],
               true,true,true,false,[],-1],
           31=>[2,"兽王令牌",[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],
               true,true,true,false,[],-1],
           32=>[2,"茅山令牌",[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],[0,0],
               true,true,true,false,[],-1]}
    for i in 1..32
      $data_items[i].type = items[i][0]
      $data_items[i].add_food = items[i][2]
      $data_items[i].add_water = items[i][3]
      $data_items[i].add_hp = items[i][4]
      $data_items[i].add_mhp = items[i][5]
      $data_items[i].add_fp = items[i][6]
      $data_items[i].add_mfp = items[i][7]
      $data_items[i].add_mp = items[i][8]
      $data_items[i].add_mmp = items[i][9]
      $data_items[i].can_drop = items[i][10]
      $data_items[i].can_sell = items[i][11]
      $data_items[i].can_add = items[i][12]
      $data_items[i].is_book = items[i][13]
      $data_items[i].skill_list = items[i][14]
      $data_items[i].exp = items[i][15]
    end
    # id=>[名称,类型,命中,闪避,攻击,防御,膂力,敏捷,悟性,根骨,丢弃,出售,经验]
    weapons={1=>["菜刀",1,0,0,17,0,0,0,0,0,true,true,10000],
             2=>["匕首",0,0,0,5,0,0,0,0,0,true,true,10],
             3=>["檀香扇",0,0,0,15,0,0,0,0,0,true,true,10],
             4=>["缝衣针",0,0,0,10,0,0,0,0,0,true,true,10],
             5=>["麻绳",3,0,0,1,0,0,0,0,0,true,true,10],
             6=>["园工剪",0,0,0,15,0,0,0,0,0,true,true,10000],
             7=>["白玉箫",0,0,0,15,0,0,0,0,0,true,true,45000],
             8=>["钢刀",1,0,-1,25,0,0,0,0,0,true,true,10],
             9=>["杀猪刀",1,0,0,25,0,0,0,0,0,true,true,12000],
             10=>["鬼头刀",1,3,0,35,0,0,0,0,0,true,true,75000],
             11=>["紫金刀",1,0,-2,55,0,0,0,0,0,true,true,180000],
             12=>["柳玉刀",1,0,-1,40,0,0,0,0,0,true,true,65000],
             13=>["花蝶扇",1,0,0,35,0,0,0,0,0,true,true,130000],
             14=>["河豚毒",1,0,-2,55,0,0,0,0,0,true,true,85000],
             15=>["长剑",0,0,-1,25,0,0,0,0,0,true,true,10],
             16=>["青锋剑",0,0,0,65,0,0,0,0,0,true,true,130000],
             17=>["楚妃剑",0,0,0,45,0,0,0,0,0,true,true,55000],
             18=>["凝碧剑",0,0,0,60,0,0,0,0,0,true,true,130000],
             19=>["细剑",0,0,0,30,0,0,0,0,0,true,true,25000],
             20=>["铁剑",0,0,0,30,0,0,0,0,0,true,true,15000],
             21=>["长鞭",3,0,0,20,0,0,0,0,0,true,true,10],
             22=>["梨花鞭",3,0,-2,70,0,0,0,0,0,true,true,300000],
             23=>["拂尘",3,0,0,35,0,0,0,0,0,true,true,65000],
             24=>["红拂",3,0,-1,55,0,0,0,0,0,true,true,140000],
             25=>["钢杖",2,0,-2,28,0,0,0,0,0,true,true,10],
             26=>["精钢杖",2,0,0,35,0,0,0,0,0,true,true,30000],
             27=>["铁拐",2,0,0,20,0,0,0,0,0,true,true,15000],
             28=>["护手钩",1,5,-3,55,0,0,0,0,0,true,true,110000],
             29=>["屠龙刀",1,5,-10,88,0,0,0,0,0,true,true,-1],
             30=>["绣花针",0,10,5,99,0,0,0,0,0,true,true,-1],
             31=>["自制武器",0,0,0,0,0,0,0,0,0,false,false,-1]}
    for i in 1..31
      $data_weapons[i].type = weapons[i][1]
      $data_weapons[i].add_hit = weapons[i][2]
      $data_weapons[i].add_eva = weapons[i][3]
      $data_weapons[i].add_atk = weapons[i][4]
      $data_weapons[i].add_def = weapons[i][5]
      $data_weapons[i].add_str = weapons[i][6]
      $data_weapons[i].add_agi = weapons[i][7]
      $data_weapons[i].add_int = weapons[i][8]
      $data_weapons[i].add_bon = weapons[i][9]
      $data_weapons[i].add_fac = 0
      $data_weapons[i].can_drop = weapons[i][10]
      $data_weapons[i].can_sell = weapons[i][11]
      $data_weapons[i].exp = weapons[i][12]
    end
    # id=>[名称,类型,命中,闪避,攻击,防御,膂力,敏捷,悟性,根骨,丢弃,出售,经验]
    armors={1=>["黑衣",0,0,3,0,45,0,0,0,0,true,true,160000],
            2=>["老花镜",2,0,0,0,0,0,0,0,0,true,true,200],
            3=>["绿牡丹",2,0,0,0,0,0,0,0,0,true,true,10],
            4=>["布衣",0,0,0,0,5,0,0,0,0,true,true,10],
            5=>["精制布衣",0,0,0,0,15,0,0,0,0,true,true,200],
            6=>["皮背心",1,0,-1,0,15,0,0,0,0,true,true,10],
            7=>["粉红绸衫",0,0,0,0,15,0,0,0,0,true,true,5000],
            8=>["红杜鹃",2,0,0,0,0,0,0,0,0,true,true,10],
            9=>["绣花小鞋",3,0,0,0,5,0,0,0,0,true,true,5000],
            10=>["白玫瑰",2,0,0,0,0,0,0,0,0,true,true,10],
            11=>["茶花",2,0,0,0,0,0,0,0,0,true,true,10],
            12=>["轻花绸衫",0,0,0,0,8,0,0,0,0,true,true,3000],
            13=>["洒花缎鞋",3,0,3,0,10,0,0,0,0,true,true,40000],
            14=>["宝蓝缎衫",0,0,0,0,10,0,0,0,0,true,true,300000],
            15=>["夜行衣",0,0,6,0,0,0,0,0,0,true,true,160000],
            16=>["渌水罗衣",0,0,5,0,10,0,0,0,0,true,true,20000],
            17=>["轻纱长裙",0,0,0,0,1,0,0,0,0,true,true,180000],
            18=>["黑眼罩",2,3,0,0,3,0,0,0,0,true,true,160000],
            19=>["披风",5,0,2,0,5,0,0,0,0,true,true,85000],
            20=>["武道服",0,0,5,0,5,0,0,0,0,true,true,85000],
            21=>["道袍",0,0,0,0,5,0,0,0,0,true,true,160000],
            22=>["白罗袍",0,0,0,0,15,0,0,0,0,true,true,30000],
            23=>["绸袍",0,0,0,0,4,0,0,0,0,true,true,1000],
            24=>["金锁子甲",1,0,-5,0,60,0,0,0,0,true,true,180000],
            25=>["降魔袍",1,0,5,0,10,0,0,0,0,true,true,180000],
            26=>["霓虹羽衣",0,0,8,0,10,0,0,0,0,true,true,55000],
            27=>["雪山白袍",0,0,0,0,4,0,0,0,0,true,true,65000],
            28=>["亮银甲",1,0,-3,0,45,0,0,0,0,true,true,70000],
            29=>["豹皮",1,0,0,0,40,0,0,0,0,true,true,90000],
            30=>["牛皮束带",4,0,2,0,2,0,0,0,0,true,true,12000],
            31=>["钓竿",6,0,0,0,0,0,0,0,0,true,true,10],
            32=>["王蛇皮",1,0,0,0,70,0,0,0,0,true,true,-1],
            33=>["自制防具",0,0,0,0,0,0,0,0,0,false,false,-1]}
    for i in 1..33
      $data_armors[i].kind = armors[i][1]
      $data_armors[i].add_hit = armors[i][2]
      $data_armors[i].add_eva = armors[i][3]
      $data_armors[i].add_atk = armors[i][4]
      $data_armors[i].add_def = armors[i][5]
      $data_armors[i].add_str = armors[i][6]
      $data_armors[i].add_agi = armors[i][7]
      $data_armors[i].add_int = armors[i][8]
      $data_armors[i].add_bon = armors[i][9]
      $data_armors[i].add_fac = 0
      $data_armors[i].can_drop = armors[i][10]
      $data_armors[i].can_sell = armors[i][11]
      $data_armors[i].exp = armors[i][12]
    end
    # NPC数据
    npcs={1=>["潘小莲",-1,1,37,0,0,0,0,5000,0,0,0,16,24,25,21,27,22,370,370,200,200,370,0,0,0,[3,7],[3,9],[0,0],[0,0],1000,0,0,0,0,0,0,4,[[10,40],[2,20],[9,50],[1,30]],2,[[1,7],[1,4]],["潘小莲开了家豆腐店，别看她年过三十可风韵","犹存，不少人想吃她的豆腐呢。","","",""]],
2=>["小顽童",0,0,11,0,0,0,0,10,0,0,2,28,23,24,24,21,21,100,100,0,0,100,0,0,0,[3,4],[0,0],[0,0],[0,0],10,0,0,0,0,0,0,0,[],0,[],["小顽童蹦蹦跳跳的，一副兴高采烈的样子。","","","",""]],
3=>["捕快",0,0,40,0,0,0,0,20000,0,0,6,27,25,28,29,15,29,370,370,200,200,370,0,0,15,[3,4],[0,0],[0,0],[0,0],1500,0,0,0,0,0,0,3,[[10,45],[9,45],[3,70]],0,[],["六扇门里的捕快，虽然武艺平平，可为人正直","，名声不错。","","",""]],
4=>["采花大盗",0,0,32,20,50,0,0,105000,0,0,-5,18,28,22,24,35,27,320,320,0,0,320,0,0,0,[3,15],[0,0],[0,0],[0,0],10000,0,0,0,0,0,0,3,[[10,100],[2,100],[9,150]],0,[],["采花大盗一直被官府通缉，但他仗着轻功超群","，一直逍遥法外。","","",""]],
5=>["厨师",0,0,35,0,0,0,0,10000,0,0,2,28,21,24,21,22,24,320,320,0,0,320,0,0,0,[3,4],[0,0],[0,0],[0,0],100,0,0,0,0,0,0,3,[[10,40],[2,40],[9,40]],0,[],["这是一个胖胖的厨师。","","","",""]],
6=>["村长",0,0,47,0,0,0,0,40000,0,0,2,29,25,21,21,21,26,320,320,0,0,320,0,0,0,[3,4],[0,0],[0,0],[0,0],100,0,0,0,0,0,0,2,[[10,100],[2,100]],0,[],["作为一村之长，村长总是从忙忙碌碌。","","","",""]],
7=>["独行大侠",0,0,30,0,50,0,0,160000,1,0,10,20,20,26,21,28,25,620,620,1200,1200,620,0,0,15,[3,4],[0,0],[0,0],[0,0],0,0,0,0,0,0,0,10,[[1,250],[2,250],[3,250],[4,250],[7,250],[5,250],[6,250],[9,250],[10,250],[8,250]],0,[],["独行大侠刻苦钻研天下武艺，武功不知是何来","路，当年为追踪碧眼狐狸一路到此，没想到就","此在小镇住了下来。","",""]],
8=>["独脚大盗",0,0,45,50,50,0,0,80000,0,0,-3,33,18,20,22,15,29,320,320,0,0,320,0,0,0,[3,4],[0,0],[0,0],[0,0],10000,0,0,0,0,0,0,3,[[10,100],[2,100],[9,50]],0,[],["这是一个江洋大盗，年轻时被官兵砍断了一条","腿，后来到平一指那里装了一条木腿，身法还","算灵活。","",""]],
9=>["卖花妞",-1,1,17,0,0,0,0,10000,0,0,2,26,21,25,26,35,22,160,160,0,0,160,0,0,6,[3,4],[0,0],[0,0],[0,0],300,0,0,0,0,0,0,3,[[10,25],[9,20],[3,60]],3,[[3,10],[3,8],[3,3]],["美丽的卖花姑娘正在细心的用园工剪修剪花枝","。","","",""]],
10=>["中年妇人",0,1,36,0,0,0,0,6000,0,0,2,20,20,27,22,21,22,320,320,0,0,320,0,0,0,[3,4],[0,0],[0,0],[0,0],300,0,0,0,0,0,0,3,[[10,30],[2,40],[9,30]],0,[],["这是个胖胖的中年女子，头发乱蓬蓬的，脸上","老挂着笑容。她是出了名的马大哈，经常丢三","落四，整天不是不见了这就是找不到那。","",""]],
11=>["葛朗台",-1,0,48,0,0,0,0,110000,0,0,0,23,25,21,28,18,20,320,320,0,0,320,0,0,25,[3,4],[0,0],[0,0],[0,0],2,0,0,0,0,0,0,4,[[10,100],[2,50],[9,100],[5,100]],0,[],["这是小镇当铺的老板，一生吝啬小气，别看他","家财万贯，身上却从来没几个铜板。","","",""]],
12=>["小女孩",0,1,11,0,0,0,0,10,0,0,2,21,26,29,27,20,24,100,100,0,0,100,0,0,0,[3,4],[0,0],[0,0],[0,0],10,0,0,0,0,0,0,0,[],0,[],["小女孩蹦蹦跳跳的，一副兴高采烈的样子。","","","",""]],
13=>["西门广",0,0,20,0,0,0,0,1000,0,0,0,29,21,22,29,28,26,220,220,0,0,220,0,0,3,[3,4],[0,0],[0,0],[0,0],500,0,0,0,0,0,0,3,[[10,10],[9,20],[3,20]],0,[],["一个有钱人家的公子哥，手里拿着一把扇子正","在闲逛。","","",""]],
14=>["石料管事",0,0,39,0,0,0,0,30000,0,0,2,25,26,26,27,20,22,320,320,0,0,320,0,0,0,[3,4],[0,0],[0,0],[0,0],1500,0,0,0,0,0,0,3,[[10,60],[2,90],[9,60]],0,[],["石料厂管事负责管理工地的石料，小镇最近要","翻修，急需石料，开采出来不少可人手不足，","石料厂管事为此事也着实头疼。","",""]],
15=>["工地管事",0,0,39,0,0,0,0,30000,0,0,2,27,29,26,26,27,21,320,320,0,0,320,0,0,0,[3,4],[0,0],[0,0],[0,0],1500,0,0,0,0,0,0,3,[[10,60],[2,90],[9,60]],0,[],["工地管事负责准备石料，可目前人手不够，石","料在石料厂堆了不少可就是运不过来。","","",""]],
16=>["官兵",0,0,32,50,30,0,0,55000,0,0,6,27,25,29,29,20,26,320,320,0,0,320,0,0,8,[3,4],[0,0],[0,0],[0,0],100,0,0,0,0,0,0,4,[[10,70],[2,70],[4,90],[9,70]],0,[],["这是个正在这里站岗的守城官兵。","","","",""]],
17=>["神秘人",0,0,30,0,0,0,0,400,0,0,0,28,20,26,25,24,20,320,320,0,0,320,0,0,0,[3,4],[0,0],[0,0],[0,0],100,0,0,0,0,0,0,1,[[2,10]],0,[],["不知从哪里来的游玩客人，小镇虽然风景平淡","，他却饶有兴味。","","",""]],
18=>["黑衣大盗",0,0,32,20,15,0,0,160000,0,0,-2,18,28,22,25,25,25,320,320,0,0,320,0,0,0,[3,1],[0,0],[0,0],[0,0],30000,28,0,30,0,28,0,5,[[10,110],[30,110],[2,110],[9,110],[28,110]],0,[],["黑衣大盗一身黑衣，脸上也用黑布面罩蒙起来","，没人知道他是什么来路，好像也没怎么为难","乡亲们。","",""]],
19=>["何铁手",-1,1,36,0,0,0,0,110000,1,0,0,22,30,27,24,33,21,570,570,1000,1000,570,0,0,28,[3,4],[0,0],[0,0],[0,0],1000,0,18,20,21,18,0,8,[[20,100],[10,100],[18,100],[2,30],[4,100],[9,100],[1,100],[21,100]],6,[[2,21],[2,15],[2,2],[2,25],[2,8],[3,6]],["何铁手原是五毒教的首脑，后师承袁程志赐名","何锡守。她美貌如花，看不出多大年纪，左手","齐腕装了个铁钩，锋利无比，铁手之名即源于","此。",""]],
20=>["荷西",-1,0,33,0,0,0,0,8000,0,0,2,28,25,27,28,28,26,320,320,0,0,320,0,0,0,[0,0],[0,0],[0,0],[0,0],100,0,0,0,0,0,0,2,[[2,50],[9,40]],2,[[3,31],[1,18]],["荷西是个外乡人，到小镇安家也有好长时间了","，大家也慢慢将他作本地人看了。他开个渔具","店，自己钓鱼，收购鱼，还花钱到馆子里吃自","己钓的鱼，真是怪人。",""]],
21=>["流氓",0,0,28,0,0,0,0,5000,0,0,-3,28,20,22,23,12,26,320,320,0,0,320,0,0,0,[3,4],[0,0],[0,0],[0,0],100,0,0,0,0,0,0,3,[[10,10],[2,20],[9,30]],0,[],["一个满脸横肉的小流氓，一副寻衅滋事的架势","。","","",""]],
22=>["流氓头",0,0,31,0,0,0,0,35000,0,0,-4,25,20,20,21,28,27,320,320,0,0,320,0,0,0,[3,4],[0,0],[0,0],[0,0],1500,0,0,0,0,0,0,3,[[10,100],[2,100],[9,100]],0,[],["这是当地的流氓头领，附近的小流氓都听他的","指挥。","","",""]],
23=>["茅十七",0,0,36,0,0,0,0,35000,0,0,2,26,27,21,21,22,25,320,320,0,0,320,0,0,0,[3,4],[0,0],[0,0],[0,0],10000,23,0,0,0,23,0,4,[[10,60],[2,60],[9,100],[23,70]],0,[],["茅十七是茅十八的哥哥，自从十八随韦小宝进","京后就没回来，这不他一路找到小镇来了。","","",""]],
24=>["民团教头",0,0,38,0,0,0,0,40000,3,0,0,25,25,20,26,23,29,395,395,300,300,395,0,0,8,[3,4],[0,0],[0,0],[0,0],500,0,34,0,0,34,0,4,[[10,45],[4,75],[9,85],[34,70]],0,[],["他是复责训练民团的教头，听说功夫很不错。","","","",""]],
25=>["老婆婆",0,1,63,0,0,0,0,5000,0,0,6,18,16,29,27,22,23,320,320,0,0,320,0,0,0,[3,4],[0,0],[0,0],[0,0],100,0,0,0,0,0,0,3,[[10,40],[2,20],[9,50]],0,[],["老婆婆满脸皱纹，在这个镇里生活了几十年了","，大家都叫她婆婆。","","",""]],
26=>["平一指",-1,0,48,60,30,0,0,60000,0,0,0,17,26,30,20,15,25,320,320,0,0,320,0,0,0,[0,0],[0,0],[0,0],[0,0],10000,0,0,0,0,0,0,3,[[10,60],[2,80],[9,80]],2,[[1,8],[1,9]],["此人又矮又胖，头大无比，两撇鼠须甚是滑稽","，可谁知道他就是医术高超的「杀人神医」平","一指。可是他性格古怪，不是什么人都医的。","",""]],
27=>["小商贩",-1,0,44,0,0,0,0,6000,0,0,2,25,20,27,25,25,22,320,320,0,0,320,0,0,0,[3,4],[0,0],[0,0],[0,0],100,0,0,0,0,0,0,3,[[10,30],[2,30],[9,30]],1,[[1,6]],["面目和蔼的小贩，推车上插了个草靶，上面零","落地插了些糖葫芦。","","",""]],
28=>["小书童",0,0,14,0,0,0,0,100,0,0,2,27,21,22,25,22,24,100,100,0,0,100,0,0,0,[3,4],[1,-15],[0,0],[0,0],5,0,0,0,0,0,0,0,[],0,[],["一个替顾炎武倒茶磨墨的书童，青衣小帽，一","脸稚气中透出顽皮。","","",""]],
29=>["小裁缝",-1,0,16,0,0,0,0,200,0,0,2,29,23,29,26,24,22,140,140,0,0,140,0,0,0,[3,4],[0,0],[0,0],[0,0],100,0,0,0,0,0,0,0,[],1,[[3,4]],["一位小裁缝，正在学习缝制衣服。","","","",""]],
30=>["老裁缝",0,0,56,0,0,0,0,10000,0,0,2,26,22,24,22,27,25,320,320,0,0,320,0,0,0,[3,4],[0,0],[0,0],[0,0],200,0,0,0,0,0,0,3,[[10,30],[2,30],[9,30]],0,[],["老裁缝的手脚甚是麻利，显然已做了多年了。","","","",""]],
31=>["顾炎武",0,0,48,0,0,0,0,10000000,1,0,10,127,22,28,27,27,20,620,620,2000,2000,620,0,0,0,[0,0],[0,0],[0,0],[0,0],50000,0,0,0,0,0,0,1,[[11,180]],0,[],["顾炎武是个博学多闻的宿儒，提到他的学问乡","亲们都佩服得五体投地。因为不满时政，他隐","居于此，开了间私塾聊以度日。","",""]],
32=>["挑夫",0,0,34,0,0,0,0,500,0,0,2,28,29,26,22,22,23,320,320,0,0,320,0,0,0,[3,4],[0,0],[0,0],[0,0],50,0,0,0,0,0,0,2,[[10,10],[2,10]],0,[],["一位专门挑运行李的挑夫，随身带着扁担绳子","，人们称他们“棒棒军”。","","",""]],
33=>["民团团丁",0,0,30,0,0,0,0,12000,0,0,4,25,25,20,26,22,24,370,370,200,200,370,0,0,0,[3,4],[0,0],[0,0],[0,0],500,0,0,0,0,0,0,3,[[10,45],[2,55],[9,45]],0,[],["负责小镇治安的团丁，身材高大，看上去非常","结实。","","",""]],
34=>["胡屠户",-1,0,34,0,0,0,0,12000,0,0,0,29,28,14,29,23,24,320,320,0,0,320,0,0,9,[3,30],[3,4],[0,0],[0,0],100,0,0,0,0,0,0,3,[[10,60],[4,80],[9,60]],1,[[1,5]],["你看到一个彪悍的大块头，正在用钢刀剔猪肉","。","","",""]],
35=>["店小二",-1,0,18,0,0,0,0,300,0,0,2,20,23,22,29,26,26,180,180,0,0,180,0,0,0,[0,0],[0,0],[0,0],[0,0],100,0,0,0,0,0,0,0,[],2,[[1,2],[1,1]],["这位店小二正笑眯眯地忙着，还不时拿起挂在","脖子上的抹布擦脸。","","",""]],
36=>["寻捕",0,0,37,60,30,0,0,60000,1,0,6,27,25,23,22,25,27,420,420,400,400,420,0,0,15,[3,4],[0,0],[0,0],[0,0],100,0,0,0,0,0,0,3,[[10,45],[9,45],[3,90]],0,[],["寻捕大人在这一带颇有声望，破了不少案子，","虽然不能和江湖上的四大名捕相提并论，可也","是名声显赫。","",""]],
37=>["盐商",0,0,39,0,0,0,0,10000,0,0,-3,27,23,29,24,25,22,320,320,0,0,320,0,0,0,[3,4],[0,0],[0,0],[0,0],500,0,0,0,0,0,0,1,[[2,50]],0,[],["自古以来贩运私盐就是违法的，可这个盐商不","知道打通了什么关节，居然大模大样招摇过市","。","",""]],
38=>["杂货贩",-1,0,36,0,0,0,0,30000,0,0,2,25,23,26,23,25,28,320,320,0,0,320,0,0,0,[3,4],[0,0],[0,0],[0,0],6000,0,0,0,0,0,0,3,[[10,90],[2,100],[9,60]],2,[[2,5],[2,4]],["卖杂货的是个年轻汉子，面带微笑。","","","",""]],
39=>["商宝震",1,0,25,0,0,0,0,60000,10,0,2,22,23,24,29,23,22,470,470,600,600,470,0,0,8,[3,4],[0,0],[0,0],[0,0],100,0,14,15,16,14,0,10,[[2,60],[4,60],[9,60],[1,80],[10,60],[12,60],[14,60],[15,60],[16,80],[11,50]],0,[],["商宝震是商剑鸣的大儿子，刀法掌法也得过父","亲的真传。","","",""]],
40=>["武师教头",0,0,39,0,0,0,0,40000,4,0,2,28,25,26,22,24,28,420,420,400,400,420,0,0,0,[3,4],[0,0],[0,0],[0,0],500,12,0,0,0,12,0,5,[[10,65],[2,75],[12,70],[9,85],[1,80]],0,[],["他是护院武师的总教头，在八卦掌上也下了多","年的苦功夫，虽算不上高手，对付一般江湖人","物也游刃有余了。","",""]],
41=>["马春花",0,1,23,0,0,0,0,20000,0,0,2,17,25,23,27,28,28,355,355,300,300,355,0,0,0,[3,4],[0,0],[0,0],[0,0],200,0,0,0,0,0,0,3,[[10,65],[2,70],[9,75]],0,[],["马春花是马行空的女儿，一张圆圆的鹅蛋脸，","眼珠子黑漆漆的，两颊晕红，周身透着青春活","泼的气息。","",""]],
42=>["护院武师",0,0,42,0,0,0,0,15000,0,0,2,25,25,23,27,27,24,395,395,300,300,395,0,0,8,[3,4],[0,0],[0,0],[0,0],2000,0,0,0,0,0,0,3,[[10,65],[4,60],[9,65]],0,[],["一个高大结实的武师，据说是从沧州来的，武","艺还不错。","","",""]],
43=>["王剑杰",0,0,34,0,30,0,0,140000,2,0,2,25,25,22,27,20,21,570,570,1000,1000,570,0,0,0,[3,4],[0,0],[0,0],[0,0],1000,0,0,15,16,13,0,7,[[10,100],[16,100],[2,100],[15,100],[13,100],[9,100],[1,100]],0,[],["王剑杰一张紫膛脸，神态威猛，身材魁梧，他","是王维扬的二儿子，武学造诣也是不凡。","","",""]],
44=>["商剑鸣",1,0,45,0,0,0,0,180000,2,0,2,27,26,24,29,28,21,570,570,1000,1000,570,0,0,11,[3,4],[0,0],[0,0],[0,0],100,0,14,15,16,14,0,10,[[2,110],[4,110],[9,110],[1,110],[10,110],[12,110],[14,110],[15,110],[16,150],[11,50]],0,[],["商剑鸣是威震河朔王维扬的大弟子，他在本门","八卦刀法上浸润多年，造诣煞是不凡，从他的","外号就可以看出武林对他的刀法也很推崇。","",""]],
45=>["王剑英",0,0,38,0,40,0,0,180000,10,0,2,28,27,29,29,23,26,620,620,1200,1200,620,0,0,0,[3,4],[0,0],[0,0],[0,0],50000,0,0,15,16,13,0,7,[[10,120],[16,110],[2,120],[15,110],[13,120],[9,100],[1,100]],0,[],["王剑英是王维扬的大儿子，自小随父亲练功，","八卦门的不传绝学“八阵八卦掌”也尽数传给","了他。","",""]],
46=>["商老太",0,1,56,0,0,0,0,80000,10,0,2,22,22,28,22,22,25,470,470,600,600,470,0,0,8,[3,4],[0,0],[0,0],[0,0],100,0,14,15,16,14,0,9,[[10,60],[16,80],[2,90],[12,60],[15,90],[4,90],[9,80],[14,90],[1,80]],0,[],["商老太幼时陪伴父亲，婚后跟随丈夫闯荡江湖","，也会过无数武林豪杰，平时却是深藏不露。","","",""]],
47=>["平阿四",0,0,46,0,0,0,0,1000,0,0,6,28,28,25,23,27,26,320,320,0,0,320,0,0,0,[3,4],[0,0],[0,0],[0,0],100,0,0,0,0,0,0,2,[[2,20],[9,20]],0,[],["平阿四只余左臂，一条极长的刀疤从右眉起斜","过鼻子，一直延伸到左边嘴角，显得极是恐怖","。","",""]],
48=>["王维扬",1,0,56,0,0,0,0,800000,12,0,6,32,24,24,27,21,27,670,670,3000,3000,670,0,0,8,[3,4],[1,-19],[0,0],[0,0],100,13,14,15,16,13,0,11,[[2,160],[4,160],[9,160],[1,160],[10,160],[12,160],[13,180],[14,180],[15,160],[16,250],[11,60]],0,[],["王维扬是北京震远镖局的总镖头，当年凭一对","八卦掌，一把八卦刀威震江湖绿林。黑道中有","一句话道：宁碰阎王，莫碰老王，端的是名扬","天下。",""]],
49=>["马行空",0,0,52,0,40,0,0,110000,2,0,2,25,27,25,29,24,24,520,520,800,800,520,0,0,0,[3,4],[0,0],[0,0],[0,0],30000,0,0,0,0,23,0,5,[[10,60],[2,100],[23,100],[9,100],[1,100]],0,[],["马行空身高不过五尺，但目光炯炯，凛然有威","。自从上次押镖经过商家堡，这一住就住了下","来。","",""]],
50=>["徐铮",0,0,28,0,0,0,0,35000,0,0,2,27,25,20,20,28,20,395,395,300,300,395,0,0,8,[3,4],[0,0],[0,0],[0,0],3000,0,0,0,0,0,0,5,[[10,90],[2,70],[4,90],[9,75],[1,70]],0,[],["他是马行空的弟子，生得浓眉大眼，神情粗豪","，脸上生满紫色小疮，但步履轻健，精神饱满","，却也英气勃勃。","",""]],
51=>["阎基",0,0,36,0,0,0,0,15000,2,0,-5,28,26,26,27,16,29,445,445,500,500,445,0,0,10,[3,4],[1,-12],[0,0],[0,0],500,0,0,0,0,0,0,6,[[10,50],[2,50],[4,60],[9,50],[11,50],[1,50]],0,[],["此人面貌猥琐，缩头缩脑，神情打扮，就如是","个暴发户富商。他本来是个江湖跌打医生，后","来干起了没本的买卖。","",""]],
52=>["庄丁",0,0,26,0,0,0,0,2000,0,0,2,26,25,24,29,23,27,320,320,0,0,320,0,0,0,[3,4],[0,0],[0,0],[0,0],50,0,0,0,0,0,0,3,[[10,20],[2,30],[9,20]],0,[],["一个年轻的庄丁，正在左顾右盼，他的职责是","防止形迹可疑的人进入庄院。","","",""]],
53=>["茶花女",-1,1,23,0,0,0,0,35000,0,0,2,16,22,26,23,27,24,280,280,0,0,280,0,0,0,[3,4],[0,0],[0,0],[0,0],10,17,0,20,0,17,0,6,[[20,60],[10,60],[2,60],[17,60],[9,60],[21,60]],1,[[3,11]],["茶花女是从云南大理来的，她种出的茶花很多","都是名品。","","",""]],
54=>["公孙大娘",0,1,33,0,0,0,0,150000,0,0,2,24,29,23,20,23,26,620,620,1200,1200,620,0,0,8,[3,4],[0,0],[0,0],[0,0],30000,0,18,20,21,18,0,9,[[20,130],[10,120],[18,110],[2,100],[17,100],[4,100],[9,100],[1,100],[21,100]],0,[],["公孙大娘的“剑器之舞”名动京城，昔年老杜","一观后曾发出“剑器一舞动四方”的赞叹。岂","知此舞实应为武，没有高深的武功又怎能舞出","绝世的剑器呢。",""]],
55=>["红拂女",0,1,21,0,0,0,0,140000,1,0,2,26,25,26,27,30,21,540,540,1500,1500,540,0,0,24,[3,4],[1,-10],[0,0],[0,0],100,0,19,20,21,19,0,7,[[20,100],[10,100],[19,110],[6,100],[9,100],[1,100],[21,100]],0,[],["红拂女长发及膝，当年虬髯客也曾被她梳理长","发的容光所吸引。没想到这多年后她还是如此","年轻，看来李靖得仙丹的传说可能真有此事。","",""]],
56=>["绿珠",0,1,24,0,0,0,0,120000,2,0,2,21,25,20,26,28,27,550,550,1000,1000,550,0,0,0,[3,4],[0,0],[0,0],[0,0],100,17,0,20,21,17,0,7,[[20,90],[10,100],[2,100],[17,120],[9,40],[1,100],[21,100]],0,[],["绿珠是个容貌出色的美女，气节刚烈的她坠楼","后并没有死，李青照救她到此并传了她高深的","武功。虽经平一指精心调治，她的腿还是留下","了残疾。",""]],
57=>["平婆婆",2,1,63,0,0,0,0,60000,0,0,2,29,21,21,25,16,29,420,420,400,400,420,0,0,0,[3,4],[0,0],[0,0],[0,0],100,17,0,20,21,17,0,8,[[2,70],[9,70],[1,70],[10,50],[17,70],[20,60],[21,80],[11,60]],0,[],["平婆婆是李青照的奶母，多年来一直跟随左右","，耳闻目睹间竟然也修习了一身不错的武功。","现在花间派的新弟子武功修习由她指导。","",""]],
58=>["桑轻虹",2,1,26,0,0,0,0,160000,0,0,2,22,20,28,29,29,25,570,570,1000,1000,570,0,0,21,[3,14],[3,13],[0,0],[0,0],100,17,0,20,21,19,0,10,[[2,100],[6,130],[9,110],[10,100],[1,100],[17,100],[19,130],[20,110],[21,150],[11,100]],0,[],["桑轻虹是李青照的嫡传弟子，她年纪比唐晚词","尚小几岁，可却得了花间派花团锦簇鞭法的真","传。","",""]],
59=>["李青照",2,1,37,0,0,0,0,1000000,2,0,6,26,29,31,23,30,26,670,670,3400,3400,670,0,0,22,[3,14],[1,-19],[0,0],[0,0],100,17,19,20,21,17,0,12,[[2,150],[6,160],[4,160],[9,140],[1,140],[10,140],[17,180],[18,180],[19,180],[20,150],[21,250],[11,150]],0,[],["李青照温文尔雅，仪态万方。她不但武艺绝伦","并且精于词律，她的诗词广为传诵。据说花间","派的绝技一剪梅花手就是她于一首词中演化而","来。",""]],
60=>["入画",0,1,22,0,0,0,0,40000,10,0,2,26,20,25,20,33,28,335,335,300,300,335,0,0,0,[3,12],[3,13],[0,0],[0,0],100,17,0,20,21,17,0,7,[[20,50],[10,60],[2,60],[17,70],[9,60],[1,60],[21,60]],0,[],["入画是李青照身边的侍女中容貌最出色的一个","，她开朗好动，笑语嫣然，狂而不损其媚人皆","乐之。","",""]],
61=>["瑞婆婆",0,1,58,0,0,0,0,35000,0,0,2,29,23,23,26,18,29,395,395,300,300,395,0,0,0,[3,4],[0,0],[0,0],[0,0],100,17,0,20,0,17,0,6,[[20,60],[10,60],[2,60],[17,50],[9,60],[21,60]],0,[],["瑞婆婆是李青照身边的老佣人，她和平婆婆一","起服侍李青照，关系很是亲密。她比平婆婆还","小上几岁，身体十分硬朗。","",""]],
62=>["柳如是",0,1,26,0,40,0,0,65000,20,0,2,27,25,21,27,30,28,495,495,700,700,495,0,0,0,[3,4],[3,11],[0,0],[0,0],100,17,0,20,21,17,0,7,[[20,80],[10,80],[2,80],[17,80],[9,80],[1,80],[21,80]],0,[],["柳如是是京城的名妓，江湖传言她是青龙会的","红旗老幺，不过看他娇娇弱弱的样子谁也想不","到她身怀武功。","",""]],
63=>["李师师",0,1,26,0,40,0,0,65000,0,0,0,28,25,28,23,30,22,320,320,0,0,320,0,0,12,[3,4],[3,11],[0,0],[0,0],100,0,18,20,0,18,0,5,[[20,90],[10,80],[18,80],[4,70],[9,60]],0,[],["李师师是京城的名妓，可很少有人知道她是“","红鞋子”组织的秘密成员，更没人知道她还有","一身花间派的武功。","",""]],
64=>["侍书",0,1,22,0,0,0,0,40000,10,0,2,25,28,22,24,25,29,335,335,300,300,335,0,0,0,[3,12],[3,13],[0,0],[0,0],100,17,0,20,21,17,0,7,[[20,70],[10,60],[2,60],[17,50],[9,60],[1,60],[21,60]],0,[],["侍书是李青照身边的侍女，她年纪大上几岁，","行为端庄不苟言笑。","","",""]],
65=>["司棋",0,1,18,0,0,0,0,3000,0,0,2,20,21,27,23,25,24,180,180,0,0,180,0,0,0,[3,12],[0,0],[0,0],[0,0],100,17,0,0,0,17,0,3,[[10,20],[2,20],[17,15]],0,[],["司棋是李青照身边的侍女，一副天真烂漫的样","子。","","",""]],
66=>["听琴",0,1,18,0,0,0,0,3000,0,0,2,21,24,26,27,25,22,180,180,0,0,180,0,0,0,[3,12],[0,0],[0,0],[0,0],100,17,0,0,0,17,0,3,[[10,20],[2,20],[17,10]],0,[],["听琴是李青照身边的侍女，一副天真烂漫的样","子。","","",""]],
67=>["唐晚词",2,1,28,0,0,0,0,150000,0,0,2,29,28,26,24,28,23,570,570,1000,1000,570,0,0,8,[3,12],[3,13],[0,0],[0,0],100,17,18,20,21,18,0,11,[[2,100],[4,120],[9,120],[1,100],[10,100],[17,100],[18,120],[20,120],[21,150],[11,100],[22,180]],0,[],["唐晚词是李青照的嫡传弟子，别看她巧笑如花","，但双眸流转间透出一股英气。","","",""]],
68=>["小红",0,1,21,40,30,0,0,45000,0,0,2,26,22,22,24,28,22,240,240,0,0,240,0,0,7,[3,4],[0,0],[0,0],[0,0],100,0,0,0,0,0,0,3,[[10,60],[9,60],[3,60]],0,[],["小红原来的名字是什么大家都不记得了，她神","色间有时闪过一丝凄苦，经常会凝望窗外发呆","。","",""]],
69=>["薛涛",0,1,24,0,0,0,0,120000,2,0,2,21,25,23,26,26,23,550,550,1000,1000,550,0,0,0,[3,4],[0,0],[0,0],[0,0],100,17,0,20,21,17,0,7,[[20,100],[10,100],[2,100],[17,100],[9,100],[1,100],[21,100]],0,[],["薛涛素有才名，她制作的信笺被时人称为“薛","涛笺”，她与李青照素有诗书往来，用的都是","这种“薛涛笺”。","",""]],
70=>["聂隐娘",0,1,27,0,0,0,0,180000,0,0,2,24,32,25,21,28,28,620,620,1200,1200,620,0,0,8,[3,17],[0,0],[0,0],[0,0],10000,0,0,20,21,19,0,7,[[20,130],[10,120],[19,110],[6,100],[9,120],[1,100],[21,100]],0,[],["聂隐娘是个传奇人物，她师承空空儿，轻功奇","高，以致后来被神化为剑仙一流。她是李青照","的闺中密友，两人过从甚密。","",""]],
71=>["白衣教众",0,0,36,0,0,0,0,30000,20,0,2,28,26,25,24,30,21,407,407,350,350,407,0,0,26,[0,0],[0,0],[0,0],[0,0],100,0,24,25,26,24,0,7,[[10,40],[24,40],[25,40],[9,40],[5,40],[26,40],[1,40]],0,[],["红莲教教众按武功高低依次分为红、白、黑、","蓝四色教众。","","",""]],
72=>["王璁儿",0,1,26,0,0,0,0,180000,50,0,2,28,22,30,29,30,23,570,570,1000,1000,570,0,0,0,[0,0],[0,0],[0,0],[0,0],100,23,0,25,26,23,0,7,[[10,150],[2,150],[25,100],[23,120],[9,150],[26,100],[1,150]],0,[],["红莲教护法，与唐思儿并称“红莲双娇”，其","实论到武功，除了教主就数她了。","","",""]],
73=>["褚红灯",0,0,35,0,0,0,0,145000,60,0,2,30,30,10,30,10,21,570,570,1000,1000,570,0,0,25,[3,22],[0,0],[0,0],[0,0],100,23,24,25,0,24,0,9,[[10,100],[24,100],[2,100],[25,100],[23,100],[9,100],[5,100],[26,100],[1,100]],0,[],["一个红脸怒相的大汉，身高足有一丈，站在那","里威风凛凛。","","",""]],
74=>["方长老",3,0,52,0,0,0,0,300000,12,0,2,28,26,24,28,26,29,570,570,1000,1000,570,0,0,25,[3,22],[0,0],[0,0],[0,0],100,0,24,25,26,24,0,11,[[2,150],[5,120],[9,120],[1,120],[10,120],[23,120],[24,120],[25,120],[26,150],[11,50],[27,120]],0,[],["方长老是红莲教的光明执法，也是戒律堂的执","行长老，有违背红莲教义的弟子他从来不会手","下留情。","",""]],
75=>["韩长老",0,0,49,0,0,0,0,140000,20,0,2,23,29,29,29,30,28,470,470,600,600,470,0,0,0,[3,22],[0,0],[0,0],[0,0],100,23,0,25,26,23,0,7,[[10,90],[2,90],[25,90],[23,120],[9,90],[26,90],[1,90]],0,[],["韩长老原在朝廷为官，后不满官场黑暗，遂加","入红莲教。","","",""]],
76=>["黑衣教众",0,0,28,0,0,0,0,15000,20,0,2,21,29,24,25,30,26,395,395,300,300,395,0,0,27,[0,0],[0,0],[0,0],[0,0],100,0,24,25,26,24,0,7,[[10,30],[24,30],[25,30],[9,30],[5,30],[26,30],[1,30]],0,[],["红莲教教众按武功高低依次分为红、白、黑、","蓝四色教众。","","",""]],
77=>["红衣教众",0,0,25,0,0,0,0,40000,20,0,2,23,25,28,27,25,21,420,420,400,400,420,0,0,27,[0,0],[0,0],[0,0],[0,0],100,0,24,25,26,24,0,7,[[10,50],[24,50],[25,50],[9,50],[5,50],[26,50],[1,50]],0,[],["红莲教教众按武功高低依次分为红、白、黑、","蓝四色教众。","","",""]],
78=>["蓝衣教众",0,0,28,0,0,0,0,15000,20,0,2,26,22,26,25,30,20,395,395,300,300,395,0,0,27,[0,0],[0,0],[0,0],[0,0],100,0,24,25,26,24,0,7,[[10,20],[24,20],[25,20],[9,20],[5,20],[26,20],[1,20]],0,[],["红莲教教众按武功高低依次分为红、白、黑、","蓝四色教众。","","",""]],
79=>["齐林天",0,0,30,0,0,0,0,90000,50,0,2,25,20,25,24,10,25,520,520,800,800,520,0,0,0,[3,22],[0,0],[0,0],[0,0],2000,23,0,25,26,23,0,7,[[10,80],[2,80],[25,80],[23,80],[9,80],[26,80],[1,80]],0,[],["一个白衣白净面皮的中年人，死白的脸上看不","出任何喜怒哀乐。","","",""]],
80=>["唐思儿",0,1,26,0,0,0,0,180000,40,0,2,21,23,30,24,30,28,420,420,400,400,420,0,0,25,[3,16],[0,0],[0,0],[0,0],100,0,24,0,26,24,0,7,[[10,119],[24,100],[2,119],[9,119],[5,119],[26,100],[1,100]],0,[],["一代巾帼英雄，人称花木兰第二。","","","",""]],
81=>["余鸿儒",3,0,62,0,0,0,0,900000,2,0,6,35,24,34,29,25,21,720,720,2600,2600,720,0,0,26,[3,4],[1,-19],[0,0],[0,0],100,0,24,25,26,24,0,11,[[2,160],[5,160],[9,160],[1,160],[10,160],[23,180],[24,180],[25,160],[26,250],[11,150],[27,180]],0,[],["红莲教的教主，红莲教虽是秘密组织，行动诡","秘，但一直以扶危济困为宗旨，在老百姓中口","碑不错，近年来更是门徒广大，俨然为武林第","一大帮会。",""]],
82=>["十兵卫",0,0,38,0,0,0,0,160000,20,0,2,28,23,26,25,16,29,645,645,1300,1300,645,0,0,8,[3,4],[3,18],[0,0],[0,0],100,0,29,30,31,29,0,7,[[10,110],[30,100],[31,150],[4,120],[9,110],[29,110],[1,110]],0,[],["十兵卫是两刀流的创始人，对尹贺一派的一刀","流技法一直心存成见。这次他专门来拜访和仲","阳，没想到却对一刀流着了迷。","",""]],
83=>["大熊",0,0,21,0,0,0,0,30000,0,0,2,30,29,22,23,12,21,315,315,300,300,315,0,0,0,[3,4],[0,0],[0,0],[0,0],100,28,0,30,0,28,0,5,[[10,50],[30,50],[2,70],[9,40],[28,70]],0,[],["大熊是花十郎的弟子，他是个大块头儿，看上","去有把子力气，可总有些呆头呆脑。","","",""]],
84=>["未知火舞",0,1,21,0,0,0,0,130000,0,0,2,20,25,26,20,33,24,565,565,1300,1300,565,0,0,13,[3,4],[0,0],[0,0],[0,0],100,0,29,30,31,29,0,7,[[10,100],[30,120],[31,100],[4,100],[9,100],[29,100],[1,100]],0,[],["未知火舞是不知火流的传人，为迎接下一届格","斗之王的邀请赛，专门来拜访和仲阳，学习尹","贺一派的技击之法。","",""]],
85=>["浪人甲",0,0,34,0,0,0,0,20000,0,0,2,22,29,28,22,22,21,320,320,0,0,320,0,0,0,[3,4],[0,0],[0,0],[0,0],200,0,0,0,0,0,0,3,[[10,50],[2,70],[9,80]],0,[],["这是一个来自远方的浪人，满身征尘，是专门","来花讽院朝拜的。","","",""]],
86=>["浪人乙",0,0,32,0,0,0,0,45000,0,0,2,21,21,20,22,22,26,320,320,0,0,320,0,0,0,[3,4],[0,0],[0,0],[0,0],10000,0,0,0,0,0,0,3,[[10,90],[2,70],[9,100]],0,[],["这个浪人来自遥远的北方，他是带着贵重的礼","物来拜访和仲阳的。","","",""]],
87=>["大口木子",0,1,22,0,0,0,0,35000,0,0,2,20,22,28,21,23,25,335,335,300,300,335,0,0,0,[3,4],[0,0],[0,0],[0,0],100,28,0,30,0,28,0,5,[[10,50],[30,50],[2,60],[9,90],[28,70]],0,[],["大口木子是藤王丸的弟子，她是个很文静的女","子，可学武几年来一直无法领会师傅的高深武","功，不过她好像也意不在此。","",""]],
88=>["陈美娜",4,1,32,0,0,0,0,100000,10,0,2,23,29,20,27,20,26,570,570,1000,1000,570,0,0,8,[3,4],[0,0],[0,0],[0,0],100,28,29,30,31,29,0,10,[[2,80],[4,120],[9,100],[1,100],[10,100],[28,60],[29,120],[30,100],[31,150],[11,60]],0,[],["陈美娜满脸戾气，一副桀骜不驯的神色。她是","和仲阳的得意弟子之一，专修一刀流刀法。","","",""]],
89=>["孙悟菜",0,0,24,0,40,0,0,85000,0,0,2,33,26,20,24,24,27,500,500,800,800,500,0,0,14,[3,4],[0,0],[0,0],[0,0],1000,0,29,30,31,29,0,7,[[10,90],[30,80],[31,90],[4,90],[9,80],[29,90],[1,90]],0,[],["孙悟菜是经龟仙人介绍来的，为下一年的比武","大会开开眼界，经花十郎的指点后对尹贺派的","武功颇有领悟。藤王丸甚至将自己的宝刀河豚","毒借给他使用。",""]],
90=>["食野太郎",0,0,20,0,0,0,0,15000,0,0,2,22,24,29,21,24,20,220,220,0,0,220,0,0,0,[3,4],[0,0],[0,0],[0,0],1000,28,0,30,0,28,0,5,[[10,50],[30,30],[2,50],[9,50],[28,40]],0,[],["食野太郎人如其名，块头不大可饭量惊人，总","是一副受虐待吃不饱的可怜像，他的师傅藤王","丸也拿他没办法。","",""]],
91=>["藤王丸",4,0,34,0,0,0,0,100000,10,0,2,28,26,25,25,27,28,570,570,1000,1000,570,0,0,0,[3,4],[0,0],[0,0],[0,0],100,28,0,30,31,28,0,10,[[2,120],[4,80],[9,100],[1,100],[10,100],[28,120],[29,60],[30,100],[31,150],[11,60]],0,[],["藤王丸一头乱蓬蓬的长发，脸孔棱角分明，一","身风尘骠悍之色。他是和仲阳的得意弟子之一","，最爱游历山川。","",""]],
92=>["天津虾",0,0,24,0,0,0,0,85000,10,0,2,28,26,24,21,24,22,500,500,800,800,500,0,0,0,[3,20],[3,19],[0,0],[0,0],1000,28,0,30,31,28,0,7,[[10,90],[30,80],[2,90],[31,120],[9,80],[29,90],[1,90]],0,[],["天津虾是经龟仙人介绍来的，为下一年的比武","大会长长见识。经藤王丸的指点后对尹贺一派","的武功颇有所领悟。","",""]],
93=>["野比",0,0,20,0,0,0,0,15000,0,0,2,27,25,24,22,21,24,220,220,0,0,220,0,0,0,[3,4],[0,0],[0,0],[0,0],100,28,0,0,0,28,0,4,[[10,50],[2,50],[9,50],[28,40]],0,[],["野比是花十郎的弟子，他身材瘦小目光闪烁，","看来十分顽皮。","","",""]],
94=>["枳右京",0,0,32,0,0,0,0,160000,0,0,2,20,27,29,22,29,24,595,595,1100,1100,595,0,0,8,[3,4],[0,0],[0,0],[0,0],100,0,29,30,31,29,0,7,[[10,110],[30,100],[31,110],[4,110],[9,110],[29,110],[1,110]],0,[],["藤王丸的好朋友和永远的竞争对手，他患有肺","病，走遍世界只为找寻一朵美丽之花送给心爱","的人。藤王丸听说平一指刀圭如神，硬把他拖","来碰碰运气。",""]],
95=>["和仲阳",4,0,64,0,0,0,0,1000000,2,0,6,24,26,27,23,22,21,695,695,3000,3000,695,0,0,8,[3,4],[1,-19],[0,0],[0,0],100,28,29,30,31,29,0,10,[[2,150],[4,180],[9,140],[1,160],[10,140],[28,150],[29,180],[30,170],[31,250],[11,120]],0,[],["和仲阳是个瘦小枯干的小老头，在硕大的竹斗","笠下总是一副慵懒的面容，谁也想不到他却是","花讽院的院主，尹贺一派的掌门人，弟子遍布","天下。",""]],
96=>["采药道人",0,0,38,0,0,0,0,85000,80,0,2,30,27,30,20,30,22,620,620,1200,1200,620,0,0,20,[3,22],[0,0],[0,0],[0,0],5000,32,33,35,36,33,0,9,[[10,100],[2,100],[35,100],[33,100],[32,100],[9,100],[3,100],[36,100],[1,100]],0,[],["采药道人与清虚道长实是半师半友，也是太极","门内外总管。因其少年时降魔无数，人称「小","天师」。","",""]],
97=>["苍月道长",5,0,46,0,0,0,0,160000,0,0,2,27,26,25,24,26,25,570,570,1000,1000,570,0,0,0,[3,21],[0,0],[0,0],[0,0],100,0,34,35,36,34,0,9,[[2,120],[4,130],[9,130],[1,130],[10,130],[34,130],[35,130],[36,150],[11,100]],0,[],["清虚道长的师弟，三清观声名显赫，他与清虚","道长古松道长并称，武林中人提起都是竖起拇","指，不但佩服他们武学修为了得，也因他们侠","风亮节，武德高尚。",""]],
98=>["古松道长",5,0,46,0,0,0,0,160000,10,0,2,25,25,23,23,23,24,520,520,800,800,520,0,0,0,[3,21],[0,0],[0,0],[0,0],100,32,0,35,36,32,0,7,[[2,120],[9,120],[1,120],[10,120],[32,120],[35,120],[36,120]],0,[],["清虚道长的师弟，三清观声名显赫，他与清虚","道长苍月道长并称，武林中人提起都是竖起拇","指，不但佩服他们武学修为了得，也因他们侠","风亮节，武德高尚。",""]],
99=>["谷虚道长",0,0,38,0,0,0,0,130000,10,0,2,25,25,23,20,20,20,520,520,800,800,520,0,0,16,[3,25],[0,0],[0,0],[0,0],100,32,0,35,36,32,0,7,[[10,120],[2,120],[35,120],[32,120],[9,120],[36,120],[1,120]],0,[],["一个相貌堂堂的道士。","","","",""]],
100=>["明月",0,0,22,0,0,0,0,40000,2,0,2,25,20,28,20,30,23,335,335,300,300,335,0,0,0,[3,22],[0,0],[0,0],[0,0],100,32,0,0,36,0,0,7,[[10,60],[2,60],[32,60],[3,60],[9,60],[36,60],[1,60]],0,[],["一个胖乎乎的道长，正傻呵呵的不知笑什么。","","","",""]],
101=>["清风",0,0,22,0,0,0,0,15000,10,0,2,24,29,25,25,30,28,335,335,300,300,335,0,0,20,[3,22],[0,0],[0,0],[0,0],100,32,33,35,36,33,0,9,[[10,40],[2,40],[35,40],[32,40],[33,40],[3,40],[9,40],[36,40],[1,40]],0,[],["太极门第三代弟子中杰出人物。","","","",""]],
102=>["清虚道长",5,0,62,0,0,0,0,1100000,1,0,8,28,28,28,27,20,25,745,745,3700,3700,745,0,0,15,[3,21],[1,-19],[0,0],[0,0],100,0,33,35,36,33,0,12,[[2,200],[4,200],[3,200],[9,200],[1,200],[10,200],[32,220],[33,220],[35,200],[34,200],[36,250],[11,130]],0,[],["清虚道长面目慈祥，虽年过花甲但鹤发童颜精","神矍铄，因常修道家养生之道，为人中正平和","深受武林人士爱戴。","",""]],
103=>["烧饭道童",0,0,19,0,0,0,0,2000,0,0,2,27,23,26,24,30,23,200,200,0,0,200,0,0,0,[0,0],[0,0],[0,0],[0,0],100,0,0,0,0,0,0,2,[[2,20],[9,20]],0,[],["一个吃的胖胖的小道士，正在烧火。","","","",""]],
104=>["桃花",0,1,22,0,0,0,0,1000,0,0,2,25,27,21,20,28,27,260,260,0,0,260,0,0,0,[3,22],[0,0],[0,0],[0,0],100,0,0,0,0,0,0,2,[[2,40],[9,40]],0,[],["清虚道长的远房侄女。","","","",""]],
105=>["土匪",0,0,25,0,0,0,0,45000,0,0,-3,20,28,23,29,25,26,320,320,0,0,320,0,0,20,[0,0],[0,0],[0,0],[0,0],5000,0,0,0,0,0,0,3,[[10,60],[9,60],[3,60]],0,[],["一个体型魁梧，看起来孔武有力的大个子。正","狠巴巴的瞪着你。","","",""]],
106=>["土匪头领",0,0,35,0,0,0,0,60000,20,0,-4,25,23,25,29,27,26,395,395,800,800,395,0,0,20,[3,24],[0,0],[0,0],[0,0],10,0,33,35,0,33,0,5,[[10,70],[35,70],[33,70],[9,70],[3,70]],0,[],["夏鹏展原是太极门中弟子，因贼性难改，落草","做了强盗，使一路太极剑法，手中落云剑阴狠","无比。","",""]],
107=>["进香客",0,0,38,0,0,0,0,1000,0,0,2,26,29,21,26,27,26,320,320,0,0,320,0,0,0,[3,23],[0,0],[0,0],[0,0],100,0,0,0,0,0,0,5,[[10,5],[2,5],[3,3],[9,5],[1,5]],0,[],["一个虔诚的香客。","","","",""]],
108=>["迎客道童",0,0,19,0,0,0,0,40000,2,0,2,20,27,22,20,30,25,200,200,0,0,200,0,0,0,[3,22],[0,0],[0,0],[0,0],100,32,0,0,36,0,0,7,[[10,50],[2,50],[32,50],[3,50],[9,50],[36,50],[1,50]],0,[],["一个瘦瘦的小道士，正傻呵呵的不知笑什么。","","","",""]],
109=>["知客道长",0,0,37,0,0,0,0,70000,10,0,2,30,22,25,27,30,27,395,395,300,300,395,0,0,20,[3,22],[0,0],[0,0],[0,0],100,32,33,35,36,33,0,9,[[10,80],[2,80],[35,80],[32,80],[33,80],[3,80],[9,80],[36,80],[1,80]],0,[],["太极门第三代弟子中杰出的人物。虽不是很聪","明，但师祖却很看重他。","","",""]],
110=>["阿绣",0,1,22,0,0,0,0,55000,15,0,2,28,28,28,24,24,22,485,485,900,900,485,0,0,17,[3,4],[0,0],[0,0],[0,0],100,37,39,0,41,39,0,9,[[10,60],[37,60],[39,60],[40,60],[2,60],[41,60],[3,60],[9,60],[1,60]],0,[],["史婆婆的贴身丫头。","","","",""]],
111=>["白瑞德",6,0,54,0,0,0,0,800000,50,0,6,34,28,22,25,24,24,695,695,2500,2500,695,0,0,0,[3,22],[1,-19],[0,0],[0,0],100,37,39,40,41,37,0,10,[[2,150],[3,150],[9,140],[1,140],[10,140],[37,180],[39,170],[40,150],[41,250],[11,80]],0,[],["威德先生白瑞德身材高大，多年来凭借深厚内","力和精微剑法一直独步雪山。雪山派在他的带","领下也隐隐然成为西北的宗主大派。","",""]],
112=>["张福来",-1,0,48,0,0,0,0,10000,0,0,2,20,22,21,25,11,26,320,320,0,0,320,0,0,0,[0,0],[0,0],[0,0],[0,0],1000,0,0,0,0,0,0,3,[[10,10],[2,20],[9,20]],1,[[1,3]],["张福来是雪山派的厨师，手艺远近闻名。","","","",""]],
113=>["欧阳千善",0,0,25,0,0,0,0,25000,5,0,2,23,24,20,27,20,26,420,420,400,400,420,0,0,19,[3,27],[0,0],[0,0],[0,0],2000,37,39,40,41,0,0,9,[[10,40],[37,40],[39,40],[40,40],[2,40],[41,40],[4,40],[9,40],[1,40]],0,[],["雪山门下有很多巡使，因为外人很少能到这里","，谷内的巡使大多武功不高。这位巡使身披白","袍，腰跨长剑。白袍当胸绣着一只飞扬欲脱的","大鹏鸟。",""]],
114=>["马千刚",0,0,24,0,0,0,0,65000,35,0,2,20,29,22,27,112,27,475,475,700,700,475,0,0,19,[3,27],[0,0],[0,0],[0,0],1500,37,39,40,41,0,0,9,[[10,80],[37,80],[39,80],[40,80],[2,80],[41,80],[3,80],[9,80],[1,80]],0,[],["这位马先生来自遥远的大雪山。乃是白瑞德座","下有名的高手之一。","","",""]],
115=>["赵千猛",0,0,24,0,0,0,0,65000,10,0,2,27,25,23,24,112,26,475,475,700,700,475,0,0,0,[3,27],[0,0],[0,0],[0,0],100,37,0,40,41,0,0,9,[[10,80],[37,80],[39,80],[40,80],[2,80],[41,70],[3,80],[9,80],[1,80]],0,[],["雪山门下有名的高手之一赵千猛。他远看还不","错，走近了才发现他长着长长的一张鸟嘴。","","",""]],
116=>["薛千柔",0,1,23,0,0,0,0,20000,5,0,2,25,21,28,28,22,27,280,280,0,0,280,0,0,19,[3,16],[0,0],[0,0],[0,0],100,37,39,0,41,39,0,8,[[37,30],[10,30],[39,30],[2,30],[41,30],[3,30],[9,30],[1,30]],0,[],["雪山门下的女弟子。","","","",""]],
117=>["史婆婆",0,1,54,0,0,0,0,130000,60,0,2,27,24,20,27,21,28,570,570,1000,1000,570,0,0,18,[3,26],[0,0],[0,0],[0,0],20000,37,39,40,41,0,0,9,[[10,110],[37,110],[39,110],[40,110],[2,110],[41,110],[3,110],[9,110],[1,110]],0,[],["这位史婆婆是本门的一位前辈，白瑞德初出道","时她出了不少力，后来受邀出任本门护法。","","",""]],
118=>["花万红",0,0,30,0,0,0,0,60000,20,0,2,30,28,30,25,30,26,470,470,600,600,470,0,0,0,[3,27],[0,0],[0,0],[0,0],100,0,0,0,0,0,0,5,[[10,60],[2,60],[9,60],[3,60],[1,60]],0,[],["雪山二代弟子，平日少言寡语。","","","",""]],
119=>["封万剑",6,0,34,0,0,0,0,160000,2,0,2,24,28,25,25,27,23,570,570,1000,1000,570,0,0,19,[3,27],[0,0],[0,0],[0,0],100,0,39,40,41,39,0,9,[[2,120],[3,120],[9,120],[1,100],[10,120],[38,120],[39,120],[40,120],[41,120]],0,[],["封万剑是威德先生的大弟子，一身武功尽得威","德先生真传，据说在雪山剑法上的造诣已不在","掌门人之下。","",""]],
120=>["王万轫",0,0,31,0,0,0,0,75000,35,0,2,21,21,29,27,25,24,545,545,900,900,545,0,0,19,[3,28],[0,0],[0,0],[0,0],100,37,39,0,41,39,0,9,[[10,90],[37,90],[39,90],[40,90],[2,90],[41,90],[3,90],[9,90],[1,90]],0,[],["大雪山巡山总管--神鹰使者，负责四处巡查，","八方联络。","","",""]],
121=>["齐万翼",0,0,32,0,0,0,0,110000,50,0,2,28,23,25,28,112,26,695,695,1500,1500,695,0,0,19,[3,27],[0,0],[0,0],[0,0],100,37,39,40,41,0,0,9,[[10,100],[37,100],[39,100],[40,100],[2,100],[41,100],[3,100],[9,100],[1,100]],0,[],["白瑞德座下四护法之一，额头高耸，一看就知","道功力深厚。","","",""]],
122=>["柯万锺",0,0,32,0,0,0,0,110000,60,0,2,50,28,25,21,24,25,570,570,1000,1000,570,0,0,0,[3,28],[0,0],[0,0],[0,0],100,37,0,40,41,37,0,7,[[37,100],[10,100],[40,100],[2,100],[41,100],[9,100],[1,100]],0,[],["柯万锺是有名的大力士，以前在狮驼山做二大","王，狮驼山被剿灭后他跟着齐万翼投奔白瑞德","，做了护法。生平最怕的是老鼠，看到尖嘴猴","腮的人就讨厌。",""]],
123=>["雪山教头",6,0,40,0,0,0,0,50000,0,0,2,22,22,20,27,21,21,420,420,400,400,420,0,0,19,[3,27],[0,0],[0,0],[0,0],100,0,38,40,41,38,0,8,[[2,50],[3,50],[9,50],[1,50],[10,50],[38,60],[40,50],[41,50]],0,[],["这是雪山派的武功教头，负责掌管新进弟子的","武功学习，别看他面目和蔼，可督导练功却凶","得吓人，雪山弟子都很敬重他。","",""]],
124=>["雪豹",0,0,25,0,0,0,0,50000,0,0,0,38,29,25,26,25,28,420,420,0,0,420,0,0,0,[3,-29],[0,0],[0,0],[0,0],10,0,0,0,0,0,0,3,[[2,80],[9,80],[10,80]],0,[],["大雪山独有的猛兽，尤其皮毛甚是珍贵。","","","",""]],
125=>["道德和尚",0,0,56,0,0,0,0,10,0,0,10,21,26,29,27,20,24,100,100,0,0,100,0,0,0,[3,4],[0,0],[0,0],[0,0],10,0,0,0,0,0,0,0,[],0,[],["慈眉善目的得道高僧，似乎从来没有烦恼。","","","",""]],
126=>["李也白",0,0,38,0,0,0,0,40000,3,0,0,25,25,20,26,23,29,395,395,300,300,395,0,0,15,[3,4],[1,-16],[0,0],[0,0],500,0,33,0,0,33,0,4,[[10,45],[3,75],[9,85],[33,70]],0,[],["放荡不羁的吟游诗人，听说剑法很不错。","","","",""]],
127=>["艾里克",0,0,101,0,0,0,0,1000000,20,0,2,25,24,20,21,25,22,695,695,1500,1500,695,0,0,0,[3,29],[0,0],[0,0],[0,0],50000,44,45,46,47,44,0,12,[[10,150],[2,150],[44,150],[42,150],[43,150],[4,150],[45,150],[9,150],[46,150],[11,120],[1,150],[47,150]],0,[],["艾里克是远古的凯尔特人，也是第一批迁居到","捷克地区的移民。成为吸血鬼后艾里克一直独","自隐居在波希米亚的森林，过着原始人般的生","活，所以很自然的加入了兽王派。",""]],
128=>["巴巴雷恩",0,0,32,0,0,0,0,1000000,20,0,2,35,35,14,24,21,21,695,695,1500,1500,695,0,0,0,[3,29],[0,0],[0,0],[0,0],50000,43,45,46,47,43,0,12,[[10,150],[2,150],[44,150],[42,150],[43,150],[4,150],[45,150],[9,150],[46,150],[11,120],[1,150],[47,150]],0,[],["野蛮人--他是文明边缘的几个部落中的成员。","在部落之间不间断的战争中使他能够活下来得","益于他那野蛮人的坚定意志和强健的体格。他"," 能够敏锐地感觉他周围的环境。",""]],
129=>["北海鳄神",7,0,40,0,0,0,0,500000,20,0,2,30,24,20,29,20,29,520,520,800,800,520,0,0,8,[3,29],[1,-30],[1,-32],[0,0],10000,43,45,46,47,45,0,11,[[2,110],[4,110],[9,110],[1,110],[10,110],[43,110],[45,180],[46,110],[47,110],[11,110],[48,140]],0,[],["北海鳄神长着蓬松的头发，长长的胡子，突出","的眼眶，看上去很吓人，其实他心地很好，可","大家见了他都跑，所以他只能和鳄鱼作朋友。","",""]],
130=>["花佗",7,0,62,0,0,0,0,60000,20,0,4,20,24,34,24,22,27,695,695,1500,1500,695,0,0,0,[3,4],[0,0],[0,0],[0,0],10000,42,0,46,47,42,0,9,[[2,40],[9,40],[1,40],[10,40],[42,40],[46,60],[47,40],[11,120],[48,80]],0,[],["花佗模仿虎、鹿、熊、猿、鸟的动作和姿态，","创造了创建了一套五禽戏功法，修习后外融百","骸畅，中适一念无；旷然忘所在，心与虚俱空","，是全民健身运动的倡导者。现隐居兽王派，","作个名誉总管。"]],
131=>["李猎户",0,0,40,0,0,0,0,2000,2,0,2,20,20,20,21,22,24,420,420,400,400,420,0,0,0,[3,29],[0,0],[0,0],[0,0],100,42,45,46,47,42,0,12,[[10,20],[2,20],[44,20],[42,20],[43,20],[4,20],[45,20],[9,20],[46,20],[11,20],[1,20],[47,20]],0,[],["一个看起来精明能干的猎户。","","","",""]],
132=>["娜可露",7,1,16,0,0,0,0,2000000,20,0,8,30,30,16,21,21,26,800,800,2000,2000,800,0,0,0,[3,24],[3,26],[0,0],[0,0],100000,44,45,46,47,44,0,13,[[2,180],[4,180],[9,180],[1,180],[10,180],[42,180],[43,180],[44,180],[45,180],[46,180],[47,180],[11,150],[48,180]],0,[],["活泼开朗、纯真善良的少女剑士娜可露露，因","为大自然受魔物残害而发出哀嚎，所以集合志","同道合之士创立兽王派，并出任第一任掌门，","以维护大自然的安宁为目标。",""]],
133=>["索莱斯",0,1,32,0,0,0,0,150000,20,0,2,14,24,34,21,24,25,620,620,1200,1200,620,0,0,0,[3,18],[0,0],[0,0],[0,0],10000,44,45,46,47,44,0,12,[[10,60],[2,60],[44,60],[42,60],[43,60],[4,60],[45,60],[9,60],[46,60],[11,120],[1,60],[47,60]],0,[],["孤独和隐居的个性使很多人不能理解她，一些","时候她看起来反复无常，但是事实上，她懂得","在次序和混乱之间的战斗的真谛，就象在战斗","中她和战士一样出色。",""]],
134=>["人猿泰山",0,0,22,0,0,0,0,160000,40,0,2,35,35,14,22,20,29,510,510,1000,1000,510,0,0,0,[3,29],[3,6],[0,0],[0,0],10000,42,45,46,47,42,0,12,[[10,70],[2,70],[44,70],[42,70],[43,70],[4,70],[45,70],[9,70],[46,70],[11,120],[1,70],[47,70]],0,[],["在非洲原始森林成了孤儿的婴孩在猿猴家族的","照料下长大成人，人类探险和出现打破了他宁","静和平和世界，而人类将对猿猴家族的伤害更","使他加入野兽派来维护动物的权益。",""]],
135=>["王猎户",0,0,40,0,0,0,0,2000,2,0,2,20,20,20,26,26,22,420,420,400,400,420,0,0,0,[3,29],[0,0],[0,0],[0,0],100,44,45,46,47,44,0,12,[[10,20],[2,20],[44,20],[42,20],[43,20],[4,20],[45,20],[9,20],[46,20],[11,20],[1,20],[47,20]],0,[],["一个看起来精明能干的猎户。","","","",""]],
136=>["张猎户",0,0,40,0,0,0,0,2000,2,0,2,20,20,20,21,22,24,420,420,400,400,420,0,0,0,[3,29],[0,0],[0,0],[0,0],100,42,45,46,47,42,0,12,[[10,20],[2,20],[44,20],[42,20],[43,20],[4,20],[45,20],[9,20],[46,20],[11,20],[1,20],[47,20]],0,[],["一个看起来精明能干的猎户。","","","",""]],
137=>["赵猎户",0,0,40,0,0,0,0,2000,2,0,2,20,20,20,22,21,22,420,420,400,400,420,0,0,0,[3,29],[0,0],[0,0],[0,0],100,43,45,46,47,43,0,12,[[10,20],[2,20],[44,20],[42,20],[43,20],[4,20],[45,20],[9,20],[46,20],[11,20],[1,20],[47,20]],0,[],["一个看起来精明能干的猎户。","","","",""]],
138=>["葛洪",8,0,60,0,0,0,0,200000,20,20,2,20,24,44,21,25,22,620,620,1200,1200,620,1200,1200,0,[0,0],[3,21],[0,0],[0,0],5000,49,0,50,51,49,52,13,[[2,80],[9,80],[1,80],[8,80],[10,80],[49,80],[50,80],[51,80],[52,80],[53,80],[54,80],[11,80],[55,80]],0,[],["东晋道士，喜爱建筑，曾在罗浮山南麓建四庵","，南庵即为现在的冲虚观，为人平和，弟子们","都爱找他聊天。","",""]],
139=>["华岳",0,0,20,0,0,0,0,50000,20,0,2,20,20,20,24,21,21,370,370,600,600,370,0,0,0,[3,4],[0,0],[0,0],[0,0],100,49,0,50,51,49,0,7,[[10,40],[2,40],[49,40],[9,40],[50,40],[1,40],[51,40]],0,[],["一个聪明机灵的小道士。","","","",""]],
140=>["空虚",0,0,20,0,0,0,0,50000,20,0,2,20,20,20,29,20,29,370,370,600,600,370,0,0,0,[3,4],[0,0],[0,0],[0,0],100,49,0,50,51,49,0,7,[[10,40],[2,40],[49,40],[9,40],[50,40],[1,40],[51,40]],0,[],["一个有点木讷的小道士。","","","",""]],
141=>["留孙真人",8,0,70,0,0,0,0,700000,20,20,2,20,24,24,24,22,27,820,820,2000,2000,820,2000,2000,0,[3,21],[1,-31],[0,0],[0,0],10000,49,0,50,51,49,53,13,[[2,140],[9,140],[1,140],[8,140],[10,140],[49,140],[50,140],[51,140],[52,140],[53,140],[54,140],[11,140],[55,140]],0,[],["一个茅山道士，外人传言他能预知未来，可他","从来不说什么！","","",""]],
142=>["茅哀",0,0,44,0,0,0,0,1000000,20,0,6,20,24,44,21,22,24,945,945,2500,2500,945,0,0,0,[3,21],[0,0],[0,0],[0,0],10000,49,0,50,51,49,0,7,[[10,150],[2,150],[49,150],[9,150],[50,150],[1,150],[51,150]],0,[],["茅盈之弟，汉地节四年（公元前66年）拜上都","太守，不久转为河西太守。后辞官而去，修","习道家之术，与茅盈，茅固并称茅山三圣。","",""]],
143=>["茅固",0,0,44,0,0,0,0,1000000,20,0,6,20,24,44,21,21,26,945,945,2500,2500,945,0,0,0,[3,21],[3,30],[0,0],[0,0],10000,49,0,50,51,49,0,7,[[10,150],[2,150],[49,150],[9,150],[50,150],[1,150],[51,150]],0,[],["茅盈之弟，在汉景帝时已官至家孝廉，其后一","直官运享通，春风得意，后经茅盈施法设盛宴","点化，随其兄入山采药，济世救人，并修习道","家之术。",""]],
144=>["茅盈",8,0,88,0,0,0,0,2000000,40,40,8,20,24,40,21,24,25,1070,1070,3000,3000,1070,3000,3000,0,[3,21],[0,0],[0,0],[0,0],50000,49,0,50,51,49,54,13,[[2,180],[9,180],[1,180],[8,250],[10,180],[49,180],[50,180],[51,180],[52,250],[53,250],[54,250],[11,180],[55,180]],0,[],["茅山派开山祖师，隐居修炼于以奇险著名天下","的西岳华山，秦始皇三十九年（公元前248年","）九月庚于日，修成正果，得成大道。","",""]],
145=>["明月",0,0,20,0,0,0,0,50000,20,0,2,20,20,20,29,20,29,370,370,600,600,370,0,0,0,[3,4],[0,0],[0,0],[0,0],100,49,0,50,51,49,0,7,[[10,40],[2,40],[49,40],[9,40],[50,40],[1,40],[51,40]],0,[],["一个结实的小道士。","","","",""]],
146=>["小清风",0,0,20,0,0,0,0,50000,20,0,2,20,20,20,29,20,29,370,370,600,600,370,0,0,0,[3,4],[0,0],[0,0],[0,0],100,49,0,50,51,49,0,7,[[10,40],[2,40],[49,40],[9,40],[50,40],[1,40],[51,40]],0,[],["一个能干的小道士。","","","",""]],
147=>["张伯雨",0,0,62,0,0,0,0,900000,20,0,2,20,24,25,28,24,20,670,670,1400,1400,670,0,0,0,[3,21],[0,0],[0,0],[0,0],10000,49,0,50,51,49,0,7,[[10,150],[2,150],[49,150],[9,150],[50,150],[1,150],[51,150]],0,[],["伯雨是元代时的神仙道教人物，他做道士后更","加仰慕齐梁“华阳隐居”陶弘景的风范,因而","自号“句曲外史”，名嗣真，字天雨，号贞居","子，又名称张雨。",""]],
148=>["干匠",0,0,62,0,0,0,0,900000,20,0,2,20,24,25,28,24,20,670,670,1400,1400,670,0,0,0,[0,0],[0,0],[0,0],[0,0],10000,49,0,50,51,49,0,7,[[10,150],[2,150],[49,150],[9,150],[50,150],[1,150],[51,150]],0,[],["他是铸剑师干匠，拥有许多神兵利器。","","","",""]],
149=>["墨邪",0,1,30,0,0,0,60,50000,30,0,2,20,24,25,28,24,20,500,500,700,700,500,0,0,0,[0,0],[0,0],[0,0],[0,0],100,49,0,50,51,49,0,7,[[10,60],[2,60],[49,60],[9,60],[50,10],[1,60],[51,60]],0,[],["干匠的妻子，越女剑的传人。","","","",""]],
150=>["黑无常",0,0,30,0,0,0,60,350000,50,0,0,25,24,25,28,24,20,1000,1000,1500,800,1000,0,0,0,[0,0],[0,0],[0,0],[0,0],100,44,0,46,51,44,0,7,[[10,70],[2,70],[44,70],[9,70],[46,70],[1,70],[51,70]],0,[],["一个黑衣漆黑面皮的使者，黝黑的脸上看不出","任何喜怒哀乐。","","",""]],
151=>["白无常",0,0,30,0,0,0,60,350000,50,0,0,25,24,25,28,24,20,1000,1000,1500,800,1000,0,0,0,[0,0],[0,0],[0,0],[0,0],100,44,0,46,51,44,0,7,[[10,70],[2,70],[44,70],[9,70],[46,70],[1,70],[51,70]],0,[],["一个白衣白净面皮的使者，死白的脸上看不出","任何喜怒哀乐。","","",""]],
152=>["秦广王",0,0,60,0,0,0,100,1500000,60,0,0,20,20,20,20,30,20,800,800,850,800,800,0,0,0,[0,0],[0,0],[0,0],[0,0],10000,44,0,46,51,44,0,7,[[10,140],[2,140],[44,120],[9,140],[46,100],[1,120],[51,100]],0,[],["阴间十王之一。","","","",""]],
153=>["宋帝王",0,0,100,0,0,0,100,1100000,35,0,0,20,20,35,20,30,20,600,600,700,1000,600,0,0,0,[0,0],[0,0],[0,0],[0,0],10000,44,0,46,51,44,0,7,[[10,120],[2,120],[44,120],[9,120],[46,100],[1,150],[51,100]],0,[],["阴间十王之一。","","","",""]],
154=>["楚江王",0,0,80,0,0,0,100,1320000,50,0,0,20,20,35,20,30,20,900,900,1150,1000,900,0,0,0,[0,0],[0,0],[0,0],[0,0],10000,44,0,46,51,44,0,7,[[10,150],[2,150],[44,120],[9,150],[46,100],[1,150],[51,100]],0,[],["阴间十王之一。","","","",""]],
155=>["仵官王",0,0,60,0,0,0,100,1300000,50,0,0,20,20,35,20,30,20,800,800,750,1000,800,0,0,0,[0,0],[0,0],[0,0],[0,0],10000,44,0,46,51,44,0,7,[[10,150],[2,150],[44,120],[9,150],[46,100],[1,150],[51,100]],0,[],["阴间十王之一。","","","",""]],
156=>["平等王",0,0,70,0,0,0,100,1300000,35,0,0,20,20,35,20,30,20,900,900,650,1000,900,0,0,0,[0,0],[0,0],[0,0],[0,0],10000,44,0,46,51,44,0,7,[[10,130],[2,130],[44,120],[9,130],[46,100],[1,130],[51,100]],0,[],["阴间十王之一。","","","",""]],
157=>["都市王",0,0,100,0,0,0,100,1300000,35,0,0,20,20,35,20,30,20,1000,1000,1150,1000,1000,0,0,0,[0,0],[0,0],[0,0],[0,0],10000,44,0,46,51,44,0,7,[[10,140],[2,140],[44,100],[9,140],[46,100],[1,140],[51,100]],0,[],["阴间十王之一。","","","",""]],
158=>["泰山王",0,0,100,0,0,0,100,1300000,50,0,0,20,20,35,20,30,20,1000,1000,1150,1000,1000,0,0,0,[0,0],[0,0],[0,0],[0,0],10000,44,0,46,51,44,0,7,[[10,150],[2,150],[44,100],[9,150],[46,100],[1,150],[51,100]],0,[],["阴间十王之一。","","","",""]],
159=>["轮转王",0,0,100,0,0,0,100,1160000,50,0,0,20,20,35,20,30,20,900,900,450,400,900,0,0,0,[0,0],[0,0],[0,0],[0,0],10000,44,0,46,51,44,0,7,[[10,139],[2,139],[44,100],[9,139],[46,100],[1,139],[51,100]],0,[],["阴间十王之一。","","","",""]],
160=>["卞城王",0,0,100,0,0,0,100,1100000,50,0,0,20,20,35,20,30,20,800,800,450,400,800,0,0,0,[0,0],[0,0],[0,0],[0,0],10000,44,0,46,51,44,0,7,[[10,119],[2,119],[44,100],[9,119],[46,100],[1,119],[51,100]],0,[],["阴间十王之一。","","","",""]],
161=>["阎罗王",0,0,50,0,0,0,100,3000000,60,0,0,20,20,35,20,10,20,1100,1100,1150,1000,1100,0,0,0,[0,0],[0,0],[0,0],[0,0],10000,44,0,46,51,44,0,7,[[10,150],[2,150],[44,150],[9,150],[46,150],[1,150],[51,150]],0,[],["阴间十王之一，他面如锅底，须若钢针，这就","是阎罗王。","","",""]],
162=>["山大王",0,0,50,0,0,0,100,250000,50,0,0,30,100,35,30,30,20,1000,1000,1300,1300,1000,0,0,8,[0,0],[0,0],[0,0],[0,0],10000,13,14,15,16,13,0,11,[[2,50],[4,50],[9,50],[1,50],[10,50],[12,50],[13,50],[14,50],[15,50],[16,50],[11,50]],0,[],["他腰广十围，身高三丈，手执一口刀，锋刃多","明亮，占山自称王，磊落凶模样。","","",""]],
163=>["青龙坛主",0,0,50,0,0,0,0,200000,50,0,0,30,30,35,30,30,20,1000,1000,1500,1500,1000,0,0,8,[1,-22],[0,0],[0,0],[0,0],100,13,14,15,16,13,0,11,[[2,60],[4,60],[9,60],[1,60],[10,60],[12,60],[13,60],[14,60],[15,60],[16,60],[11,60]],0,[],["黑暗势力青龙坛坛主。","","","",""]],
164=>["总瓢把子",0,0,37,0,0,0,0,2000000,40,0,0,26,29,31,23,30,26,1070,1070,3400,3400,1070,0,0,22,[3,14],[0,0],[0,0],[0,0],100,17,19,20,21,17,0,12,[[2,200],[6,200],[4,200],[9,200],[1,200],[10,200],[17,200],[18,200],[19,200],[20,200],[21,200],[11,200]],0,[],["黑暗势力的总瓢把子，一切阴谋都是他搞出来","的。","","",""]],
165=>["朱雀坛主",0,0,62,0,0,0,0,500000,2,0,0,35,24,34,29,25,21,720,720,2600,2600,720,0,0,26,[1,-24],[3,4],[0,0],[0,0],100,0,24,25,26,24,0,11,[[2,100],[5,100],[9,100],[1,100],[10,100],[23,100],[24,100],[25,100],[26,100],[11,100],[27,100]],0,[],["黑暗势力朱雀坛坛主。","","","",""]],
166=>["玄武坛主",0,0,64,0,0,0,0,1000000,2,0,0,24,26,27,23,22,21,695,695,3000,3000,695,0,0,8,[1,-26],[3,4],[0,0],[0,0],100,28,29,30,31,29,0,10,[[2,140],[4,140],[9,140],[1,140],[10,140],[28,140],[29,140],[30,140],[31,140],[11,140]],0,[],["黑暗势力玄武坛坛主。","","","",""]],
167=>["天徽坛主",0,0,62,0,0,0,0,1500000,1,0,0,28,28,28,27,20,25,745,745,3700,3700,745,0,0,15,[1,-28],[3,21],[0,0],[0,0],100,0,33,35,36,33,0,12,[[2,180],[4,180],[3,180],[9,180],[1,180],[10,180],[32,180],[33,180],[35,180],[34,180],[36,180],[11,180]],0,[],["黑暗势力天徽坛坛主。","","","",""]],
168=>["紫煞坛主",0,0,54,0,0,0,0,800000,50,0,0,34,28,22,25,24,24,695,695,2500,2500,695,0,0,0,[1,-27],[3,22],[0,0],[0,0],100,37,39,40,41,37,0,10,[[2,180],[3,180],[9,180],[1,180],[10,180],[37,180],[39,180],[40,180],[41,180],[11,180]],0,[],["黑暗势力紫煞坛坛主。","","","",""]],
169=>["山岚坛主",0,0,16,0,0,0,0,700000,40,0,0,30,30,16,21,21,26,640,640,2000,2000,640,0,0,0,[1,-25],[3,24],[3,26],[0,0],100,44,45,46,47,44,0,12,[[10,120],[2,120],[44,120],[42,120],[43,120],[4,120],[45,120],[9,120],[46,120],[11,120],[1,120],[47,120]],0,[],["黑暗势力山岚坛坛主。","","","",""]],
170=>["地罡坛主",0,0,88,0,0,0,0,300000,20,0,0,20,24,40,21,24,25,670,670,3000,3000,670,0,0,0,[1,-23],[3,21],[0,0],[0,0],100,49,0,50,51,49,0,7,[[10,90],[2,90],[49,90],[9,90],[50,90],[1,90],[51,90]],0,[],["黑暗势力地罡坛坛主。","","","",""]],
171=>["月下老人",0,0,101,0,0,0,0,500000,0,0,6,16,24,25,21,27,22,1000,1000,1000,1000,1000,0,0,0,[0,0],[0,0],[0,0],[0,0],1000,0,0,0,0,0,0,4,[[10,40],[2,20],[9,50],[1,30]],0,[],["他就是专管天上地下姻缘的月下老人，他满脸","红光，须眉皆白，正坐在那儿翻看一本书，手","上黏着一根红绳，口中正自言自语着些什么。","",""]],
172=>["老管家",0,0,50,0,0,0,100,250000,50,0,0,30,100,35,30,30,20,1000,1000,1300,1300,1000,0,0,0,[0,0],[0,0],[0,0],[0,0],10000,13,14,15,16,13,0,11,[[2,50],[4,50],[9,50],[1,50],[10,50],[12,50],[13,50],[14,50],[15,50],[16,50],[11,50]],0,[],["眼前这个慈眉善目的老管家，就正是当初的山","大王！为报答你的不杀之恩，心甘情愿地为你","当管家，把家里管得井井有条。","",""]],
173=>["地罡喽猡",0,0,88,0,0,0,0,300000,20,0,0,20,24,40,21,24,25,670,670,3000,3000,670,0,0,0,[3,21],[0,0],[0,0],[0,0],100,49,0,50,51,49,0,7,[[10,90],[2,90],[49,90],[9,90],[50,90],[1,90],[51,90]],0,[],["黑暗势力地罡坛一个小喽猡。","","","",""]],
174=>["朱雀喽猡",0,0,62,0,0,0,0,500000,2,0,0,35,24,34,29,25,21,720,720,2600,2600,720,0,0,26,[3,4],[0,0],[0,0],[0,0],100,0,24,25,26,24,0,11,[[2,100],[5,100],[9,100],[1,100],[10,100],[23,100],[24,100],[25,100],[26,100],[11,100],[27,100]],0,[],["黑暗势力朱雀坛一个小喽猡。","","","",""]],
175=>["朱雀喽猡",0,0,62,0,0,0,0,500000,2,0,0,35,24,34,29,25,21,720,720,2600,2600,720,0,0,26,[3,4],[0,0],[0,0],[0,0],100,0,24,25,26,24,0,11,[[2,100],[5,100],[9,100],[1,100],[10,100],[23,100],[24,100],[25,100],[26,100],[11,100],[27,100]],0,[],["黑暗势力朱雀坛一个小喽猡。","","","",""]],
176=>["山岚喽猡",0,1,16,0,0,0,0,700000,40,0,0,30,30,16,21,21,26,640,640,2000,2000,640,0,0,0,[3,24],[3,26],[0,0],[0,0],100,44,45,46,47,44,0,12,[[10,120],[2,120],[44,120],[42,120],[43,120],[4,120],[45,120],[9,120],[46,120],[11,120],[1,120],[47,120]],0,[],["黑暗势力山岚坛一个小喽猡。","","","",""]],
177=>["山岚喽猡",0,1,16,0,0,0,0,700000,40,0,0,30,30,16,21,21,26,640,640,2000,2000,640,0,0,0,[3,24],[3,26],[0,0],[0,0],100,44,45,46,47,44,0,12,[[10,120],[2,120],[44,120],[42,120],[43,120],[4,120],[45,120],[9,120],[46,120],[11,120],[1,120],[47,120]],0,[],["黑暗势力山岚坛一个小喽猡。","","","",""]],
178=>["山岚喽猡",0,1,16,0,0,0,0,700000,40,0,0,30,30,16,21,21,26,640,640,2000,2000,640,0,0,0,[3,24],[3,26],[0,0],[0,0],100,44,45,46,47,44,0,12,[[10,120],[2,120],[44,120],[42,120],[43,120],[4,120],[45,120],[9,120],[46,120],[11,120],[1,120],[47,120]],0,[],["黑暗势力山岚坛一个小喽猡。","","","",""]],
179=>["玄武喽猡",0,0,64,0,0,0,0,1000000,2,0,0,24,26,27,23,22,21,695,695,3000,3000,695,0,0,8,[3,4],[0,0],[0,0],[0,0],100,28,29,30,31,29,0,10,[[2,140],[4,140],[9,140],[1,140],[10,140],[28,140],[29,140],[30,140],[31,140],[11,140]],0,[],["黑暗势力玄武坛一个小喽猡。","","","",""]],
180=>["玄武喽猡",0,0,64,0,0,0,0,1000000,2,0,0,24,26,27,23,22,21,695,695,3000,3000,695,0,0,8,[3,4],[0,0],[0,0],[0,0],100,28,29,30,31,29,0,10,[[2,140],[4,140],[9,140],[1,140],[10,140],[28,140],[29,140],[30,140],[31,140],[11,140]],0,[],["黑暗势力玄武坛一个小喽猡。","","","",""]],
181=>["玄武喽猡",0,0,64,0,0,0,0,1000000,2,0,0,24,26,27,23,22,21,695,695,3000,3000,695,0,0,8,[3,4],[0,0],[0,0],[0,0],100,28,29,30,31,29,0,10,[[2,140],[4,140],[9,140],[1,140],[10,140],[28,140],[29,140],[30,140],[31,140],[11,140]],0,[],["黑暗势力玄武坛一个小喽猡。","","","",""]],
182=>["玄武喽猡",0,0,64,0,0,0,0,1000000,2,0,0,24,26,27,23,22,21,695,695,3000,3000,695,0,0,8,[3,4],[0,0],[0,0],[0,0],100,28,29,30,31,29,0,10,[[2,140],[4,140],[9,140],[1,140],[10,140],[28,140],[29,140],[30,140],[31,140],[11,140]],0,[],["黑暗势力玄武坛一个小喽猡。","","","",""]],
183=>["紫煞喽猡",0,0,54,0,0,0,0,800000,50,0,0,34,28,22,25,24,24,695,695,2500,2500,695,0,0,0,[3,22],[0,0],[0,0],[0,0],100,37,39,40,41,37,0,10,[[2,180],[3,180],[9,180],[1,180],[10,180],[37,180],[39,180],[40,180],[41,180],[11,180]],0,[],["黑暗势力紫煞坛一个小喽猡。","","","",""]],
184=>["紫煞喽猡",0,0,54,0,0,0,0,800000,50,0,0,34,28,22,25,24,24,695,695,2500,2500,695,0,0,0,[3,22],[0,0],[0,0],[0,0],100,37,39,40,41,37,0,10,[[2,180],[3,180],[9,180],[1,180],[10,180],[37,180],[39,180],[40,180],[41,180],[11,180]],0,[],["黑暗势力紫煞坛一个小喽猡。","","","",""]],
185=>["紫煞喽猡",0,0,54,0,0,0,0,800000,50,0,0,34,28,22,25,24,24,695,695,2500,2500,695,0,0,0,[3,22],[0,0],[0,0],[0,0],100,37,39,40,41,37,0,10,[[2,180],[3,180],[9,180],[1,180],[10,180],[37,180],[39,180],[40,180],[41,180],[11,180]],0,[],["黑暗势力紫煞坛一个小喽猡。","","","",""]],
186=>["紫煞喽猡",0,0,54,0,0,0,0,800000,50,0,0,34,28,22,25,24,24,695,695,2500,2500,695,0,0,0,[3,22],[0,0],[0,0],[0,0],100,37,39,40,41,37,0,10,[[2,180],[3,180],[9,180],[1,180],[10,180],[37,180],[39,180],[40,180],[41,180],[11,180]],0,[],["黑暗势力紫煞坛一个小喽猡。","","","",""]],
187=>["天徽喽猡",0,0,62,0,0,0,0,1500000,1,0,0,28,28,28,27,20,25,745,745,3700,3700,745,0,0,15,[3,21],[0,0],[0,0],[0,0],100,0,33,35,36,33,0,12,[[2,180],[4,180],[3,180],[9,180],[1,180],[10,180],[32,180],[33,180],[35,180],[34,180],[36,180],[11,180]],0,[],["黑暗势力天徽坛一个小喽猡。","","","",""]],
188=>["天徽喽猡",0,0,62,0,0,0,0,1500000,1,0,0,28,28,28,27,20,25,745,745,3700,3700,745,0,0,15,[3,21],[0,0],[0,0],[0,0],100,0,33,35,36,33,0,12,[[2,180],[4,180],[3,180],[9,180],[1,180],[10,180],[32,180],[33,180],[35,180],[34,180],[36,180],[11,180]],0,[],["黑暗势力天徽坛一个小喽猡。","","","",""]],
189=>["天徽喽猡",0,0,62,0,0,0,0,1500000,1,0,0,28,28,28,27,20,25,745,745,3700,3700,745,0,0,15,[3,21],[0,0],[0,0],[0,0],100,0,33,35,36,33,0,12,[[2,180],[4,180],[3,180],[9,180],[1,180],[10,180],[32,180],[33,180],[35,180],[34,180],[36,180],[11,180]],0,[],["黑暗势力天徽坛一个小喽猡。","","","",""]],
190=>["天徽喽猡",0,0,62,0,0,0,0,1500000,1,0,0,28,28,28,27,20,25,745,745,3700,3700,745,0,0,15,[3,21],[0,0],[0,0],[0,0],100,0,33,35,36,33,0,12,[[2,180],[4,180],[3,180],[9,180],[1,180],[10,180],[32,180],[33,180],[35,180],[34,180],[36,180],[11,180]],0,[],["黑暗势力天徽坛一个小喽猡。","","","",""]],
191=>["暗黑喽猡",0,1,37,0,0,0,0,2000000,40,0,0,26,29,31,23,30,26,1070,1070,3400,3400,1070,0,0,22,[3,14],[0,0],[0,0],[0,0],100,17,19,20,21,17,0,12,[[2,200],[6,200],[4,200],[9,200],[1,200],[10,200],[17,200],[18,200],[19,200],[20,200],[21,200],[11,200]],0,[],["黑暗势力白虎坛一个小喽猡。","","","",""]],
192=>["暗黑喽猡",0,1,37,0,0,0,0,2000000,40,0,0,26,29,31,23,30,26,1070,1070,3400,3400,1070,0,0,22,[3,14],[0,0],[0,0],[0,0],100,17,19,20,21,17,0,12,[[2,200],[6,200],[4,200],[9,200],[1,200],[10,200],[17,200],[18,200],[19,200],[20,200],[21,200],[11,200]],0,[],["黑暗势力白虎坛一个小喽猡。","","","",""]],
193=>["暗黑喽猡",0,1,37,0,0,0,0,2000000,40,0,0,26,29,31,23,30,26,1070,1070,3400,3400,1070,0,0,22,[3,14],[0,0],[0,0],[0,0],100,17,19,20,21,17,0,12,[[2,200],[6,200],[4,200],[9,200],[1,200],[10,200],[17,200],[18,200],[19,200],[20,200],[21,200],[11,200]],0,[],["黑暗势力白虎坛一个小喽猡。","","","",""]],
194=>["暗黑喽猡",0,1,37,0,0,0,0,2000000,40,0,0,26,29,31,23,30,26,1070,1070,3400,3400,1070,0,0,22,[3,14],[0,0],[0,0],[0,0],100,17,19,20,21,17,0,12,[[2,200],[6,200],[4,200],[9,200],[1,200],[10,200],[17,200],[18,200],[19,200],[20,200],[21,200],[11,200]],0,[],["黑暗势力白虎坛一个小喽猡。","","","",""]],
195=>["我是谁",-2,0,42,0,0,0,0,2500000,80,0,0,30,30,30,20,20,20,1600,1600,4000,4000,1600,0,0,29,[3,24],[0,0],[0,0],[0,0],10000,0,29,15,36,29,0,8,[[2,100],[4,200],[9,100],[1,200],[10,200],[29,250],[15,180],[36,180]],0,[],["？？？","","","",""]],
196=>["东方求败",-2,1,30,0,0,0,0,3600000,100,0,0,35,38,25,20,50,10,1972,1972,822,822,1972,0,0,30,[3,1],[3,13],[0,0],[0,0],18000,0,33,20,36,33,0,9,[[2,150],[3,200],[9,180],[1,200],[10,200],[56,60],[33,250],[20,250],[36,200]],0,[],["？？？","","","",""]],
197=>["道德和尚",-2,0,56,0,0,0,0,5000000,160,0,0,40,32,32,40,10,40,2500,2500,5000,5000,2500,0,0,0,[3,21],[0,0],[0,0],[0,0],1000,37,0,35,36,37,0,7,[[2,200],[9,120],[1,200],[10,200],[37,250],[35,250],[36,250]],0,[],["？？？","","","",""]],
198=>["恶人",0,0,34,0,0,0,0,10,0,0,0,20,20,20,20,20,20,100,100,0,0,100,0,0,0,[3,4],[0,0],[0,0],[0,0],10,0,0,0,0,0,0,0,[],0,[],["","","","",""]]}
    for i in 1..198
      $data_enemies[i].name = npcs[i][0]
      $data_enemies[i].type = npcs[i][1]
      $data_enemies[i].gender = npcs[i][2]
      $data_enemies[i].age = npcs[i][3]
      $data_enemies[i].base_hit = npcs[i][4]
      $data_enemies[i].base_eva = npcs[i][5]
      $data_enemies[i].base_atk = npcs[i][6]
      $data_enemies[i].base_def = npcs[i][7]
      $data_enemies[i].eva = npcs[i][5]
      $data_enemies[i].atk = npcs[i][6]
      $data_enemies[i].pdef = npcs[i][7]
      $data_enemies[i].exp = npcs[i][8]
      $data_enemies[i].fp_plus = npcs[i][9]
      $data_enemies[i].mp_plus = npcs[i][10]
      $data_enemies[i].morals = npcs[i][11]
      $data_enemies[i].base_str = npcs[i][12]
      $data_enemies[i].base_agi = npcs[i][13]
      $data_enemies[i].base_int = npcs[i][14]
      $data_enemies[i].str = npcs[i][12]
      $data_enemies[i].agi = npcs[i][13]
      $data_enemies[i].int = npcs[i][14]
      $data_enemies[i].base_bon = npcs[i][15]
      $data_enemies[i].base_fac = npcs[i][16]
      $data_enemies[i].base_luc = npcs[i][17]
      $data_enemies[i].hp = npcs[i][18]
      $data_enemies[i].maxhp = npcs[i][19]
      $data_enemies[i].fp = npcs[i][20]
      $data_enemies[i].maxfp = npcs[i][21]
      $data_enemies[i].full_hp = npcs[i][22]
      $data_enemies[i].mp = npcs[i][23] 
      $data_enemies[i].maxmp = npcs[i][24]
      $data_enemies[i].weapon_id = npcs[i][25]
      $data_enemies[i].item1 = npcs[i][26]
      $data_enemies[i].item2 = npcs[i][27]
      $data_enemies[i].item3 = npcs[i][28]
      $data_enemies[i].item4 = npcs[i][29]
      $data_enemies[i].gold = npcs[i][30]
      $data_enemies[i].skill_use = [npcs[i][31],npcs[i][32],npcs[i][33],npcs[i][34],npcs[i][35],npcs[i][36]]
      $data_enemies[i].skill_count = npcs[i][37]
      $data_enemies[i].skill_list = npcs[i][38]
      $data_enemies[i].sell_count = npcs[i][39]
      $data_enemies[i].sell_item = npcs[i][40]
      $data_enemies[i].des_text = npcs[i][41]
    end
    # 任务及事件数据
    $data_tasks=RPG::Task.new
    task_npc = []
    for i in 1..149
      task_npc.push([0,$data_enemies[i].id,$data_enemies[i].exp]) if not [2,6,10,25,26,31].include?(i)
    end
    (task_npc.size-2).downto(0) do |i|
      (0..i).each do |j|
        task_npc[j],task_npc[j+1]=task_npc[j+1],task_npc[j] if task_npc[j][2]>task_npc[j+1][2]
      end
    end
    $data_tasks.npc_list=task_npc
    task_item=[]
    for i in 1..32
      task_item.push([1,$data_items[i].id,$data_items[i].exp]) if $data_items[i].exp !=-1
    end
    for i in 1..31
      task_item.push([2,$data_weapons[i].id,$data_weapons[i].exp]) if $data_weapons[i].exp !=-1
    end
    for i in 1..33
      task_item.push([3,$data_armors[i].id,$data_armors[i].exp]) if $data_armors[i].exp !=-1
    end
    (task_item.size-2).downto(0) do |i|
      (0..i).each do |j|
        task_item[j],task_item[j+1]=task_item[j+1],task_item[j] if task_item[j][2]>task_item[j+1][2]
      end
    end
    $data_tasks.find_list=task_item
    # 地图有效区域
    area=[[1,1,20,12],[5,3,13,11],[1,1,20,12],[5,3,13,11],[5,3,13,11],
        [5,3,13,11],[4,2,14,12],[4,2,14,12],[5,3,13,11],[2,1,8,12],
        [2,3,16,11],[9,1,15,12],[1,2,30,20],[4,2,14,12],[5,3,13,11],
        [5,3,13,11],[5,3,13,11],[3,1,15,13],[2,2,16,12],[6,4,12,10],
        [0,0,29,29],[4,2,15,11],[4,0,14,13],[4,3,15,11],[4,0,15,20],
        [5,1,14,12],[2,0,16,14],[2,0,16,14],[6,2,13,11],[0,0,9,9],
        [10,0,19,9],[0,5,9,14],[10,8,14,12],[0,0,19,18],[2,6,16,10],
        [8,4,14,10],[4,0,13,9],[5,4,11,10],[4,0,13,9],[3,0,17,14],
        [6,0,15,9],[6,2,13,11],[6,5,15,14],[4,0,13,9],[6,2,13,11],
        [4,5,13,14],[0,0,0,0],[0,0,0,0],[2,1,19,7],[2,0,13,14],
        [3,1,15,7],[3,0,15,20],[5,2,13,10],[5,2,13,10]]
    bad_area=[]
    bad_map=[]
    for i in 0..53
      x_min=area[i][0]
      y_min=area[i][1]
      x_max=area[i][2]
      y_max=area[i][3]
      $game_map.setup(i+3)
      real_x_y=[]
      for j in x_min..x_max
        for k in y_min..y_max
          if $game_map.check_event(j,k) ==nil and $game_map.passable?(j,k,2)
            real_x_y.push([j,k])
          end
        end
      end
      bad_area.push real_x_y unless real_x_y.size==0
      bad_map.push(i+3) unless real_x_y.size==0
    end
    $data_tasks.bad_area=bad_area
    $data_tasks.bad_map=bad_map
    # 数组序号为门派序号，[武器,拳脚,兵刃,轻功,内功,招架,法术,技能数量,[技能ID列表]]
    $data_tasks.bad_data=[nil,[8,12,14,15,16,14,0,9,[1,2,4,9,10,12,14,15,16]],
          [21,17,19,20,21,19,0,9,[1,2,6,9,10,17,19,20,21]],
          [25,23,24,25,26,24,0,9,[1,2,5,9,10,23,24,25,26]],
          [8,28,29,30,31,29,0,9,[1,2,4,9,10,28,29,30,31]],
          [20,32,33,35,36,33,0,9,[1,2,3,9,10,32,33,35,36]],
          [20,37,39,40,41,39,0,9,[1,2,3,9,10,37,39,40,41]],
          [8,44,45,46,47,45,0,9,[1,2,4,9,10,44,45,46,47]],
          [0,49,0,50,51,49,0,7,[1,2,9,10,49,50,51]]]
    # ID=>[[任务类型，物品类型，ID，数量],[物品类型，ID，数量]]
    $data_tasks.quest_list={2=>[[1,1,6,2],[3,2,1]],5=>[[1,1,5,1],[2,9,1]],
                      13=>[[1,1,7,18],[3,16,1]],20=>[[1,1,17,30],[2,16,1]],
                      30=>[[1,3,2,1],[3,5,1]],37=>[[1,1,10,1],[3,24,1]],
                      47=>[[1,1,12,1],[1,11,1]],64=>[[1,1,15,1],[1,14,1]],
                      68=>[[1,2,7,1],[2,24,1]],90=>[[1,1,2,10],[1,13,1]]}
  #--------------------------------------------------------------------------
  # ● 判断拜师条件[类型，数值]
  #    判断数组中元素数量大于2表示，A或B任一条件满足即可
  #    类型：0--无要求，-1--性别：0--男性，1--女性，2--？性
  #          1-56--技能等级，-2--内力上限，-3--外貌，-4--后天膂力
  #          -5--后天敏捷，-6--后天悟性，-7--后天根骨，-8--先天膂力
  #          -9--先天敏捷，-10--先天悟性，-11--先天根骨，-12--法力上限
  #    数值：≥0表示要求≥数值，否则为≤
  #--------------------------------------------------------------------------
    $data_tasks.teacher_need={39=>[[-1,0]],44=>[[-1,0],[-2,500],[16,50],[14,50]],
          48=>[[-1,0],[-2,800],[16,100],[14,100]],57=>[[-1,1]],
          58=>[[-1,1],[17,60]],59=>[[-1,1],[-3,25,-6,31],[11,100],[-2,1000]],
          67=>[[-1,1],[17,30]],74=>[[0,0]],81=>[[26,100],[-4,30]],
          88=>[[28,60]],91=>[[0,0]],95=>[[31,120],[-4,32]],97=>[[0,0]],
          98=>[[0,0]],102=>[[-2,1500],[36,120],[32,100],[-6,28]],
          111=>[[-2,1200,41,100],[-7,32]],119=>[[-5,23],[41,40]],
          123=>[[-5,22]],130=>[[-10,-18]],129=>[[46,60]],
          132=>[[46,100],[47,100],[45,100]],138=>[[-10,28]],
          141=>[[55,80]],144=>[[-6,40],[-12,1500]]}
    $data_tasks.tan_reward=["你已经过了这一关。",
                            "你得到了50000经验值。",
                            "你得到了50000经验值，60000金钱。",
                            "你的内力增加了150点。",
                            "你得到了60000金钱，200点内力。",
                            "你得到了60000点经验，200点内力。",
                            "你的功夫增加了3级，得到60000金钱。",
                            "你的功夫增加了3级，得到60000经验。",
                            "你的功夫增加了3级，得到200点内力。"]
    $data_tasks.tan_finish="你已经功德圆满！"
    # XX坛传送点地图ID=>[X,Y]
    $data_tasks.tan_map_xy={59=>[[16,7]],
                            60=>[[11,10],[3,7]],
                            61=>[[18,6]],
                            62=>[[6,2],[3,12],[17,12]],
                            63=>[[7,2],[3,17]],
                            64=>[[1,7]],
                            65=>[[18,1]],
                            66=>[[5,2]]}
    $data_tasks.sword_weapon=[8,15,25,21]
    $data_text=RPG::Text.new
    $data_text.have_sword="你已经有一个了，别太贪心了。"
    $data_text.welcome_sword="欢迎来到铸剑谷！"
    $data_text.choose_type = "你想要铸造什么兵器？"
    $data_text.sword_unequip="你必须先放下自制的武器才能铸造。"
    $data_text.sword_no_exp="墨邪远远对你喊到：从上次铸造至今，你江湖历练还不够呀，再给你铸造也是瞎费工夫！"
    $data_text.sword_no_gold="干匠远远对你喊到：铸造要花钱的，我还要养活老婆，我不会白给你作工的！"
    $data_text.rename_sword="铸造成功！要给你的新武器重新起名吗？"
    $data_text.sword_is_making="你的武器正在铸造！下次进入游戏时就会铸好，那时别忘了给你铸造的武器起个响亮的名字呦！"
    $data_text.sword_status="你的『name』\n铸造需要经验：exp\n铸造需要金钱：gold"
    $data_text.enter_sword="呵呵，我的铸剑谷随时对你开放！"
    $data_text.sword_ask="作为铸剑师，不但要精通铸造技能，还要了解每种武器的性能。你也想进我的铸剑谷吗？"
    $data_text.sword_no_bag="你身上的东西太多了，什么也拿不起来。"
    $data_text.sword_battle=["干匠递给你一把大砍刀，说道：先让我的夫人墨邪试试你对刀的掌握吧。",
                             "干匠笑了笑，刀是用得不错，再让我夫人墨邪考考你的剑吧。",
                             "干匠想了想，说道：再看看你对重兵器的掌握，给你这把钢杖试试。",
                             "干匠直点头，不错不错，来来来，再见识见识你的鞭法，拿好这枝长鞭。"]
    $data_text.sword_pass="干匠冲你一躬身，施主武艺果然了得，好吧，去我的铸剑谷自己去打造趁手的武器吧。"
    $data_text.sword_fail="墨邪对干匠说，老公，他也不过如此嘛，不能让他进咱们的铸剑谷。"
    $data_text.sword_win="你看了看干匠，还考什么？"
    $data_text.sword_no_match=["墨邪哼了一声：我们考的是刀，你这算什么？",
                               "墨邪哼了一声：我们考的是剑，你这算什么？",
                               "墨邪哼了一声：我们考的是杖，你这算什么？",
                               "墨邪哼了一声：我们考的是鞭，你这算什么？"]
    $data_text.bad_name1=["赵","钱","孙","李","周","吴","郑","王"]
    $data_text.bad_name2=["梅","竹","兰","菊","英","雄","豪","杰"]
    $data_text.end_com=["邪恶天使","盖世大侠","好好先生","浪子杀手",
               "无情名捕","冷血屠夫","绝代佳人","神行太保","舞林高手",
               "灌篮高手","普通菜鸟"]
    $data_text.scroll_name=[
         "========================序幕========================",
         "                       *尾声*                       "]
    $data_text.scroll_start=<<_b_
    在这件事没发生之前，我一直在平静地生活着；如果这

件事没有发生，那么我会依然这样平静甚至有点单调地继续

生活下去。可是最终它还是发生了，就是现在，在我按下按

钮的时候，我启动了远古大陆英雄坛的时空转换装置。当我

从时空扭曲的强大力场中恢复知觉的时候，我已经来到了这

片传说中的神秘的土地。这里无法考证年代，我所来到的地

方好像是中原偏西的位置，一个不大不小的小镇，镇上行人

混杂，还算热闹，从他们的交谈中我得知这里叫“平安小镇

”，而当我注视自己的时候才发现，我已经变成了一个十四

岁的少年！                                          

这里有什么秘密？                                    

这里是造就英雄的熔炉或是邪恶的渊源？                

我不知道，我只知道，从今以后，我的生活将完全改变……

_b_
    $data_text.scroll_end=[]
    $data_text.scroll_end[0]=<<_END_
我是谁：不要以为你真的打败了我，这只是剧情的安排。
    
其实还有两个更精采的结……                        
    
画外音：快下场！你已经说的够多了。                
    
我走到六芒星阵中央，按下了时空转换的按钮。        
    
                  。。。。。。                    
                      
_END_
    $data_text.scroll_end[1]=<<_END_
东方求败：为了所谓的正义，可以不择手段吗？我只是做
    
了自己想做的事，我错了吗？倒是你，一直生活在正义的
    
阴影下，失去了自我，那才是可悲呢。                
    
住口！你这样的人也配谈正义吗？                    
    
东方求败：想杀人灭口吗？可惜我还不想死。再见了。  
    
不知什么时候东方求败打开了时空转换装置。看着他渐渐
    
变小的背影，我毫不犹豫地冲了上去。                
    
                    。。。。。。                  

_END_
    $data_text.scroll_end[2]=<<_END_
道德和尚：你赢了。但是请施主记住，正义终将战胜邪恶。

只可惜你却看不到那一天了。                        
          
我慢慢走近，一刀劈了下去。                        

就象砍进棉花里，没有任何声音，道德和尚在一瞬间消失

了。难道说。。。                                  

轰－！                                            

我惊异地发现，这一刀斩在了时空转换装置上。        
    
周围的景物在迅速的变更，感觉如同掉进了无尽的深渊。
    
                    。。。。。。                  

_END_
    $data_text.end_text=[]
    $data_text.end_text[0]=["“喂，喂！醒醒！太阳都晒到屁股了。",
          "再不起床就要迟到啦。”","？？？","一阵忙乱之后。",
          "“有没有搞错？今天可是星期日啊！”","。。。。。。"]
    $data_text.end_text[1]=["终于着陆了。眼前是一个嘈杂的市场。",
          "到处都是蓝眼睛白皮肤的外国人，而且装扮也很奇怪。",
          "“请问，这里是拍片现场吗？”","“WHAT YOU SAY？”",
          "不会吧？竟然来到了中世纪的欧洲。","MY GOD！"]
    $data_text.boss_text=[]
    $data_text.boss_text[0]=[1,"在每个故事的结尾，通常都会有一个最终BOSS。",
          1,"遇上我，是你的不幸，要怪就怪那个幕后的导演吧！"]
    $data_text.boss_text[1]=[1,"哈哈----------！没想到吧。",2,"难道神秘人是……",
          1,"不错。",1,"十年前，自诩为名门正派的六大门派合力偷袭，把我关在这里……",
          2,"我会把你再次封印。",1,"做梦吧。以你的实力，十万年还早！"]
    $data_text.boss_text[2]=[1,"苦海无边，回头是岸。",2,"不可能！",1,
          "施主罪孽深重，老纳是不会让你回到原来的世界再次危害天下的。施主，请回吧。",
          2,"请选择："]
    $data_text.all_work=["扫地","挑水","劈柴"]
    $data_text.give_work_text="老身年事已高，有好心人帮帮我『work』吗？"
    $data_text.finish_work_text="费了老大力气，总算干完了！"
    $data_text.work_undo_text="老身吩咐你的事做完了么？"
    $data_text.work_tired_text="婆婆呀，手都累软了，我们老板都没你狠。"
    $data_text.not_work_text="唉！你在江湖上也小有名气了，老身使唤不动你了！"
    $data_text.work_text=[["扫地扫地我扫地","地上还有西瓜皮","婆婆家中欠打扫",
                  "尘土满天难呼吸"],["挑水挑水我挑水","倒水进缸水花飞",
                  "一桶两桶三四桶","反正不用交水费"],["劈柴劈柴我劈柴",
                  "抡起斧子劈起来","保护树木讲环保","婆婆没事别乱烧"]]
    $data_text.has_reward_text="看你红光满面，还是先去顾炎武处领赏吧。"
    $data_text.finish_task_text="你完成了任务，去顾炎武处领赏吧。"
    $data_text.woman_ask="使用item完成任务吗？"
    $data_text.gu_no_reward="努力吧，干活儿去吧！"
    $data_text.tan_start="老夫把这张青龙坛的地图送给你，希望你能为民除害。"
    $data_text.task_undo_text=["老夫不是说过请去拜见name的吗？","妾身还盼着您的name呢！","老夫不是让你解决name吗？"]
    $data_text.give_task_text=["请速去拜见name！","今天妾身想请人去找name，能否帮个忙？","老夫夜观天象，name阳寿已尽，你去解决他！"]
    $data_text.no_npc_live="什么？你把人杀光了？I服了YOU！"
    $data_text.no_kill_task="最讨厌伪君子了，马上从我面前消失！"
    $data_text.i_know_text="我知道了，多谢来访！"
    $data_text.you_bad_text="你不是通缉犯吗？来人，给我拿下！"
    $data_text.bad_undo_text="在下不是请你去收服name的吗？"
    $data_text.no_bad_task="多谢，奸邪暂时已经除尽了，先歇息一下吧！"
    $data_text.give_bad_text="近有恶人『name』在place为非作歹，请速去为民除害！"
    $data_text.stone_undo_text="怎么还没有把石料送过去？偷懒可不成！"
    $data_text.stone_less_exp="你的经验还不够，我不放心把石料交给你。"
    $data_text.stone_more_exp="像您这样身份高贵的人不适合做这种苦工！"
    $data_text.stone_full_bag="你身上的东西太多了，你还背得动石料么？"
    $data_text.no_stone_task="工地现在不需要石料。"
    $data_text.give_stone_text="把这些石料送到工地去，少不了你的好处！"
    $data_text.finish_stone_text="大老远跑来，辛苦你了！"
    $data_text.lose_stone_text="你真粗心，一定是半路上把石料丢了。"
    $data_text.no_stone_task2="你是干什么的？别在工地乱跑！"
    $data_text.reward_text="你被奖励了："
    $data_text.reward_money_text=" money 金钱"
    $data_text.reward_exp_text=" exp 点实战经验"
    $data_text.reward_pot_text=" pot 点潜能"
    $data_text.sp_talk_text={1=>["这位客官也是来吃豆腐的么？","我的豆腐又白又嫩，你不想尝尝？"],
              2=>["我最爱吃糖葫芦了，你喜欢吃吗？","嘻嘻，昨天捡到个亮闪闪的东西，戴上去晕头转向，真好玩！"],
              5=>["真奇怪，我条案上的肉不见了，真是急人！"],
              9=>["客官买花吗？"],
              11=>["高价收购，价格公道，童叟无欺！"],
              125=>["色即是空，空即是色。","善恶常在一念之间，施主要好生把握。"],
              13=>["潘小莲的豆腐真好吃。","每次去豆腐店，总要买上一斤二两。"],
              17=>["听说有一个六芒星阵，可以任意转换时空。","打开六芒星阵，需要六块三角石板。"],
              19=>["挑件趁手的兵器吧！"],
              20=>["你也喜欢钓鱼吗？南郊有个鱼塘，里面有好多鱼呀！"],
              126=>["人生得意须尽欢，莫使金樽空对月。"],
              27=>["又大又甜的糖葫芦哟！"],
              28=>["顾先生说过，寸金难买寸光阴哟。","顾先生真有学问，光毛笔就一大堆，昨天我还捡了一支。","人之初性本善……上大人孔己己……下面是……"],
              29=>["这位客官，想做身衣服吗？"],
              30=>["真是不巧，我的老花镜不见了，现在什么都做不了……唉！"],
              34=>["嘿嘿，没了我胡屠户，就只能吃混毛猪！"],
              35=>["客官想来点什么，别看我们店小，东西可不少！","这位客官进来喝杯茶歇歇腿吧！"],
              37=>["这些官没一个不贪的，几个小钱就能让他们比孙子还听话！"],
              38=>["居家过日子，买点杂货？"],
              47=>["我家小爷的书缺了两页，所以总是说瞧不懂，那两页就在那贼人身上。","都是那个贼人，把我害成这个样子，我……我一直记得他！"],
              53=>["正宗的十八学士茶花，只有我们大理才有！"],
              64=>["真可惜，当时没有纸笔，没办法将那篇清心普善咒记录下来。","我家主人真是学识渊博，那天她吟诵的清心普善咒真是博大精深。"],
              65=>["我们四姐妹从小就跟随尊主,一直形影不离。","我们尊主不但武功精深,文采更是不凡。"],
              68=>["这里大家都对我很好，可是我……","以前公子常吟诵“小红低唱我吹箫”，如今箫在人无，唉！"],
              86=>["唉！来了这么多天也没能见到花讽院主，你说是不是我带的礼物太少了。"],
              90=>["为了吃，为了吃，一天都在忙。","师傅总是不给我吃饱，嘻嘻……我偷了他的……","我一顿能吃10个包子，是不是该申请急你死记录？"],
              112=>["天气寒冷，喝碗酥油茶暖暖身子吧。"],
              124=>["&$$^&^^(^("],
              139=>["这位施主，捐点香火钱积点阴德，修些福缘吧。"],
              198=>["小兔崽子儿，我看你是不想活了！！"]}
    $data_text.quest_talk={2=>["太好了！我拿这个和你换了吧！","你给我的糖葫芦真好吃。"],
              5=>["我用这把祖传的宝刀换你身上的猪肉，你换吗？","真是谢谢你啊，我的祖传宝刀还好用吗？"],
              13=>["太好了，我能吃你的豆腐吗？","嘻嘻，穿上很漂亮吧。"],
              20=>["这位客官身上的鱼可以送给小人吗？","我前天钓鱼钓上来一把破剑，留着也是无用就送给客官了！"],
              30=>["你身上的老花镜反正用不着，送给他吗？","太感谢了，看你也是穷小子，这件精制布衣就送给你了。"],
              37=>["老夫一生致力于炼丹，你身上的仙丹可否让我研究研究？","大恩不言谢，这件「金环锁子甲」乃赵云遗物，老夫就送给你了！"],
              47=>["你身上这两页纸好眼熟，能给我看看吗？","你看，加上这两页，就是一本书了！"],
              64=>["你有笔，太好了，借我用一下吧！","我现在还记得清清楚楚，现在就默写下来给你。"],
              68=>["你身上的白玉箫是我家公子以前身上之物，可否送给我以作纪念？","门主送给我一把「红拂尘」，我无意学武，就送给你了！"],
              90=>["包子！我最爱吃的包子！不管那么多了，你给我包子，我就用这本书跟你换了！","你的包子真好吃，呵呵！"],
              111=>["难得你有这份孝心，拿王蛇胆来孝敬老夫，我今天就把雪花六出的第六剑传授于你！"],
              139=>["多谢你的捐赠，神明一定会保佑你的。[你的福缘增加了！]"]}
    $data_text.normal_talk=["name打了个哈哈：今天的天气真是，哈哈。",
          "我什么也都不知道，就算知道也不说，打死你我也不说。",
          "name看了你一眼，转身又忙自己的事情去了。",
          "没看到我在忙吗？你还是找别人CHAT去吧。",
          "name睁大眼睛望着你，显然不知道你在说什么。"]
    $data_text.shop_buy_text="要买什么你自己看看吧！"
    $data_text.shop_sell_text="有什么不用的东西就拿来吧！"
    $data_text.daxia_exp="去去去，攒够经验再来吧！"
    $data_text.have_school=["你已自创门派，无需拜师吧？","你已另有名师，还想到我这儿来偷学师艺吗？"]
    $data_text.baishi_suc="你跪了下来，向name恭恭敬敬地磕了四个响头，叫道：「师父」！"
    $data_text.baishi_text={39=>["我八卦门功夫一向传男不传女，你还是另择名师吧。",
               "好吧，我暂且收下你，不过我爹的功夫我只学会三成，有机会你再向他老人家请教吧。"],
          44=>["我八卦门功夫一向传男不传女，你还是另择名师吧。",
               "你内力不足，无法修习八卦门高深武功。",
               "你混元一气功火候不够，无法修习八卦门高深武功。",
               "你还是先将刀法练好再说吧。",
               "好吧，从今天起我亲授你功夫，你和宝震就是师兄弟了。"],
          48=>["我八卦门功夫一向传男不传女，你还是另择名师吧。",
               "你内力不足，无法修习八卦门高深武功。",
               "你混元一气功火候不够，无法修习八卦门高深武功。",
               "八卦刀是我派绝学，想当年老夫就凭一把八卦紫金刀闯荡天下，你还是先将刀法练好再说吧。",
               "很好，没想到老夫就破例收你做关门弟子。"],
          57=>["我花间派向来只收女弟子，你还是另择名师吧。",
               "我花间派文武双修，多加努力吧。"],
          58=>["我花间派向来只收女弟子，你还是另择名师吧。",
               "你一剪梅花手功夫尚未纯熟，兵刃功夫又怎学得？",
               "掌门人要求只收俊俏女子……不过……好吧，我就收下你了。"],
          59=>["我花间派向来只收女弟子，你还是另择名师吧。",
               "我的嫡传弟子莫不是聪明伶俐，美貌如花，收你入门岂不有损我花间派的名头？",
               "我花间派各路武功均蕴有深意，你读书识字基础不够，焉能领会高深武功？",
               "你内力修为不足，还是下去勤修好了再来吧！",
               "有你这样伶俐俊秀的弟子相伴左右也是乐事，为师一定好好点拨于你。"],
          67=>["我花间派向来只收女弟子，你还是另择名师吧。",
               "你一剪梅花手功夫尚未纯熟，兵刃功夫又怎学得？",
               "掌门人要求只收俊俏女子……不过……好吧，我就收下你了。"],
          74=>["很好，牢记红莲教义，跟我勤修武功吧。"],
          81=>["你普天同济心法火候不够，无法修习更高深武学。",
               "你膂力不足，无法领会乱披风杖法的精髓。",
               "很好，牢记红莲教义，跟我勤修武功吧。"],
          88=>["一刀流技法讲究出手狠辣，你无法拳修为尚且不够，如何能领会高深武功？",
               "你随我好好练吧，保你以后飞黄腾达。"],
          91=>["你随我好好练吧，保你以后飞黄腾达。"],
          95=>["扶桑功夫全需忍术支持，你还是下去勤修好了再来吧！",
               "我派一刀流刀法以威猛著称，力气不够是难有进境的！",
               "你要多加努力，把我扶桑尹贺一派绝学发扬光大。"],
          97=>["难得你有志学武，不过常言道太极三年不伤人，需得有长恒之心才能在太极门中出人头地。"],
          98=>["难得你有志学武，不过常言道太极三年不伤人，需得有长恒之心才能在太极门中出人头地。"],
          102=>["你内力不足，无法修习道家高深武功。",
                "你太极神功火候不够，无法修习道家高深武功。",
                "太极拳是我派精华，还是专心将其练好再说吧。",
                "太极剑讲究意在剑先，悟性不够难于领会其理。",
                "很好，没想到老夫有生之年又觅到一可塑之才。"],
          111=>["我雪山独门武功雪影擒拿手需要深厚内力才可运用，我看你还是下去勤修好了再来吧！",
                "擒拿手需强劲内力，根骨太差进境缓慢，你还是先打好基本功再说吧！",
                "很好，你多加努力，他日必有所成。"],
          119=>["我雪山派武学主旨为招数精妙，依我看你的资质似乎不宜？",
                "你现在的雪山内功太薄弱，无法领会精妙的雪山剑法，还是学好再来吧。",
                "很好，你多加努力，他日争取将雪山剑派在你手中发扬光大。"],
          123=>["我雪山派武学主旨为招数精妙，依我看你的资质似乎不宜？",
                "很好，你跟著我勤加练习，日后如能和封师兄或白老爷子学上几招，那可终身受用。"],
          129=>["五禽戏是我派功夫精髓，你还是练好再来吧。",
                "很好，你很像我，就跟我学功夫吧，爱护动物，保卫环境。"],
          130=>["你这般聪明伶俐，犯不着跟我们一块儿与野兽为伍。",
                "嗯，跟我学好五禽戏，锻炼身体，保卫自己。"],
          132=>["北海鳄神的功夫你还没学到家，还是慢慢来吧！",
                "北海鳄神的功夫你还没学到家，还是慢慢来吧！",
                "北海鳄神的功夫你还没学到家，还是慢慢来吧！",
                "太好了，跟我学好功夫，拯救大自然，也不枉我从虾夷不远万里来此了。"],
          138=>["你如此蠢笨，如何学得高深的法术？",
                "好，难得你有心向道，就跟我一起降妖伏魔，造福人类吧！"],
          141=>["你天师正道功夫不足，难以领会茅山高深法术。",
                "我茅山真是后继有人，以后就靠你罩着我了"],
          144=>["你读书不多，实在难以领会茅山法术的艰深典籍。",
                "你法力修为不足，难以继续学习茅山高深法术。",
                "难得难得，我茅山功夫法力无边，跟着我你就涨学问去吧！"]}
    
    $data_text.drink_water_text="你在井边用杯子舀起井水喝。"
    $data_text.not_drink_text="你已经再也喝不下一滴水了。"
    $data_text.find_item_text="发现name。"
    $data_text.fish_no_hp="现在日头这么毒，以你的体质，恐怕还没钓到鱼就已经……"
    $data_text.fish_no_item=["你看着池塘的鱼，摸了摸肚皮，心中暗自思量：要是现在有个钓竿该多好啊！",
                              "你把鱼从钩上摘下来，猛然想起：坏了，没带鱼篓！一分神，鱼一下子滑到了水里，到手的鱼跑了！"]
    $data_text.start_fish="你在土里刨了刨，抓了只小蚯蚓，穿在钓钩上，一挥手，钓线划出一道优美的弧线扎进了水里，你往地上一蹲，开始钓鱼。"
    $data_text.fish_fail="过了很久也没有鱼上钩，你一收钓竿，到树下乘凉去了。"
    $data_text.fish_suc=["浮子猛然沉了下去，你手疾眼快，一提钓竿，有了！","你把鱼放进鱼篓，心里乐开了花，今天的零花钱有着落了！"]
    $data_text.wanted_text="悬赏缉拿人犯『name』。"
    $data_text.no_wanted_text="本镇治安良好。"
    $data_text.suicide_text="活得太没意思了，真想找根绳子上吊自杀。"
    $data_text.suicide_ask="如果您选择上吊自杀，您的资料就永远删除了！请务必考虑清楚！！"
    $data_text.game_hall_text="一座高山，山顶终年积雪，相传山顶有神仙居住，想上去看看吗？"
    $data_text.play_what_text="这是方圆百里最有名的游戏厅，你想玩甚麽？"
    $data_text.no_int_text="你还是文盲！"
    $data_text.caihua_ask1="真的要修炼吗？"
    $data_text.caihua_ask2="不后悔吗？"
    $data_text.not_read_text="还是先练好本门武功吧。"
    $data_text.drink_wine_text="好困啊…ZZZ…"
    $data_text.run_fail_text = ["user现在动弹不得！",
          "user转身想溜，被target一把抓住：想跑，没门！"]
    $data_text.run_suc_text = "哼，哪里逃！"
    $data_text.kill_text = "actor这一刀是劈还是不劈呢？"
    $data_text.no_die_text = "承让了。"
    $data_text.go_die_text = "actor，去死吧！"
    $data_text.die_text=["二十年后又是一条好汉！","可恶！我怎么会死呢。",
          "有的人活着，他已经死了，有……哎，我还没说完……","啊------！",
          "我会在地狱里等着你的。"]
    $data_text.live_text=[".............."]
    $data_text.save_ok="存档成功！"
    $data_text.quit_ask="真的退出游戏吗？"
    $data_text.save_ask="你已经好久没存档了，现在保存吗？"
    $data_text.no_neigong="你必须先选择你要用的内功心法。"
    $data_text.no_nei_lv="你的内功等级不够！"
    $data_text.fp_plus_max="你目前加力上限为fp_plus"
    $data_text.no_fp="你的内力不够。"
    $data_text.hp_full="你现在体力充沛！"
    $data_text.hp_recover="你深深吸了口气，脸色看起来好多了！"
    $data_text.no_maxfp="你的真气不够，不能用来疗伤。"
    $data_text.bad_hurt="你已受伤过重，只怕一运真气便有生命危险。"
    $data_text.liao_fail="你运功良久，一抖衣袖，长叹一声站起身来。"
    $data_text.no_hurt="你并没有受伤。"
    $data_text.liao_suc=["你全身放松，坐下来开始运功疗伤。","你摧动真气，脸上一阵白一阵红，哇地一声，吐出一口淤血，脸色看起来好多了。"]
    $data_text.liao_finish=["过了好久好久，你经过运功疗伤，感觉到所有的伤都好了！","你运功完毕，精神焕发地站起身来。"]
    $data_text.no_fashu="你必须先选择你要用的法术。"
    $data_text.no_fa_lv="你的法术等级不够！"
    $data_text.mp_plus_max="你目前法力点数上限为mp_plus"
    $data_text.learn_what="你想学什么就说吧。"
    $data_text.learn_no_exp="你的武学经验不足,无法领会更深的功夫！"
    $data_text.learn_no_gold="没钱读什么书啊，回去准备够学费再来吧！"
    $data_text.learn_no_pot="你的潜能已经发挥到极限了，没有办法再成长了。"
    $data_text.no_learn="你的功夫已经不输为师了，真是可喜可贺呀！"
    $data_text.sk_lv_up="你的功夫进步了！"
    $data_text.continue_learn="继续学习吗？"
    $data_text.pra_hurt="你受伤了，还是先治疗要紧！"
    $data_text.pra_no_weapon="趁手的兵器都没有一把，瞎比划什么？"
    $data_text.pra_no_base="想一步登天，可是你基本功夫还没学会呢。"
    $data_text.no_pra="你的功夫很难再有所提高了，还是向师傅请教一下吧"
    $data_text.pra_no_fp="你的内力修为不足，要勤修内功！"
    $data_text.gender=["男","女","？"]
    $data_text.sp_no_maxfp="你内力修为不足，无法使用sp_skill。"
    $data_text.sp_no_fa="你法术等级不够。"
    $data_text.sp_no_hp="你体力不足。"
    $data_text.sp_no_fp="你内力不足。"
    $data_text.sp_no_mp="你法力不足。"
    $data_text.sp_used="你已经在使用sp_skill了。"
    $data_text.sp_no_lv="你的skill修为不够。"
    $data_text.sp_no_match="sp_skill必须配合skill使用。"
    $data_text.sp_no_fp2="你的内力不够。"
    $data_text.sp_is_cd="你刚使用sp_skill绝技不久，现在还不能施用外功。"
    $data_text.self_is_busy="你刚用完外功，还是先歇歇吧。"
    $data_text.aim_is_busy="target目前正自顾不暇，放手攻击吧！"
    $data_text.aim_is_busy2="target已经呆若木鸡了！"
    $data_text.sp_no_attr="你attr不够，无法使用sp_skill！"
    $data_text.magic_net="此种招数对玩家使用有伤天合，还是不用为妙！"
    $data_text.cannot_move="user现在呆若木鸡！"
    $data_text.fly_no_fp="你内力不足，无法施展轻功。"
    $data_text.shop_info="价格：price   金钱：gold"
    $data_text.shop_info2="持有数量：number"
    $data_text.shop_number=["卖出：number个\n总价：total","买入：number个\n总价：total"]
    $data_text.battle_item="大获全胜！战斗获得\n金钱：gold\n物品：item\n"
    $data_text.die_msg=["你的眼前一黑，接着什么也不知道了！\n你死了！",
        "隐约北方现出一座黑色城楼，光线太暗，看不大清楚。许多亡魂正哭哭啼啼地列队前进。\n周围尺高的野草随风摇摆，草中发出呼呼的风声。\n你忽然发现前面多了一个人影，不过那人影又好像已经在那里很久了，只是你一直没发觉。",
        "你揉了揉眼睛，仔细一看，原来那人是判官。\n判官向你招招手，说道：新来的，你莫乱跑，画了生死簿，我好送你还阳。",
        "判官看着你笑了笑，说道：生死有命，你也不要太难过了。\n判官从怀中拿出一个黑底白字的册子翻看著。。。",
        "判官合上册子，说道：命不该死，多留无益，我这便送你还阳去吧！\n判官伸手向你一指，你的魂魄又回到了自己身上。。。一股阴冷的浓雾突然出现，很快地包围了你。"]
    $data_text.game_score=["SCORE:"," TOP :"]
    file=File.open("Data/GmudData.dat","wb")
    data=[]
    data.push(Zlib::Deflate.deflate(Marshal.dump($data_kungfus)))
    data.push(Zlib::Deflate.deflate(Marshal.dump($data_skills)))
    data.push(Zlib::Deflate.deflate(Marshal.dump($data_system)))
    data.push(Zlib::Deflate.deflate(Marshal.dump($data_items)))
    data.push(Zlib::Deflate.deflate(Marshal.dump($data_weapons)))
    data.push(Zlib::Deflate.deflate(Marshal.dump($data_armors)))
    data.push(Zlib::Deflate.deflate(Marshal.dump($data_enemies)))
    data.push(Zlib::Deflate.deflate(Marshal.dump($data_tasks)))
    data.push(Zlib::Deflate.deflate(Marshal.dump($data_text)))
    crcs = []
    key = 9527
    data.each do |i|
      key = Zlib.crc32(i,key)
      crcs.push(key)
    end
    Marshal.dump(data,file)
    Marshal.dump(crcs,file)
    file.close
    # 地图事件
    for i in 1..58
      map = load_data(sprintf("Data/Map%03d.rxdata", i))
      for j in map.events.keys
        for k in 1..198
          if map.events[j].name == k.to_s
            if map.events[j].pages[1] != nil
              map.events[j].pages.delete_at(1)
            end
            map.events[j].pages[0].list = [RPG::EventCommand.new]
            map.events[j].pages[0].list[0].code = 355
            map.events[j].pages[0].list[0].parameters = ["$scene=Scene_Event.new(0,#{k.to_s})"]
            map.events[j].pages[0].list.push(RPG::EventCommand.new)
            break
          end
        end
      end
      save_data(map,sprintf("Data/Map%03d.rxdata", i))
    end
    print "完成"
  end